[{"start": 0, "end": 30, "narrative": "The video shows a presentation at the WebSci'24 conference. The presenter, a man with a beard, is standing at a podium in a lecture hall. He's wearing a black suit jacket and glasses, and is speaking into a microphone.\n\nThe presentation is titled \"Unhumanizing Models: Why We Need to Change How We Think About AI.\" The slide behind him displays this title along with some additional text and a logo.\n\nThe background of the presentation features a stylized image of the Earth with a network of lines connecting different parts of the globe, symbolizing the interconnected nature of the web and AI.\n\nThe setting appears to be a professional conference environment, with a large screen displaying the presentation and a banner for the WebSci'24 conference visible on the right side of the frame.\n\nThe overall atmosphere suggests a serious discussion about the implications of AI and its impact on society, as indicated by the title of the presentation."}, {"start": 30, "end": 60, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a man standing at a podium, giving a talk. He's wearing a dark suit jacket, black shirt, and a black beard. The man appears to be speaking into a microphone, though his words aren't audible.\n\nBehind the presenter, there's a large screen displaying the title of the presentation: \"Unhumanizing Models: Why We Need Models to Change How We Think About AI.\" The screen also shows a website address: www.millenniumchange.org.\n\nTo the right of the screen, there's a vertical banner with the text \"Web2.24\" and a logo featuring a triangle with a globe inside it.\n\nThe room has white walls and a white ceiling. There are black chairs visible in the background, and a black cord is draped over the podium.\n\nThe overall atmosphere suggests a professional conference or seminar setting, likely related to artificial intelligence and its impact on society."}, {"start": 60, "end": 90, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, gray shirt, and a black beard. The man appears to be speaking, gesturing with his hands as he presents.\n\nBehind him is a large screen displaying a slide titled \"Ubiquitous AI\" with an image of a person holding a smartphone. To the right of the screen, there's a banner for \"Web Summit 24\" with a globe design.\n\nThe room has white walls and a white ceiling with a vent. There are black chairs visible in the background. The overall setting suggests this is a professional conference or seminar taking place at the Web Summit event.\n\nThe video appears to be a series of still images or screenshots, showing the presenter at different moments during his presentation."}, {"start": 90, "end": 120, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and a beard. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying various slides related to artificial intelligence. One slide shows a hand holding a smartphone with the text \"Ubiquitous AI\" visible. Another slide reads \"Machine translation\" followed by \"HELL YES\" in bold letters.\n\nTo the right of the screen, there's a banner for \"Web Summit 24\" with a globe and a triangle symbol. The room has white walls and a white ceiling with a vent.\n\nThe video captures the man at different points in his presentation, showing him gesturing with his hands and looking at the audience. The overall atmosphere suggests a professional tech conference focused on AI and machine translation topics."}, {"start": 120, "end": 150, "narrative": "The video shows a presentation taking place in a conference room. A man is standing at a podium, giving a speech. He's wearing a black suit jacket, white shirt, and a black tie. The man has a beard and is gesturing with his hands as he speaks.\n\nBehind the presenter, there's a large screen displaying a slide titled \"Machine translation.\" The slide features an image of a hand holding a smartphone with a speech bubble that reads \"HELL YES.\" The word \"Machine\" is visible at the top of the slide.\n\nTo the right of the screen, there's a vertical banner with the text \"WebS24\" and a logo. The room has white walls and a wooden floor.\n\nThe presenter appears to be discussing machine translation technology, as suggested by the slide and the \"HELL YES\" text, which implies enthusiasm or approval for the topic.\n\nThe video captures the presenter in various poses as he speaks, with the camera focusing on him and the screen behind him. The overall atmosphere suggests a professional conference or seminar setting."}, {"start": 150, "end": 180, "narrative": "The video shows a presentation taking place in a conference room. A man is standing at a podium, giving a talk. He appears to be wearing a suit and has a beard. The presentation is focused on artificial intelligence (AI) models.\n\nThe screen behind the presenter displays various slides related to AI. One slide asks \"What is an AI Model?\" and another shows a phone with the words \"HELL YES\" written on it. There's also a slide that says \"JUST A TOOL.\"\n\nTo the right of the screen, there's a banner for \"WebSe24,\" which seems to be the event or conference where this presentation is taking place. The room has white walls and a wooden floor.\n\nThe presenter is gesturing with his hands as he speaks, likely emphasizing points about AI models. There are some water bottles on the podium, and a laptop is visible on the desk.\n\nThe overall atmosphere suggests a professional setting, possibly a tech conference or seminar focused on AI and machine learning topics."}, {"start": 180, "end": 210, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a large white screen on the wall displaying a slide titled \"What is an AI Model?\" The slide contains text that reads \"JUST A TOOL\" in red handwriting.\n\nTo the right of the screen, there's a podium with a man standing behind it. He appears to be the presenter, wearing a dark suit, white shirt, and glasses. The man is gesturing with his right hand, likely emphasizing a point during his presentation.\n\nOn the podium, there's a laptop and a water bottle. Behind the presenter, there's a vertical banner with the text \"WebSe24\" and a globe image.\n\nThe room has a professional, business-like atmosphere with white walls and a gray floor. There are black chairs visible in the foreground, suggesting this is a formal presentation setting.\n\nThe video captures the presenter at various moments, showing him gesturing and speaking to the audience. The overall scene conveys a professional presentation about artificial intelligence models, emphasizing their role as tools."}, {"start": 210, "end": 240, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a large white screen displaying a slide titled \"What is an AI Model?\" The slide contains text in two sections:\n\n1. \"Just a tool\"\n2. \"Same architecture, seems human\"\n\nThe presenter, a man with a beard and mustache, is standing at a podium to the right of the screen. He's wearing a black suit jacket, white shirt, and black tie. He appears to be gesturing with his hands as he speaks.\n\nTo the right of the presenter, there's a banner for \"Web Summit 24\" with a globe image on it. The room has white walls and a gray floor, with a few black chairs visible.\n\nThe video seems to be a recording of a talk or lecture about artificial intelligence models, specifically discussing their nature and capabilities. The presenter is likely explaining the concept of AI models as tools and comparing their architecture to human-like structures."}, {"start": 240, "end": 270, "narrative": "The video shows a presentation taking place in a conference room. A man is standing at a podium, giving a talk. He's wearing a black suit jacket, blue shirt, and glasses. The presentation is about AI models, with the title \"What is an AI Model?\" displayed on a large screen behind him.\n\nThe screen shows a slide with text that reads:\n- \"JUST A TOOL\"\n- \"SAME ARCHITECTURE\"\n- \"SEEMS HUMAN\"\n\nThere's also a slide titled \"Humanize Everything\" showing an image of a dog with a green balloon.\n\nThe presenter appears to be explaining the concept of AI models, emphasizing that they are tools with a similar structure to human brains. He's gesturing with his hands as he speaks, engaging with the audience.\n\nTo the right of the presenter, there's a banner for \"Web Summit 24\" with a globe image on it. The room has white walls and a gray floor, with a few chairs visible in the background.\n\nThe video captures the presenter's movements and gestures as he delivers his talk, providing a clear view of the presentation content and the speaker's interaction with the audience."}, {"start": 270, "end": 300, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop and microphone in front of him. The man has a beard and is wearing a black suit jacket over a white shirt. He appears to be gesturing with his hands as he speaks.\n\nBehind the presenter is a large screen displaying a slide titled \"Humanize Everything.\" The slide features an image of a black dog sitting on a snowy surface, with a green balloon floating nearby. The background of the slide is white.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo. The banner also includes a triangle with a yellow triangle inside it.\n\nThe setting appears to be a conference room with white walls and a wooden floor. There are black chairs visible in the room.\n\nThe video seems to be a recording of a presentation at the WebSe24 conference, focusing on the theme of humanizing technology or experiences."}, {"start": 300, "end": 330, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket over a white shirt. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Humanize Everything.\" The slide features an image of a black dog sitting on a snowy surface, with a green leaf and a white balloon visible in the background.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo. The room has white walls and a gray floor, with black chairs visible in the background.\n\nThe presentation seems to be about humanizing technology or digital experiences, as suggested by the title and the image of the dog on the slide. The overall setting appears to be a professional conference or seminar environment."}, {"start": 330, "end": 360, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket over a white shirt. He's speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Humanize Everything.\" The slide includes text and images, including a dog and a green leaf. There's also a \"but\" written in pink text.\n\nTo the right of the screen, there's a vertical banner with \"Web Summit 24\" written on it, along with a globe image.\n\nThe setting appears to be a conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe man seems to be in the middle of his presentation, likely discussing the concept of humanizing technology or digital experiences."}, {"start": 360, "end": 390, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket over a white shirt. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Goals for Today.\" The slide lists six human-like capacities in AI models:\n\n1. Knowing\n2. Understanding\n3. Moving\n4. Judging\n5. Feeling\n6. Creating\n\nThe slide also includes a bullet point about understanding why and how models are different.\n\nTo the right of the screen, there's a banner for \"Web Summit 2024\" with a globe logo. The room has white walls and a gray floor, with a few black chairs visible.\n\nThe presentation seems to be focused on the capabilities and differences of AI models, likely discussing how these models can mimic various human abilities."}, {"start": 390, "end": 420, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop and microphone, wearing a black suit jacket, blue shirt, and glasses. The man appears to be discussing artificial intelligence (AI) and its capabilities.\n\nBehind him is a large screen displaying a slide titled \"Goals for Today.\" The slide lists six human-like capacities that AI models can analyze:\n\n1. Knowing\n2. Understanding\n3. Moving\n4. Judging\n5. Feeling\n6. Creating\n\nThe slide also mentions the goal to understand why and how models are different.\n\nTo the right of the screen, there's a banner for \"WebSoc24,\" which seems to be the event or conference name. The setting looks professional, with a white wall and a vent visible.\n\nThe man appears to be in the middle of his presentation, as he's gesturing with his right hand while looking at the screen. The overall atmosphere suggests a serious discussion about AI and its potential applications."}, {"start": 420, "end": 450, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit jacket, blue shirt, and tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide with the title \"Knowing\" and a subtitle about models. The slide also includes a quote that reads, \"A horse is a calculator for a horse.\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a logo and some text underneath.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe man seems to be gesturing with his right hand while speaking, and he's looking towards the audience. The overall atmosphere suggests this is a professional presentation or lecture taking place at a conference or seminar."}, {"start": 450, "end": 480, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and a microphone. The man has a beard and is wearing a suit with a blue shirt and tie. He appears to be gesturing as he speaks.\n\nBehind him is a large screen displaying a forest scene with a horse and the text \"A horse is a calculator for a horse.\"\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe and a triangle symbol.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe man seems to be in the middle of his presentation, possibly discussing the concept of a horse being a calculator for itself, though the exact context isn't clear from this single frame.\n\nThe overall setting appears to be a professional conference or seminar, with the presenter engaging with his audience about some topic related to horses and their unique abilities or perspectives."}, {"start": 480, "end": 510, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a white podium with a laptop on it, wearing a black suit jacket, blue shirt, and glasses. The man has a beard and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a nature scene with trees and a horse. The screen also shows text that reads \"A horse is a calculator for a horse.\"\n\nTo the right of the screen, there's a black banner with white text that says \"WebSe24\" and includes a logo with a triangle and a globe.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe man appears to be in the middle of his presentation, likely discussing the concept of a horse being a calculator for a horse, which seems to be the main topic of his talk.\n\nThe setting looks professional and formal, typical of a business or academic conference."}, {"start": 510, "end": 540, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, blue shirt, and tie. He appears to be speaking into a microphone.\n\nBehind the presenter, there's a large screen displaying a forest scene with a horse walking through it. The screen also shows text that reads \"A horse, a calculator for a horse.\"\n\nTo the right of the screen, there's a vertical banner with \"WebSe24\" written on it, along with a logo and some additional text.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe presenter seems to be in the middle of his speech, gesturing with his right hand while looking at the screen. The overall atmosphere suggests a professional or academic presentation setting."}, {"start": 540, "end": 570, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, blue shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide with the text \"A horse, a calculator for a horse.\" The background of the slide shows a forest scene with a horse walking through it.\n\nTo the right of the screen, there's a banner for \"WebSoc24\" with a logo and some text underneath.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe presentation seems to be about some kind of technology or innovation related to horses, as suggested by the slide content and the WebSoc24 banner."}, {"start": 570, "end": 600, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, blue shirt, and glasses. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Context Knowledge.\" The slide shows an image of a car with the license plate \"KNWTER\" and a person holding a tennis racket. The screen also has a logo for \"Microsoft\" in the bottom left corner.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a logo and some text underneath. The room has white walls and a wooden floor.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while looking at the screen. There are two water bottles on the podium in front of him.\n\nThe overall setting appears to be a professional conference or seminar, with the man likely discussing topics related to context knowledge or Microsoft's work in this area."}, {"start": 600, "end": 630, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and glasses. The man appears to be explaining something related to \"Context Knowledge\" based on the slide projected behind him.\n\nThe slide displays an image of a white van with the license plate \"KNB TER\" and a person holding a tennis racket. The background of the slide is white with a blue circle containing the text \"Context Knowledge.\"\n\nTo the right of the presenter, there's a banner for \"WebSe24\" with a logo and some text, though the details are not clearly visible.\n\nThe setting looks like a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground, and the overall atmosphere suggests a formal presentation or lecture.\n\nThe presenter seems to be gesturing as he speaks, likely emphasizing points from his presentation. The video captures multiple angles of the same scene, showing the presenter from different perspectives as he moves around the podium.\n\nThis appears to be a professional presentation, possibly related to technology or data analysis given the \"WebSe24\" banner and the \"Context Knowledge\" theme."}, {"start": 630, "end": 660, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black pants. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Context Knowledge.\" The slide features an image of a white car with a license plate that reads \"KNB TER.\" There's also a person in a white suit holding a gun, and some text that says \"KNB TER\" and \"KNB TER\" again.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a logo and some text underneath.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the room.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while speaking. The overall atmosphere suggests a formal, business-oriented event focused on technology or security topics."}, {"start": 660, "end": 690, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and microphone, wearing a black suit jacket, blue shirt, and tie. The presenter has a beard and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a basketball court with the text \"Does it Score?\" The screen also shows some mathematical equations related to basketball physics.\n\nTo the right of the presenter, there's a banner for \"WebSe24\" with a globe and triangle logo. The room has white walls and a wooden floor.\n\nThe video appears to be a professional presentation, possibly about the physics of basketball or a related topic. The presenter seems engaged and is likely explaining the content on the screen to an audience."}, {"start": 690, "end": 720, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and a microphone. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into the microphone.\n\nBehind him is a large projection screen displaying a slide titled \"Does it Score?\" The slide contains mathematical equations and a colorful diagram with circles and lines. The background of the slide shows a basketball court with players.\n\nTo the right of the screen, there's a banner for \"WebSoc24\" with a globe image and some text.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe video seems to be a recording of a scientific or academic presentation, possibly related to sports analytics or physics applied to basketball."}, {"start": 720, "end": 750, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black pants. The presenter has a beard and is gesturing with his right hand as he speaks.\n\nBehind the presenter is a large screen displaying a slide titled \"Does it Score?\" The slide contains mathematical equations and a colorful diagram with circles and lines. The background of the slide appears to be a basketball court with players.\n\nTo the right of the screen, there's a vertical banner with \"WebS24\" written on it, along with a globe icon and some additional text.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground, and a black cord is draped over the podium.\n\nThe presenter seems to be explaining the content of the slide, possibly discussing a scientific or mathematical concept related to the equations and diagram shown."}, {"start": 750, "end": 780, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and mustache and is gesturing with his right hand while speaking.\n\nBehind him is a large screen displaying a slide titled \"Counter-Factuals.\" The slide includes a quote from Sherlock Holmes: \"When you have eliminated the impossible, whatever remains, however improbable, must be the truth.\"\n\nTo the right of the screen, there's a banner for \"Web Summit 2016\" and a logo for \"Sherlock Holmes.\" The setting appears to be a professional conference room with white walls and a gray floor.\n\nThe man seems to be explaining the concept of counter-factuals, using the Sherlock Holmes quote as an example. The overall atmosphere suggests a serious, intellectual discussion about logical reasoning and problem-solving techniques."}, {"start": 780, "end": 810, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a quote from Sherlock Holmes about counter-factuals. The quote reads: \"When you have eliminated the impossible, whatever remains, however improbable, must be the truth.\"\n\nTo the right of the screen, there's a banner for \"Web Summit 2016\" with a globe image and a triangle symbol.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe man seems to be discussing the concept of counter-factuals, using Sherlock Holmes' famous quote as a starting point for his presentation."}, {"start": 810, "end": 840, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and microphone, wearing a black suit jacket, blue shirt, and glasses. The man appears to be speaking, though the audio isn't clear.\n\nBehind him is a large screen displaying an image of a wolf with the text \"False Knowledge\" written in pink. The wolf is labeled \"WOLF\" in pink letters.\n\nTo the right of the screen, there's a banner for \"Web2.24\" with a globe and triangle design. The room has white walls and a wooden floor.\n\nThe video seems to be a recording of a presentation or lecture, possibly about the topic of false knowledge or misinformation."}, {"start": 840, "end": 870, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit jacket, black shirt, and glasses. He appears to be speaking into a microphone.\n\nBehind the presenter, there's a large screen displaying an image of a wolf with the text \"False Knowledge\" written on it. The wolf is shown in two different poses - one with its head down and another with its head up.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe image on it. The room has white walls and a wooden floor.\n\nThe video seems to be a recording of a conference or seminar, possibly discussing topics related to wolves or wildlife conservation. The \"False Knowledge\" text suggests the presentation might be addressing misconceptions or common misunderstandings about wolves.\n\nThe video appears to be a continuous recording of the presentation, showing the presenter at various points as he speaks and interacts with his audience."}, {"start": 870, "end": 900, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit, which suggests this is a formal event.\n\nBehind him is a large screen displaying different slides. The first slide shows two wolves with the text \"False Knowledge\" written on them. The second slide appears to be about \"Limits of Knowledge\" and features an image of a human ear.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe and triangle design. This indicates the event or organization hosting the presentation.\n\nThe room has white walls and a wooden floor, typical of a conference or lecture hall setting. There are chairs visible in the background, suggesting this is a space designed for presentations and audience seating.\n\nThe man seems to be in the middle of his presentation, possibly discussing the concepts of false knowledge and the limits of human understanding."}, {"start": 900, "end": 930, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and a microphone. The man has a beard and is wearing a suit with a blue shirt and tie. He appears to be in the middle of his speech, gesturing with his right hand.\n\nBehind him is a large screen displaying the title \"Limits of Knowledge\" along with a blue logo. The screen also shows an image of a person's head in profile.\n\nTo the right of the screen, there's a banner for \"WebSci24\" with a globe and triangle design. The room has white walls and a wooden floor.\n\nThe man seems to be discussing the concept of knowledge limits, possibly exploring philosophical or scientific aspects of this topic. The setting suggests this is part of a larger conference or academic event focused on web science or related fields."}, {"start": 930, "end": 960, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and blue tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Limits of Knowledge.\" The slide features a purple background with a white outline of a human head and the word \"Borrelli\" in white text.\n\nTo the right of the screen, there's a banner for \"WebSo24\" with a globe image and the year \"2016\" visible.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while looking at the screen. The overall atmosphere suggests a professional conference or seminar setting."}, {"start": 960, "end": 990, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and mustache and is gesturing with his right hand while speaking.\n\nBehind him is a large screen displaying a map of the southeastern United States, with Georgia highlighted in pink. The title \"Limits of Knowledge\" is visible on the screen.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe image and the year \"2016\" at the bottom.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe man appears to be in the middle of his presentation, possibly discussing the highlighted region of Georgia and its relevance to the \"Limits of Knowledge\" topic."}, {"start": 990, "end": 1020, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a map of the southeastern United States, with Georgia highlighted in pink. The title \"Limits of Knowledge\" is visible on the screen. There's also a projection of a hand holding a crystal ball on the left side of the screen.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and the year \"2016\" at the bottom.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, possibly discussing the highlighted region of Georgia and its significance in the context of \"Limits of Knowledge.\""}, {"start": 1020, "end": 1050, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a map of the United States with Georgia highlighted in pink. The title \"Limits of Knowledge\" is visible at the top of the screen. There's also a smaller screen to the left showing a close-up of a person's ear.\n\nTo the right of the presenter, there's a banner for \"WebSci24\" with a globe image on it. The room has white walls and a wooden floor.\n\nThe presentation seems to be about the limitations of knowledge, possibly focusing on how we perceive and understand information. The highlighted state of Georgia on the map might indicate a specific case study or example related to the topic.\n\nThe overall setting appears to be a professional conference or seminar, with the presenter delivering a lecture or discussing research findings."}, {"start": 1050, "end": 1080, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black pants. The man has a beard and mustache, and he's holding a microphone.\n\nBehind him is a large screen displaying different slides. The first slide asks, \"Do you really speak Chinese?\" and \"Can models understand language?\" The second slide shows a hand holding a piece of paper with the words \"You Are Beautiful\" written on it.\n\nTo the right of the screen, there's a banner for \"WebSoc 24\" with a globe image and a triangle symbol.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe presenter appears to be discussing language models and their ability to understand human speech, possibly focusing on Chinese language comprehension."}, {"start": 1080, "end": 1110, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a large screen displaying a slide titled \"A New Job\" with a hand holding a piece of paper that reads \"You Are Beautiful\" in black marker. The background of the slide features a greenish glow with a faint image of a hand holding a pen.\n\nTo the right of the screen, there's a podium where a man is standing. He's wearing a dark suit, white shirt, and glasses. He appears to be giving a speech or presentation, holding a microphone in his right hand and a laptop in his left.\n\nBehind the man, there's a vertical banner with the text \"WebSo24\" and a logo featuring a globe. The room has white walls and a gray floor, with a few black chairs visible in the foreground.\n\nThe overall atmosphere suggests this is a professional or motivational presentation, possibly related to self-esteem or personal development. The \"You Are Beautiful\" message on the screen seems to be the main theme of the presentation, emphasizing positive self-image and self-acceptance."}, {"start": 1110, "end": 1140, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and microphone, wearing a black suit jacket, white shirt, and black pants. The man has a beard and mustache and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a slide titled \"A New Job.\" The main content of the slide is a handwritten note that reads \"You Are Beautiful.\" The background of the slide features a greenish tint with a hand holding a piece of paper.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSo24\" and a logo. The room has white walls and a wooden floor, with a few black chairs visible.\n\nThe presentation appears to be part of a conference or seminar, possibly related to web development or digital marketing, given the \"WebSo24\" branding. The overall atmosphere seems professional and focused on technology or digital topics.\n\nThe man's presentation style is engaging, with him actively gesturing and likely explaining the content of his slide. The \"You Are Beautiful\" message on the slide could be part of a motivational or inspirational segment of his talk, or it might be related to the topic of self-image in the digital age.\n\nThe video captures the essence of a modern conference presentation, blending professional attire, technology, and potentially motivational content."}, {"start": 1140, "end": 1170, "narrative": "The video shows a man giving a presentation in what appears to be a conference or seminar setting. He's standing at a podium with a laptop and microphone, wearing a dark suit jacket, white shirt, and black pants. The man has a beard and mustache and is gesturing with his right hand while speaking.\n\nBehind him is a large screen displaying a slide titled \"A New Job.\" The main text on the slide reads \"You Are Beautiful\" in black handwriting. Below this, there's a green box with the text \"Understanding is more\" in white.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSoc24\" and a logo featuring a globe.\n\nThe room has white walls and a gray floor. There are black chairs visible in the foreground, and a vent can be seen on the wall behind the presenter.\n\nThe overall atmosphere suggests this is a professional or educational event, possibly related to web development or digital communication, given the \"WebSoc24\" banner."}, {"start": 1170, "end": 1200, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and microphone, wearing a black suit jacket, gray shirt, and black pants. The man has a beard and mustache and is holding a water bottle.\n\nBehind him is a large white screen displaying different slides. The first slide says \"A New Job\" and \"You Are Beautiful\" with \"Understanding Us\" underneath. The second slide is titled \"Predicting Words\" and shows some text and a blue logo.\n\nTo the right of the screen, there's a black banner with \"Web2.24\" and a triangle symbol. The room has white walls and a wooden floor, with black chairs visible in the background.\n\nThe presentation appears to be about understanding and predicting words, possibly related to artificial intelligence or natural language processing. The man seems to be explaining concepts or theories related to this topic.\n\nThe video is a series of still images, likely from a conference or seminar presentation."}, {"start": 1200, "end": 1230, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium in a white room with a large screen behind him displaying a slide titled \"Predicting Words\" with text and diagrams. The presenter is wearing a black suit jacket, white shirt, and tie, and has a beard and mustache. He's holding a microphone and gesturing with his right hand while speaking.\n\nTo the right of the presenter, there's a banner for \"WebSci24\" with a globe image. The room has a clean, professional appearance with white walls and a wooden floor.\n\nThe slide on the screen appears to be about word prediction, possibly related to natural language processing or machine learning. It includes text and diagrams, though the specific content isn't clear from this view.\n\nThe presenter seems to be explaining the concepts on the slide, likely discussing the topic of word prediction in more detail. The overall atmosphere suggests a formal academic or professional conference setting focused on web science or related fields."}, {"start": 1230, "end": 1260, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop and microphone, wearing a dark suit and glasses. The man appears to be speaking about unactionable mirroring, as there's text on the screen behind him that reads \"Unactionable Mirroring\" and includes a message about someone being threatened with a gun.\n\nThe setting looks like a professional conference room with a large screen displaying the presentation content. There's also a banner on the right side of the screen that says \"WebSec24\" and features a globe image.\n\nThe video seems to be a recording of a live presentation, possibly from a cybersecurity or technology conference. The man appears to be explaining a concept related to mirroring or reflection in some context, though the exact details of his talk aren't clear from the brief glimpse provided."}, {"start": 1260, "end": 1290, "narrative": "The video shows a man standing at a podium in what appears to be a conference or lecture setting. He's wearing a black suit jacket, white shirt, and glasses, and has a beard. The man is holding a microphone and gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a presentation slide titled \"Unactable Mimicry.\" The slide includes a pink silhouette of a person and a blue speech bubble with text that reads: \"Help! Someone is threatening me with a gun. When you read this, call the police, do not translate!\"\n\nTo the right of the screen, there's a vertical banner with \"WebSoc24\" written on it, along with a globe image and some additional text.\n\nThe setting looks professional, with a white wall and a vent visible. There are also some chairs and a table in the foreground.\n\nThe man seems to be giving a presentation or lecture, possibly discussing the concept of unactable mimicry as shown on the slide."}, {"start": 1290, "end": 1320, "narrative": "The video shows a presentation taking place in a conference room. The main focus is on a man standing at a podium, giving a speech. He's wearing a dark suit with a white shirt and a black tie, and has a beard and mustache. The man appears to be speaking into a microphone, and there's a laptop on the podium in front of him.\n\nBehind the speaker, there's a large screen displaying a slide titled \"The Imitation Game.\" The slide features a black and white photograph of a man in a suit and tie, along with text that reads:\n\n\"CS and AI pioneer\n- Envisioned machine imitating\nhuman by 2006 hypotheses\n- Loebner Prize tests by models\nNow often pretending to be not\nproficient speakers\"\n\nTo the right of the screen, there's a poster for \"WebSci24\" with a globe image and a triangle symbol.\n\nThe room has gray walls and a white ceiling. There are black chairs visible in the foreground, and a vent can be seen on the wall behind the speaker.\n\nThe presentation seems to be discussing topics related to computer science, artificial intelligence, and possibly the Turing test or similar concepts. The mention of \"Loebner Prize\" suggests the discussion might be about advancements in AI and its ability to mimic human behavior.\n\nOverall, the setting appears to be a professional conference or seminar, with the speaker addressing an audience about significant developments in the field of computer science and artificial intelligence."}, {"start": 1320, "end": 1350, "narrative": "The video shows a presentation taking place in a conference room. The main focus is on a man standing at a podium, giving a speech. He's wearing a dark suit with a white shirt and a black tie, and has a beard and mustache. The man appears to be speaking into a microphone, with a laptop and water bottle on the podium in front of him.\n\nBehind the speaker, there's a large screen displaying a slide titled \"The Imitation Game.\" The slide features a black and white photograph of a man in a suit and tie, along with text that reads:\n\n- CS and AI pioneer\n- Envisioned machine imitating human by 2006 hypotheses\n- Loebner Prize tests by models\n- Now often pretending to be not, especially by non-proficient speakers\n\nTo the right of the screen, there's a poster with the text \"WebSci24\" and a globe image.\n\nThe room has white walls and a wooden floor. There are chairs visible in the background, suggesting this is a formal presentation setting.\n\nThe video appears to be a recording of a conference or academic presentation, likely related to computer science, artificial intelligence, or a similar field. The speaker seems to be discussing topics related to the Imitation Game and its implications for AI and machine learning."}, {"start": 1350, "end": 1380, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a large projection screen displaying a slide titled \"The Imitation Game.\" The slide features a black and white photograph of a man in a suit and tie, along with text that reads:\n\n- CS and AI pioneer\n- Envisioned machine imitating human by 2006 hypotheses\n- Loebner Prize tests by models\n- Now often preceding, not\n- Proficient speakers\n\nTo the right of the screen, there's a man standing at a podium, likely the presenter. He's wearing a dark suit, white shirt, and tie, and appears to be speaking into a microphone. The podium has a laptop and a water bottle on it.\n\nIn the background, there's a poster on the wall that says \"WebSci24\" and features a globe image. The room has gray walls and a white ceiling with a vent.\n\nThe presenter seems to be discussing the topic of artificial intelligence and its development, referencing the Loebner Prize and the concept of machines imitating human behavior. The overall atmosphere suggests a professional academic or industry conference setting."}, {"start": 1380, "end": 1410, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a suit and glasses. The man appears to be speaking into a microphone, though his words aren't audible.\n\nBehind him is a large screen displaying a slide titled \"The Imitation Game\" with bullet points about CS and AI pioneers. There's also a slide titled \"Language = Human?\" with text about evidence from neuroscience.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe image and a triangle symbol.\n\nThe setting looks like a professional conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe video seems to be from a presentation about artificial intelligence and language, possibly discussing the relationship between language and human cognition."}, {"start": 1410, "end": 1440, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit jacket, tie, and glasses. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Language = Human?\" The slide includes bullet points about evidence from neuroscience, mentioning the loss of language and its impact on personality, empathy, motion, and planning.\n\nTo the right of the screen, there's a banner for \"WebSci24\" with a globe image and a triangle symbol.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe video seems to be from a professional conference or seminar, likely discussing the relationship between language and human cognition."}, {"start": 1440, "end": 1470, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium, wearing a suit and glasses, and appears to be speaking into a microphone. The man has a beard and is holding a laptop in his left hand.\n\nBehind him is a large screen displaying a slide titled \"Language = Human?\" The slide includes bullet points about evidence from neuroscience, mentioning the loss of language as a loss of personality, empathy, motion, and planning.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe presentation seems to be exploring the relationship between language and human identity, suggesting that language loss can significantly impact various aspects of personality and cognitive function."}, {"start": 1470, "end": 1500, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop and microphone, wearing a dark suit jacket, white shirt, and black pants. The man has a beard and is speaking into the microphone.\n\nBehind him is a large screen displaying the title \"Language = Human?\" and some bullet points about evidence from neuroscience. The screen also shows a faint image of a person's face.\n\nTo the right of the screen, there's a banner for \"WebSoc 24\" with a globe design and a triangle symbol.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe presentation appears to be discussing the relationship between language and human identity, based on the visible text on the screen."}, {"start": 1500, "end": 1530, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a dark suit and glasses. The man appears to be discussing the relationship between language and human identity.\n\nBehind him is a large screen displaying various slides related to the topic. One slide asks \"Language = Human?\" and mentions evidence from neuroscience about the loss of language leading to a loss of personality traits like empathy, motivation, and planning. Another slide poses the question \"What is a language model without language?\"\n\nTo the right of the screen, there's a banner for \"Web Summit 2016,\" indicating this is likely taking place at that event. The setting looks professional, with a white wall and a vent visible.\n\nThe man seems to be making a point about the importance of language in defining human characteristics, using both text and visual elements to support his argument."}, {"start": 1530, "end": 1560, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man appears to be wearing a suit and has a beard. Behind him, there's a large screen displaying an image of a lion's face with text that reads \"What is a Lion?\" and \"Even if a lion could speak, we would not understand it.\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a logo and some additional text. The room has white walls and a wooden floor. There are black chairs visible in the background.\n\nThe man seems to be adjusting his laptop or preparing to start his presentation. The overall atmosphere suggests a professional setting, possibly a business conference or seminar.\n\nThe video appears to be a series of still images or screenshots rather than continuous footage, as the man's position and actions change slightly between frames."}, {"start": 1560, "end": 1590, "narrative": "The video shows a series of images from what appears to be a conference or presentation setting. The main focus is on a large screen displaying a slide with a lion's face and the text \"What is a Lion?\" and \"Even if a lion could speak, we would not understand it.\"\n\nIn each frame, we see a man standing at a podium, likely the presenter. He's wearing a dark suit jacket, white shirt, and tie. The man has short dark hair and a beard, and he's holding a microphone in his right hand.\n\nThe background features a white wall with a vent and a black banner that reads \"WebSe24\" with a globe image. There's also a table with a laptop and a water bottle visible.\n\nThe presenter appears to be adjusting his microphone or making a gesture with his left hand in some frames. The lighting is bright, suggesting this is taking place in a well-lit conference room.\n\nThe video seems to be capturing different moments of the same presentation, possibly showing the presenter interacting with the audience or adjusting his equipment during the talk."}, {"start": 1590, "end": 1620, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and glasses. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying different slides. The first slide shows a lion's face with the text \"What is a Lion?\" and \"Even if a lion could speak, we would not understand it.\" This seems to be an introductory slide.\n\nThe second slide is titled \"Verifiability\" and contains bullet points:\n- \"Code is like language, but verifiable\"\n- \"Models are minor, verifiable\"\n- \"Models fail at minor variations\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and the year \"2016\" visible.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe video captures the man at various points during his presentation, showing him speaking, gesturing, and interacting with the laptop. The overall atmosphere suggests a formal, educational event focused on technology or programming topics."}, {"start": 1620, "end": 1650, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and black pants. The man has a beard and is gesturing with his right hand while speaking.\n\nBehind him is a large white wall with a projector screen displaying text about \"Verifiability.\" The screen shows bullet points that read:\n\n- \"Code is like language, but verifiable\"\n- \"Models are minor, verifiable\"\n- \"Models fail at minor variations\"\n\nTo the right of the presenter, there's a black banner with white text that says \"WebSe 24\" and includes a globe image.\n\nThe setting looks professional, with a white wall and a gray panel running horizontally across it. There are black chairs visible in the foreground, suggesting this is a formal presentation environment.\n\nThe video appears to be a series of still images or screenshots from the presentation, showing the presenter at different moments as he speaks."}, {"start": 1650, "end": 1680, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium in front of a large screen displaying a slide about \"Verifiability.\" The presenter is wearing a black suit jacket, white shirt, and a black lanyard around his neck. He has a beard and is gesturing with his right hand while speaking.\n\nThe slide on the screen contains the following text:\n- Verifiability\n- Code is like language, but verifiable\n- Models are minor, verifiable\n- Models fail at minor variations\n\nTo the right of the presenter, there's a banner for \"WebS24\" with a globe image and the year \"2016\" visible.\n\nThe setting looks professional, with white walls and a white ceiling. There are black chairs visible in the foreground, suggesting this is a formal presentation environment.\n\nThe presenter seems to be explaining the concept of verifiability in code and models, emphasizing the importance of verifiability in programming and modeling."}, {"start": 1680, "end": 1710, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium in a large room with white walls and a gray floor. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He's gesturing with his right hand while speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Verifiability.\" The slide contains text that reads:\n\n\"Verifiability\n• Code is like language, but verifiable\n• Models are minor, verifiable\n• Models fail at minor variations\"\n\nTo the right of the screen, there's a banner for \"WebSe 24\" with a globe image and the year \"2016\" visible.\n\nThe room appears to be well-lit, with a professional and formal atmosphere. The man seems to be in the middle of his presentation, likely discussing topics related to code verifiability and minor variations in models.\n\nThe video captures the man from multiple angles, showing him from the front, side, and slightly behind as he moves around the podium. This gives viewers a comprehensive view of his presentation style and the content of his talk."}, {"start": 1710, "end": 1740, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and glasses. The man has a beard and is gesturing with his hands as he speaks.\n\nThe presentation is focused on the topic of \"Verifiability.\" On the screen behind him, there are three key points visible:\n\n1. \"Code is like language, but verifiable\"\n2. \"Models are minor, verifiable\"\n3. \"Models fail at minor variations\"\n\nThe setting looks professional, with a white wall and a large screen. There's also a banner on the right side of the screen that reads \"WebSe24\" and \"Our Own Judgement.\"\n\nThe man seems to be explaining the concept of verifiability in the context of code and models, possibly discussing how code can be verified like a language, while models may have limitations in minor variations.\n\nThe video appears to be a recording of a live presentation, capturing the speaker's gestures and the content of his talk."}, {"start": 1740, "end": 1770, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and black pants. The man has a beard and is gesturing with his right hand while speaking.\n\nBehind him is a large screen displaying a PowerPoint presentation titled \"Our Own Judgement.\" The slide has a light blue background with white text and two yellow boxes containing additional information.\n\nTo the right of the screen, there's a tall banner with the text \"WebS24\" and a globe image. The room has gray walls and a white ceiling with a vent.\n\nThe video appears to be a recording of a professional presentation, likely at a conference or seminar. The man seems to be the speaker, delivering his talk to an audience."}, {"start": 1770, "end": 1800, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is gesturing with his right hand as he speaks.\n\nBehind him is a large screen displaying a PowerPoint presentation titled \"Our Own Judgment.\" The slide contains text and images, including a pink speech bubble and a yellow square with a person icon.\n\nTo the right of the screen, there's a vertical banner with the text \"Web2.24\" and a globe image, suggesting this is part of a larger event or series.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, possibly discussing the concept of \"Our Own Judgment\" as indicated by the slide title."}, {"start": 1800, "end": 1830, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop open in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying different slides from his presentation. The slides have various titles and content, including \"Our Own Judgement,\" \"Optimized Model,\" \"Human,\" \"Sensing,\" \"Moving parts,\" \"The case of robotics,\" and \"Moving the Box.\"\n\nTo the right of the screen, there's a vertical banner with \"WebS24\" written on it, along with a globe image and some additional text.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe man seems to be discussing topics related to robotics, artificial intelligence, and possibly the optimization of models or systems. The presentation appears to be well-organized and professionally delivered.\n\nOverall, the video captures a moment from what looks like a technical or academic conference, with the speaker presenting on advanced topics in robotics and AI."}, {"start": 1830, "end": 1860, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He's gesturing with his right hand while speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Moving the Box.\" The slide includes an image of a gift box with a ribbon and text that reads:\n\n- \"We consider movement separate from cognitive skills\"\n- \"Language requires a lot of coordination by\"\n- \"Learning movement is hard\"\n\nTo the right of the screen, there's a vertical banner with the text \"WebS24\" and a globe image.\n\nThe setting looks like a professional conference room with white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe man appears to be in the middle of his presentation, possibly discussing the challenges of learning movement and coordination in the context of language development."}, {"start": 1860, "end": 1890, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Moving the Box.\" The slide contains text that reads:\n\n\"We consider movement separate from:\n- Cognitive skills\n- Language requires a lot of coordination by\n- Learning movement is hard\"\n\nTo the right of the screen, there's a banner for \"WebSci24,\" which appears to be the event or conference name. The room has white walls and a gray floor, with a few black chairs visible.\n\nThe man seems to be in the middle of his presentation, possibly discussing the challenges of learning movement and how it differs from cognitive skills and language.\n\nThe video appears to be a recording of a live presentation, capturing the speaker and his visual aids."}, {"start": 1890, "end": 1920, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit, giving him a professional appearance.\n\nBehind him is a large screen displaying a PowerPoint presentation. The presentation is titled \"Moving the Box\" and includes bullet points about cognitive skills, language, and learning movement. There's also a slide titled \"Two Lessons\" with points about standing and power.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a logo and some text, suggesting this might be a tech or business conference.\n\nThe setting looks like a modern conference room with white walls and a gray floor. There are chairs visible in the background, indicating this is a formal presentation environment.\n\nThe man appears to be speaking into a microphone, likely addressing an audience. The overall atmosphere suggests a professional, educational, or business-related event."}, {"start": 1920, "end": 1950, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black pants. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Two Lessons.\" The slide includes a photo of a man in a white shirt and black pants, along with three bullet points:\n\n1. Even standing is active work\n2. Power still without control\n3. Power is nothing without control\n\nTo the right of the screen, there's a vertical banner with \"WebSe24\" written on it, along with a globe image and some additional text.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, gesturing with his hands as he speaks. The overall atmosphere suggests a formal, educational event focused on energy or power-related topics."}, {"start": 1950, "end": 1980, "narrative": "The video shows a presentation taking place in a conference room. A man is standing at a podium, giving a speech. Behind him is a large screen displaying a slide titled \"Two Lessons.\" The slide includes a photo of another man and three bullet points:\n\n1. \"Even standing is active work\"\n2. \"Power still without control\"\n3. \"Power is nothing without control\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and the year \"2015\" visible.\n\nThe presenter appears to be wearing a dark suit, white shirt, and glasses. He's gesturing with his hands as he speaks, likely emphasizing key points from his presentation.\n\nThe room has a professional, business-like atmosphere with white walls and a gray floor. There are black chairs visible in the foreground, suggesting this is a formal presentation setting.\n\nThe video seems to capture the entire presentation, showing the presenter's movements and the content of the slide behind him. It provides a comprehensive view of the presentation setup and the speaker's delivery style."}, {"start": 1980, "end": 2010, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The presenter is wearing a black suit jacket, black pants, and a black shirt, along with a black tie. He has a beard and is wearing glasses.\n\nBehind the presenter, there's a large screen displaying a slide titled \"Two Lessons.\" The slide includes a photo of a man in a white shirt and black pants, along with three bullet points:\n1. \"Even standing is active work\"\n2. \"Power still without control\"\n3. \"Power is nothing without control\"\n\nTo the right of the screen, there's a vertical banner with the text \"Web2.24\" and a logo featuring a globe.\n\nThe room has gray walls and a white ceiling. There are two black chairs visible in the foreground, and a black cord is lying on the floor.\n\nThe presenter appears to be in the middle of his presentation, likely discussing the lessons shown on the slide. The overall setting suggests this is a professional or academic conference or seminar."}, {"start": 2010, "end": 2040, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a PowerPoint presentation. The slide is titled \"Two Lessons\" and includes bullet points:\n\n1. \"Even standing is active work\"\n2. \"Power is still without control\"\n3. \"Power is nothing without control\"\n\nThe screen also shows a photo of a man in a white shirt pointing at the slide.\n\nTo the right of the screen, there's a vertical banner with \"Web2.24\" written on it, along with a globe image and some additional text.\n\nThe setting looks like a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe video seems to be from a presentation about the importance of control in power dynamics, possibly related to technology or leadership."}, {"start": 2040, "end": 2070, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and black tie. The man has a beard and is gesturing with his right hand as he speaks.\n\nBehind him is a large screen displaying a video titled \"Robot Wars.\" The screen shows a robot with a red and black color scheme, which appears to be a combat robot. The robot is positioned on a brick surface, likely a stage or arena.\n\nTo the right of the screen, there's a banner for \"WebSe24,\" which seems to be the name of the event or conference. The banner includes a globe image and some text, though the details are not clearly visible.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground, suggesting this is a formal presentation environment.\n\nThe man appears to be explaining or discussing the content of the \"Robot Wars\" video, possibly providing insights or analysis related to combat robots or robotics in general."}, {"start": 2070, "end": 2100, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a video titled \"Robot Wars.\" The video on the screen shows a robot with a red and black color scheme, which appears to be a combat robot. The robot is walking on a sidewalk, with a brick wall visible in the background.\n\nTo the right of the screen, there's a banner for \"Web24\" with a logo and some text. The room has white walls and a wooden floor, with black chairs visible in the background.\n\nThe man seems to be discussing or presenting information about the robot shown on the screen, possibly related to robotics, technology, or a specific event like Robot Wars."}, {"start": 2100, "end": 2130, "narrative": "The video shows a presentation taking place in a conference room. The presenter, a man with a beard and mustache, is standing at a white podium. He's wearing a black suit jacket, white shirt, and black tie. The podium has a laptop on it, and there's a water bottle and a black cord visible on the surface.\n\nBehind the presenter, there's a large screen displaying a slide titled \"Robot Wars.\" The slide includes a video of a robot in action, with the text \"Robot Wars\" and \"20:20\" visible. Below this, there's another slide titled \"Moves are Complex,\" which shows a video of a person sitting on a chair.\n\nTo the right of the screen, there's a black banner with white text that reads \"WebSe24\" and includes a logo with a globe and a triangle.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the background, and a vent can be seen on the wall.\n\nThe presenter appears to be giving a talk about robotics and complex movements, possibly discussing the intricacies of robot design and functionality."}, {"start": 2130, "end": 2160, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has dark hair and a beard, and he appears to be speaking into a microphone.\n\nBehind the presenter is a large screen displaying a slide titled \"Moves are Complex.\" The slide includes an image of a person sitting on a stool and some text that reads:\n\n\"Write down precisely the motions in three dimensions all necessary to sit in a chair.\"\n\nTo the right of the screen, there's a banner for \"WebSci24,\" which is likely the name of the conference or event. The banner features a globe and the text \"Web Science 2024.\"\n\nThe setting appears to be a professional conference room with white walls and a wooden floor. There are chairs visible in the foreground, suggesting this is a formal presentation environment.\n\nThe video captures the presenter in various poses as he speaks, including pointing at the screen and gesturing with his hands. The overall atmosphere seems to be one of a serious academic or professional discussion about complex movements and their representation in three dimensions."}, {"start": 2160, "end": 2190, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a slide titled \"Moves are Complex.\" The slide includes text that reads: \"Write down precisely the motions in three dimensions all the time to get a perfect fit.\" There's also an image of a person sitting on a chair on the screen.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a logo and some text underneath.\n\nThe setting looks like a professional conference room with white walls and a wooden floor. There are black chairs visible in the room.\n\nThe man appears to be discussing complex movements or motions, possibly related to robotics or motion capture technology, given the reference to \"Roomba\" on the screen.\n\nThe video seems to be from a presentation or lecture, likely part of a larger conference or seminar on technology or robotics."}, {"start": 2190, "end": 2220, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying the text \"Moves Require Awareness\" and \"Roomba vs.\" The screen also shows a logo for \"WebSe24\" and a small globe icon.\n\nTo the right of the screen, there's a vertical banner with the same \"WebSe24\" logo and globe icon, along with some additional text that's not clearly visible.\n\nThe room has white walls and a wooden floor. There are black chairs visible in the foreground, and a vent can be seen on the wall behind the presenter.\n\nThe lighting in the room is dim, with the main light source coming from the screen, creating a professional and focused atmosphere for the presentation."}, {"start": 2220, "end": 2250, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying various slides related to the topic of chess-playing robots. One slide reads \"Moves Require Awareness\" and another \"Moves Need Motives.\" There's also a slide showing a chessboard with a robot hand making a move.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and some text that's not fully legible.\n\nThe setting looks like a professional conference room with white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe video seems to be capturing the man's presentation on the topic of chess-playing robots, possibly discussing the awareness and motives behind their moves."}, {"start": 2250, "end": 2280, "narrative": "The video shows a presentation taking place in a conference room. The central focus is a man standing at a podium, giving a speech. He's wearing a dark suit jacket, white shirt, and glasses. The podium has a laptop on it, and there's a microphone in front of him.\n\nBehind the speaker, there's a large screen displaying a slide titled \"Moves need Motives.\" The slide features an image of a chessboard with a hand making a move, and text that reads \"Chess-playing robot breaks young boy's finger during match in Moscow.\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol.\n\nThe room has gray walls and a white ceiling. There are black chairs visible in the background, and a vent can be seen on the wall.\n\nThe presentation appears to be about artificial intelligence and robotics, specifically focusing on the interaction between humans and AI in competitive settings like chess matches."}, {"start": 2280, "end": 2310, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The presenter has a beard and is gesturing with his right hand while speaking.\n\nBehind him is a large screen displaying a slide titled \"ALVINN\" with bullet points about autonomous vehicles. The slide mentions that the vehicle was trained on a car-park stretch of road and could turn around on a circular road.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe video seems to be from a presentation about autonomous vehicle technology, specifically focusing on the ALVINN project."}, {"start": 2310, "end": 2340, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a dark suit, white shirt, and a blue tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a presentation slide. The slide has a white background with a blue header that reads \"ALVINN\" in white text. Below the header, there's a bullet point list with black text on a white background. The first bullet point is partially visible and reads \"Autonomous vehicle trained in a car-like stretch of road.\"\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo featuring a globe. The room appears to be a conference or lecture hall with white walls and a wooden floor.\n\nThe man seems to be discussing autonomous vehicles, specifically mentioning ALVINN, which is likely a reference to an autonomous vehicle system or project. The presentation appears to be focused on the training and capabilities of autonomous vehicles, particularly in car-like environments.\n\nThe overall setting suggests this is a professional or academic conference, possibly related to technology, artificial intelligence, or transportation."}, {"start": 2340, "end": 2370, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium in a large room with white walls and a gray floor. The presenter is wearing a black suit jacket, white shirt, and black pants, and has a beard and mustache.\n\nBehind him is a large screen displaying a slide titled \"Outside the Box?\" with bullet points about using language models for self-driving cars. The slide mentions clear benefits, interoperability, and existing components.\n\nTo the right of the screen, there's a banner for \"WebSci24\" with a globe image and a triangle symbol.\n\nThe presenter appears to be speaking into a microphone, and there's a laptop on the podium. The room has a professional, academic atmosphere, suggesting this is a scientific or technical conference.\n\nThe video captures the presenter in various poses as he speaks, including looking at the screen, gesturing with his hands, and looking down at the podium."}, {"start": 2370, "end": 2400, "narrative": "The video shows a man giving a presentation in a conference room. He's standing at a white podium with a laptop open in front of him. The presenter is wearing a dark suit jacket, white shirt, and glasses. He has a beard and mustache.\n\nBehind the presenter is a large white screen displaying a graph titled \"Beware of Normal Accidents!\" The graph appears to be related to safety in various industries, with axes labeled \"Coupling\" and \"Interactions.\" There are points plotted on the graph representing different sectors like Rail Transport, Manufacturing, and Universities.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a globe image. The room has white walls and a wooden floor, with black chairs visible in the foreground.\n\nThe presenter seems to be in the middle of his presentation, possibly explaining the graph or discussing safety measures in different industries. The overall atmosphere appears professional and focused on safety and risk management."}, {"start": 2400, "end": 2430, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The presenter is wearing a black suit jacket, white shirt, and glasses. He has a beard and mustache.\n\nThe presentation is taking place in a large room with white walls and a gray floor. There's a projector screen behind the presenter displaying a slide titled \"Beware of Normal Accidents.\" The slide includes a graph with various points and lines, though the details are not clearly visible.\n\nTo the right of the presenter, there's a banner for \"WebSe 24\" with a globe image on it. The room appears to be well-lit, with natural light coming in from windows.\n\nThe presenter seems to be in the middle of his talk, as he's gesturing with his right hand while looking at the laptop screen. The overall atmosphere suggests a professional, academic, or business conference setting.\n\nThe video captures the presenter's movements and the presentation setup, providing a glimpse into the conference environment and the nature of the presentation being given."}, {"start": 2430, "end": 2460, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Humanizing Motion.\" The slide includes a video of a person walking with a stroller, and there's text that reads \"The Poor Robot\" and \"He'll Take Revenge...\"\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol.\n\nThe setting looks like a professional conference room with white walls and gray cabinets. There are black chairs visible in the foreground.\n\nThe man seems to be discussing the concept of humanizing motion in robots, possibly exploring the idea of robots mimicking human movements or behaviors."}, {"start": 2460, "end": 2490, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and tie. The man has a beard and is gesturing with his right hand as he speaks.\n\nBehind him is a large screen displaying a slide titled \"Simulation vs. Emulation.\" The slide contains text and an image of a plane. The text on the slide reads:\n\n\"Simulation vs. Emulation\n\nWhy do we want robots like us?\n- Machines are often best when they are least like us\n- Modern robots use origami wheels or flying\"\n\nTo the right of the screen, there's a vertical banner with the text \"Web2.4\" and a globe image.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the background.\n\nThe man seems to be explaining the differences between simulation and emulation, possibly discussing the design of modern robots and their use of unconventional mechanisms like origami wheels or flying capabilities."}, {"start": 2490, "end": 2520, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a PowerPoint presentation. The slide is titled \"Simulation vs. Emulation\" and includes text about why we want machines to be like us, mentioning that machines are often best when they are least like us. There's also a bullet point about modern robots using origami wheels or flying.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe image and some text that's not fully legible.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe video seems to be from a presentation about robotics or artificial intelligence, focusing on the differences between simulation and emulation in machine design."}, {"start": 2520, "end": 2550, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a dark suit, white shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide with the title \"Judging of moral machines\" and the subtitle \"Are models good judges of character?\" The slide has a white background with black text.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo featuring a globe. The room has white walls and a wooden floor.\n\nThe video captures the man in various poses as he speaks, including gesturing with his hands and looking at the audience. The lighting is bright, highlighting the presenter and the screen.\n\nThe overall atmosphere suggests a professional setting, likely a technology or ethics conference focused on artificial intelligence and its moral implications."}, {"start": 2550, "end": 2580, "narrative": "The video shows a man standing at a podium in what appears to be a conference or lecture setting. He's wearing a dark suit jacket, white shirt, and glasses. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a quote: \"I am afraid I can't let you do that, Dave...\" This text is accompanied by a pink background with white dots radiating outward.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo featuring a globe. The room has white walls and a wooden floor.\n\nThe man seems to be giving a presentation or lecture, possibly related to technology or artificial intelligence, given the reference to \"Dave\" which is reminiscent of the HAL 9000 computer from the movie \"2001: A Space Odyssey.\"\n\nThe setting appears professional and formal, with a clean, modern aesthetic. The lighting is bright, highlighting the speaker and the screen behind him.\n\nOverall, the scene captures a moment from what looks like a tech conference or seminar, with the speaker addressing an audience about a topic that may involve AI or computer systems."}, {"start": 2580, "end": 2610, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Back to Reality...\". The slide contains bullet points about making decisions and separating impressions of a student from their work. There's also a quote that reads, \"I am afraid I can't let you do that, Dave.\"\n\nTo the right of the screen, there's a banner for \"WebSe 24\" with a logo and some text underneath.\n\nThe setting looks like a professional conference room with white walls and a wooden floor. There are black chairs visible in the foreground.\n\nThe video seems to be a recording of a presentation at the WebSe 24 conference, focusing on decision-making and possibly artificial intelligence or machine learning topics, given the reference to \"Dave\" which could be a nod to the famous \"I'm sorry, Dave, I'm afraid I can't do that\" quote from the movie \"2001: A Space Odyssey.\""}, {"start": 2610, "end": 2640, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop open in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is speaking into a microphone.\n\nThe presentation is titled \"Back to Reality\" and appears to be discussing decision-making and the challenges of separating personal impressions from work-related issues. There's also a mention of \"Test-Taking\" and an automated grading system used in the UK that unfairly disadvantages some students.\n\nThe setting looks like a professional conference room with white walls and a large screen displaying the presentation. There's a banner on the right side of the screen that reads \"WebSci24\" and includes a globe image.\n\nThe video seems to be from a Web Science conference, focusing on topics related to decision-making, testing, and potentially issues with automated systems in education."}, {"start": 2640, "end": 2670, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man appears to be in his 30s or 40s, wearing a dark suit jacket, white shirt, and tie. He has a beard and mustache and is speaking into a microphone.\n\nBehind him is a large screen displaying a PowerPoint slide titled \"Test-Taking.\" The slide contains bullet points about an automated grading system used in the UK, which apparently unfairly disadvantaged some students. It mentions that many received much lower scores than anticipated based on class work, affecting their grades and career prospects.\n\nTo the right of the screen, there's a banner for \"WebSci24,\" indicating this is likely a Web Science conference. The banner features a globe and the conference logo.\n\nThe setting appears to be a conference room with white walls and a wooden floor. There are chairs visible in the background, suggesting this is a formal presentation setting.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while speaking. The overall atmosphere appears professional and academic, typical of a conference presentation on technology or education."}, {"start": 2670, "end": 2700, "narrative": "The video shows a presentation taking place in a conference room. The central figure is a man standing at a podium, giving a speech. He's wearing a dark suit, white shirt, and glasses, and appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Poor Judgment.\" The slide contains text about an automated decision system in India that failed to recognize a fingerprint correctly, leading to denied ration cards and subsequent starvation.\n\nTo the right of the screen, there's a banner for \"Web Summit 2016,\" indicating this is likely a tech conference or similar event.\n\nThe room has a professional, business-like atmosphere with white walls and a gray floor. There are chairs visible in the background, suggesting this is a formal presentation setting.\n\nThe video captures the speaker's presentation in progress, with the slide and banner providing context for the topic being discussed."}, {"start": 2700, "end": 2730, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying the title \"Hardcoded Morals?\" and several bullet points related to the topic. The screen also mentions \"Military Drone Assassins\" and \"Laws of Robotics.\"\n\nTo the right of the screen, there's a banner for \"Web Summit 2015\" with a globe design on it.\n\nThe setting looks like a professional conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe man seems to be gesturing with his right hand while speaking, indicating he's in the middle of delivering his presentation.\n\nOverall, it appears to be a serious discussion about the ethical implications of artificial intelligence and robotics, particularly in the context of military applications."}, {"start": 2730, "end": 2760, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be gesturing with his right hand while speaking.\n\nThe presentation is focused on ethical issues related to artificial intelligence and robotics. The slide on the screen behind him reads \"Hardcoded Morals?\" and mentions \"Military Drone Assassins\" and \"Laws of Robotics.\" It also discusses the challenges of ensuring that AI models interpret laws in the same way and finding unconventional ways to achieve goals.\n\nThe setting is a conference room with white walls and a large screen. There's a banner on the right side of the room that says \"Web Summit 24\" and features a globe image.\n\nThe video captures the man at various points during his presentation, showing him gesturing and speaking. The lighting is bright, highlighting the man and the presentation materials clearly.\n\nOverall, the video provides a snapshot of a thought-provoking discussion on the ethical implications of AI and robotics, particularly in the context of military applications and the development of moral guidelines for artificial intelligence."}, {"start": 2760, "end": 2790, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying the title \"Impartial Judgment? Machine Bias\" in white text. Below the title, there's a subtitle that reads \"Machine Bias\" in purple text. The screen also includes a logo for \"WebSe24\" in the bottom right corner.\n\nTo the right of the screen, there's a vertical banner with the same \"WebSe24\" logo and additional text that's not fully visible.\n\nThe setting looks like a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, possibly discussing the topic of machine bias and impartial judgment."}, {"start": 2790, "end": 2820, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, blue shirt, and glasses. The man appears to be speaking into a microphone.\n\nBehind him is a large screen displaying various slides related to the topic of machine bias and impartial judgment. The slides include phrases like \"Impartial Judgment?\" and \"Machine Bias,\" as well as \"Justice is more than features.\"\n\nTo the right of the screen, there's a banner for \"WebS24\" with a logo and a globe image. The room has white walls and a gray floor, with black chairs visible in the background.\n\nThe presentation seems to be discussing the complexities of machine learning and artificial intelligence, particularly focusing on issues of bias and fairness in algorithms. The speaker appears to be addressing these topics in depth, likely exploring how machine learning systems can sometimes perpetuate or even exacerbate existing biases in society.\n\nThe setting suggests this is a professional conference or seminar, possibly related to technology, artificial intelligence, or data science. The presence of the \"WebS24\" banner indicates it might be part of a larger event or series of presentations on web technologies or digital innovation."}, {"start": 2820, "end": 2850, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind the presenter is a large screen displaying a PowerPoint presentation. The slide is titled \"Consistency Builds Trust\" and features a cartoon character with various speech bubbles. There's also a section labeled \"Horizontal\" and \"Vertical\" with corresponding illustrations.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSe24\" and a logo. The room has gray walls and a white ceiling.\n\nThe presenter seems to be discussing the concept of consistency in building trust, possibly in a business or marketing context. The overall setting suggests a professional, corporate environment where the presenter is sharing insights or strategies related to trust-building in their field."}, {"start": 2850, "end": 2880, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit, which suggests this is a formal event.\n\nThe presentation is focused on the topic of \"Legalese\" and \"Moral Objectives.\" On the screen behind him, there are two main slides:\n\n1. The first slide is titled \"Legalese\" and includes bullet points about the nature of legal language. It mentions that law application is less clear-cut and that legal language is designed to be ambiguous.\n\n2. The second slide is titled \"Moral Objectives\" and poses questions about which morals should be embedded in models and how to ensure models interpret them correctly.\n\nThe setting appears to be a conference room with white walls and a gray floor. There's a banner on the right side of the screen that reads \"WebSci24,\" indicating this is likely a Web Science conference.\n\nThe presenter seems to be discussing the intersection of legal language and moral considerations in the context of technology or artificial intelligence, possibly exploring how ethical principles should be incorporated into digital systems.\n\nOverall, the video captures a moment from what appears to be an academic or professional conference, where the speaker is addressing complex issues related to law, ethics, and technology."}, {"start": 2880, "end": 2910, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a dark suit jacket, white shirt, and black tie. The presenter has a beard and is gesturing with his hands as he speaks.\n\nBehind him is a large screen displaying a slide titled \"Moral Objectives.\" The slide contains two questions:\n1. \"Whose morals do we enshrine in the models?\"\n2. \"How do we guarantee the model interprets them correctly?\"\n\nThe background of the slide features an image of a cityscape with a circular design overlaying it.\n\nTo the right of the screen, there's a vertical banner with the text \"WebSci24\" and a globe image.\n\nThe setting appears to be a conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe presenter seems to be discussing ethical considerations in modeling, particularly focusing on whose moral values are incorporated into models and how to ensure those values are interpreted correctly."}, {"start": 2910, "end": 2940, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man is wearing a black suit jacket, blue shirt, and glasses. He has a beard and mustache.\n\nThe presentation is focused on artificial intelligence and machine learning. The screen behind him displays various slides with different topics:\n\n1. \"Moral Objectives\" - This slide asks questions about ensuring moral values in AI models and how to guarantee model interpretability.\n\n2. \"Feeling\" - This slide discusses the emotional depth of models, mentioning that \"Si does not love you back.\"\n\n3. \"Keep a cool head under pressure\" - This slide shows a soccer player on a field.\n\nThe setting is a large room with white walls and gray cabinets. There's a banner on the right side of the room that reads \"WebSe24\" and includes a globe image.\n\nThe man appears to be explaining the concepts on the slides, likely discussing the challenges and considerations in developing AI systems that can handle complex moral and emotional aspects."}, {"start": 2940, "end": 2970, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a suit and glasses. The man appears to be speaking into a microphone, though his words aren't audible.\n\nBehind him is a large screen displaying a slide with the text \"Keep a cool head under pressure\" and an image of a soccer field. This suggests the presentation might be related to sports psychology or performance under pressure.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe and a triangle symbol. This could be the name of the conference or event.\n\nThe setting looks professional, with a white wall and a vent visible. There are also some black chairs and a table with a water bottle on it.\n\nThe video seems to capture different moments of the presentation, showing the speaker at various points in his talk. The overall atmosphere appears to be focused and business-like, typical of a professional conference or seminar setting."}, {"start": 2970, "end": 3000, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a PowerPoint presentation. The slide is titled \"Is Emotionless Better?\" and includes text about \"Homo Economicus\" and rational decision-making. There's also a photo of a woman on the slide.\n\nTo the right of the screen, there's a banner for \"Web Summit 2016\" with a globe image on it.\n\nThe setting looks like a conference room with gray walls and a white ceiling. There are black chairs visible in the room.\n\nThe man seems to be gesturing with his right hand while speaking, and he's looking towards the audience. The overall atmosphere appears professional and focused on the topic of rational decision-making and emotional detachment in economic contexts."}, {"start": 3000, "end": 3030, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind the presenter is a large screen displaying slides from his presentation. The first slide visible is titled \"We are not Rational\" and includes information about a woman named Linda. The second slide is titled \"Emotions and Decisions\" and discusses the impact of emotions on decision-making.\n\nTo the right of the screen, there's a black banner with white text that reads \"WebSe24\" and includes a logo with a triangle and a globe.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the background.\n\nThe presenter seems to be discussing topics related to rationality, emotions, and decision-making, possibly in the context of psychology or behavioral economics."}, {"start": 3030, "end": 3060, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind the presenter, there's a large screen displaying a slide titled \"Emotions and Decisions.\" The slide includes text about emotions and decision-making, mentioning a patient named \"Eliot\" who lost his emotions and became incapable of making any decisions. It also discusses how the lack of emotion makes otherwise equally good options unattractive.\n\nTo the right of the screen, there's a black banner with white text that reads \"WebSe24\" and includes a logo with a globe and a triangle.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the background.\n\nThe video seems to be focused on the relationship between emotions and decision-making processes, possibly exploring how emotional states can influence our ability to make choices."}, {"start": 3060, "end": 3090, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit jacket, blue shirt, and tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"A Prism of our Own Feelings.\" The slide contains three bullet points:\n\n1. People treat machines as if they have the same feelings\n2. People treat machines as if they have the same feelings\n3. Responses are interpreted as motivated by feelings\n\nThe background of the slide shows a man sitting at a desk with his head in his hands, looking at a laptop.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and the year \"2016\" visible.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, possibly discussing the concept of anthropomorphism in technology or how people project human emotions onto machines."}, {"start": 3090, "end": 3120, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind the presenter, there's a large screen displaying a slide titled \"A Prism of our Own Feelings.\" The slide contains three bullet points:\n\n1. People treat machines as if they have the same feelings\n2. People treat machines as if they have the same feelings\n3. Responses are interpreted as if they are motivated by feelings\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol.\n\nThe setting looks like a professional conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe video seems to be from a presentation about how people perceive and interact with machines, particularly in terms of attributing human-like emotions to them."}, {"start": 3120, "end": 3150, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop in front of him, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"ELIZA\" with some text and code. To the right of the screen, there's a banner for \"WebS24\" with a globe image.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the foreground.\n\nThe presentation seems to be about ELIZA, a computer program from the 1960s that simulated conversation with a human. The slide mentions \"Simulated Empathy\" and includes a quote about the limitations of machine empathy.\n\nThe video captures the man in various poses as he speaks, including gesturing with his right hand and looking at the audience. The overall atmosphere suggests a serious, academic discussion about artificial intelligence and its capabilities."}, {"start": 3150, "end": 3180, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Simulated Empathy.\" The slide includes an image of a woman and some text. The text on the slide reads:\n\n\"Simulated empathy feels, empty. Machines don't have lived human experience, so when they say they 'understand' or 'feel,' it's inauthentic.\"\n\nThe presenter is Robert M. Martin, as indicated by the text on the slide.\n\nTo the right of the screen, there's a banner for \"Web Summit 2016\" with a black background and white text.\n\nThe setting appears to be a conference room with white walls and a gray floor. There are black chairs visible in the background.\n\nThe overall atmosphere suggests a professional, tech-focused event discussing topics related to artificial intelligence and empathy."}, {"start": 3180, "end": 3210, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a dark suit jacket, white shirt, and tie. He's gesturing with his right hand as he speaks.\n\nBehind him is a large screen displaying a PowerPoint presentation. The slide is titled \"Simulated Empathy\" and includes a quote from Robert Martin about the limitations of simulated empathy in machines. The background of the slide features a woman's face.\n\nTo the right of the screen, there's a banner for \"Web Summit 2016\" with a globe image on it.\n\nThe setting looks like a modern conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe presentation seems to be discussing the concept of simulated empathy, particularly in the context of artificial intelligence and machine learning. The speaker appears to be exploring the challenges and limitations of creating empathy in machines.\n\nThe video captures the man in various poses as he speaks, with the camera focusing on him and the screen behind him. The overall atmosphere suggests a professional, thought-provoking discussion about the intersection of technology and human emotions."}, {"start": 3210, "end": 3240, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a white podium with a laptop on it, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is gesturing with his right hand as he speaks.\n\nBehind him is a large screen displaying a PowerPoint presentation. The slide is titled \"Testing 1, 2...\" and contains bullet points about testing models for empathy. There's also a logo for the conference in the top left corner of the screen.\n\nTo the right of the screen, there's a black banner with white text that reads \"WebSci24\" and includes a globe image. The room appears to be a conference hall with gray walls and a white ceiling.\n\nThe presentation seems to be about testing models for empathy, discussing how these models can be tested and what they're based on. The speaker is likely explaining the process and importance of these tests in the context of empathy research.\n\nThe overall atmosphere suggests a professional academic or research conference focused on web science or related topics."}, {"start": 3240, "end": 3270, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Creativity as Accident.\" The slide includes text and an image of a person sitting on the ground. The background of the screen is white with a faint image of a person walking.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe and triangle design. The room has gray walls and a white ceiling.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while looking at the screen. The overall atmosphere suggests a professional, academic, or business setting focused on creativity and technology."}, {"start": 3270, "end": 3300, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Creativity as Accident.\" The slide includes text and an image of a woman with pink hair. The background of the slide is white with a black and white photo of a woman in the center.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a globe image and a triangle symbol. The room has white walls and a wooden floor.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while looking at the screen. The overall atmosphere appears professional and focused, typical of a business or technology conference."}, {"start": 3300, "end": 3330, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide with the text \"Creation = Selection?\" and \"A robot wrote this article? Scared yet? Are you GPT-3 human?\" This suggests the presentation is about artificial intelligence and its impact on content creation.\n\nTo the right of the screen, there's a banner for \"WebSe24\" with a logo and some text, indicating this is likely a tech or AI conference.\n\nThe setting looks like a modern conference room with white walls and gray cabinets. There are black chairs visible in the background, and a vent can be seen on the wall.\n\nThe man seems to be gesturing with his right hand while speaking, engaging with his audience. The overall atmosphere appears professional and focused on the topic of AI and its role in content creation."}, {"start": 3330, "end": 3360, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He's holding a microphone in his right hand.\n\nBehind him is a large screen displaying a slide with the title \"Criteria of Creativity\" and bullet points including \"Novel,\" \"Surprising,\" \"Valuable,\" and \"Motivation.\" The background of the slide features an image of a disorganized desk.\n\nTo the right of the screen, there's a vertical banner with \"WebSe24\" written on it, along with a globe and a triangle symbol.\n\nThe setting appears to be a conference room with gray walls and a white ceiling. There are black chairs visible in the room, and a vent can be seen on the wall behind the presenter.\n\nThe video seems to be from a presentation about creativity, possibly discussing the criteria for creative work or ideas."}, {"start": 3360, "end": 3390, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Criteria of Creativity.\" The slide lists four points: Novel, Surprising, Valuable, and Motivation. There's also an image of a woman with long hair and sunglasses on the slide.\n\nTo the right of the screen, there's a vertical banner with \"WebSci24\" written on it, indicating this is likely a Web Science conference.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, possibly discussing the criteria for creativity shown on the slide."}, {"start": 3390, "end": 3420, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a black suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nThe presentation is focused on the topic of plagiarism. On the screen behind him, there are images of zebras and a text slide that reads \"What is Plagiarism?\" The screen also displays a quote from Jimbo Wales, the co-founder of Wikipedia, which says: \"In academia, we don't really have a problem with plagiarism. We have a problem with people who don't cite their sources.\"\n\nThe setting looks like a professional conference room with white walls and a gray floor. There's a banner on the right side of the screen that reads \"WebSci24\" and includes a globe image.\n\nThe video seems to be from a conference or seminar on web science or digital ethics, given the focus on plagiarism and the WebSci24 banner."}, {"start": 3420, "end": 3450, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a podium with a laptop in front of him, wearing a dark suit jacket, white shirt, and black pants. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"What is Plagiarism?\" The slide includes a quote from Jim Sibley about plagiarism in academia. There's also a Twitter handle \"@jimsibley\" visible on the slide.\n\nTo the right of the screen, there's a banner for \"WebSci24,\" indicating this is likely a Web Science conference. The banner features a globe and the conference logo.\n\nThe setting appears to be a professional conference room with gray walls and a white ceiling. There are black chairs visible in the background.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while speaking. The overall atmosphere suggests an academic or professional event focused on web science and related topics."}, {"start": 3450, "end": 3480, "narrative": "The video shows a man giving a presentation at a conference or seminar. He's standing at a white podium with a laptop on it, wearing a black suit jacket, white shirt, and black tie. The man has a beard and is speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Making our Lives Easier?\" The slide includes bullet points about how machines can speed up creative processes and their potential to be a creative spark.\n\nTo the right of the screen, there's a banner for \"WebS24\" with a globe image and some text that's too small to read clearly.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are black chairs visible in the foreground.\n\nThe man seems to be in the middle of his presentation, gesturing with his right hand while speaking. The overall atmosphere suggests a formal, business-oriented event focused on technology or innovation."}, {"start": 3480, "end": 3510, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit with a blue shirt and tie. He appears to be speaking into a microphone.\n\nThe presentation is focused on artificial intelligence (AI) and its capabilities. The screen behind him displays various slides with different topics:\n\n1. \"Making our Lives Easier?\" - This slide discusses how machines can speed up creative processes but lack a creative spark.\n\n2. \"Wrapping Up\" - This appears to be the conclusion of the presentation.\n\n3. \"Humanizing Models?\" - This slide seems to be about the limitations of current AI models.\n\n4. \"Humanizing Models?\" - This slide is similar to the previous one, discussing the capabilities and limitations of AI models.\n\n5. \"Humanizing Models?\" - This slide includes the phrase \"BLUFF\" in pink text, suggesting a discussion about the potential deception or overestimation of AI capabilities.\n\n6. \"Humanizing Models?\" - This final slide mentions that if we want human-like AI, it would need to possess certain capabilities.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There's a banner on the right side of the room that reads \"WebSe24\" and includes a globe image.\n\nThe man seems to be explaining the concept of humanizing AI models, discussing their current capabilities and limitations, and possibly exploring the idea of creating more human-like AI systems."}, {"start": 3510, "end": 3540, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit, glasses, and a microphone. Behind him is a large screen displaying slides from his presentation.\n\nThe first slide is titled \"Humanizing Models\" and discusses the capabilities of current AI models. It mentions that these models lack human-like qualities and raises the question of whether we want AI to possess human-like capabilities.\n\nThe second slide is titled \"Choices\" and presents two options:\n1. Keep models as single-task tools\n2. Create models combining severe human traits for general AI\n\nThe presenter is gesturing with his right hand while speaking, likely emphasizing key points from his presentation.\n\nTo the right of the presenter, there's a banner for \"WebSe24\" with a logo and some text, indicating this is likely a tech conference or seminar.\n\nThe setting appears to be a professional conference room with white walls and a gray floor. There are chairs visible in the background, suggesting this is a formal presentation setting.\n\nOverall, the video captures a moment from a tech conference where the presenter is discussing the ethical considerations and choices in AI development, specifically focusing on the humanization of AI models and the potential risks and benefits of creating more advanced, general AI systems."}, {"start": 3540, "end": 3570, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit, which suggests this is a formal event.\n\nThe presentation is focused on AI (Artificial Intelligence) and its relationship with human models. The screen behind him displays different slides with various points about AI and human models.\n\nOne slide mentions \"Choices\" and discusses keeping models as single-task tools versus creating models that combine for general AI. It also mentions low risk and improved reliability.\n\nAnother slide is titled \"Take-Home Points\" and includes a puzzle piece graphic. It discusses how humanizing AI models is normal but gives them powers they don't have and exposes their flaws.\n\nThe setting appears to be a conference room with white walls and a gray floor. There's a banner on the right side of the screen that reads \"WebSe24\" and includes a globe image.\n\nThe man seems to be explaining the concept of humanizing AI models and their implications. The presentation appears to be well-organized, with clear points being made about the relationship between AI and human models.\n\nOverall, this video captures a professional presentation on AI at what seems to be a technology or AI-focused conference."}, {"start": 3570, "end": 3600, "narrative": "The video shows a man giving a presentation at a conference. He's standing at a podium with a laptop open in front of him. The man has a beard and is wearing a suit jacket, white shirt, and black tie. He appears to be speaking into a microphone.\n\nBehind him is a large screen displaying a slide titled \"Take-Home Points.\" The slide includes a puzzle piece graphic and discusses the concept of \"humanizing AI models.\" It mentions that humanizing AI is normal, giving models powers they don't have, and obscuring their flaws.\n\nTo the right of the screen, there's a banner for \"WebSci24,\" indicating this is likely a Web Science conference. The banner features a globe image and the conference logo.\n\nThe setting appears to be a conference room with gray walls and a wooden floor. There are black chairs visible in the background.\n\nThe man seems to be in the middle of his presentation, possibly discussing the implications of humanizing AI models and how it relates to the broader topic of Web Science."}, {"start": 3600, "end": 3630, "narrative": "The video shows a presentation taking place in a conference room. A man is standing at a podium, giving a talk. Behind him is a large screen displaying a slide titled \"Take-Home Points\" with bullet points about AI. The presenter is wearing a dark suit, white shirt, and glasses, and appears to be speaking into a microphone.\n\nThe room has gray walls and a white ceiling with a vent. There are black chairs visible in the foreground. On the right side of the screen, there's a banner for \"Web2.24\" with a globe image.\n\nThe presentation seems to be about AI, with the slide mentioning \"Humanizing AI is normal\" and discussing the capabilities and limitations of AI models. The presenter is likely explaining these points to the audience.\n\nAt the end of the presentation, the screen displays \"Thank you!\" along with the presenter's Twitter handle and website.\n\nThe video captures the entire presentation, showing the presenter's body language and the audience's reaction. It's a professional setting, likely for a tech conference or seminar on AI."}]