[{"start": 0, "end": 30, "narrative": "The video displays a PowerPoint presentation slide titled \"Human Languages in Source Code: Auto-Translation for Localized Instruction.\" The slide features two men's photos, one on the left and one on the right. The man on the left has short brown hair and is wearing a black shirt, while the man on the right has short black hair and is wearing a blue shirt. Both men are smiling.\n\nThe slide includes a red circular logo in the top left corner with the text \"1991\" and \"UCSD\" visible. The main title of the slide is in black text, with \"Human Languages in Source Code\" in a larger font size, followed by \"Auto-Translation for Localized Instruction\" in a smaller font size.\n\nBelow the photos, the names \"Chris Piech\" and \"Sami Abu El-Hajja\" are displayed in black text. The slide appears to be part of a presentation about using human languages in source code for auto-translation purposes.\n\nIn the top right corner of the slide, there's a small video feed showing a group of people, likely the audience or other participants in the presentation.\n\nThe slide has a clean, professional design with a white background and black text, making the information easy to read. The overall presentation seems to be focused on a technical or educational topic related to programming and language translation."}, {"start": 30, "end": 60, "narrative": "The video displays a PowerPoint slide with a title that reads \"Empathy: What does this code say?\" The slide contains a map of Kenya, showing the country's borders and major cities such as Nairobi and Mombasa. \n\nTo the right of the map, there's an image of a cityscape featuring tall buildings, including a prominent skyscraper with a pointed top. This appears to be a modern urban area, possibly in a different country from Kenya.\n\nBelow the map and cityscape, there's a screenshot of a computer code written in a programming language. The code is in a text editor and includes elements like \"public class\" and \"private void,\" which are typical in Java or similar languages. The code is written in English, but there are some Chinese characters interspersed throughout.\n\nThe slide seems to be part of a presentation on empathy in programming or software development, possibly discussing how to understand and interpret code from different cultural perspectives. The combination of the map, cityscape, and code suggests a global or multicultural context for the topic being discussed.\n\nThe slide appears to be professionally designed, with a clean layout and clear separation between the different elements. The use of both English and Chinese in the code might be highlighting the importance of cultural understanding in software development, particularly when working with international teams or clients."}, {"start": 60, "end": 90, "narrative": "The video appears to be a presentation slide discussing the issue of English being the dominant language in the tech industry. The slide is divided into two main sections:\n\n1. On the left side, there's a large pie chart showing that 80% of the world does not speak English. This is represented by a red section of the chart. The remaining 20% is divided into two smaller sections: 15.2% for Native English speakers and 4.8% for Non-Native English speakers.\n\n2. On the right side, there's another pie chart showing that 88% of code is written in English. This is represented by a blue section of the chart. The remaining 12% is divided into two smaller sections: 12% for Non-English code and 0% for Native English code.\n\nThe slide also includes a caption that reads \"Research from this community says this is a problem,\" indicating that the presenter is highlighting this issue as a concern within the tech community.\n\nAt the top of the slide, there's a title that says \"Empathy: What does this code say?\" This suggests that the presentation is likely about fostering empathy and understanding in the tech industry, particularly regarding language barriers.\n\nThe slide appears to be part of a larger presentation, as there's a small image of a person in the top right corner, which could be the presenter or a relevant figure.\n\nOverall, the slide effectively communicates the significant disparity between the global population's language proficiency and the prevalence of English in coding, emphasizing the need for greater inclusivity and empathy in the tech community."}, {"start": 90, "end": 120, "narrative": "The video appears to be a presentation or lecture about the challenges of programming in non-English languages. It includes several slides with key points and data visualizations.\n\nThe first slide shows two pie charts. The left chart indicates that 80% of the world does not speak English, while the right chart shows that 88% of code is written in English. This highlights the discrepancy between the global population's language distribution and the prevalence of English in programming.\n\nThe next slide poses a question: \"Before this project there did not exist a tool to translate code between human languages???\" This suggests that the presentation is discussing a new project or tool aimed at addressing this issue.\n\nThe final slide displays a code snippet in a programming language, likely demonstrating how the new translation tool works. The code appears to be calculating a user's weight on the moon based on their weight on Earth.\n\nThroughout the video, there are several emojis used, which adds a casual and engaging tone to the presentation. The overall message seems to be about the importance of making programming more accessible to non-English speakers and the potential impact of this new translation tool."}, {"start": 120, "end": 150, "narrative": "The video displays a series of screenshots from a Google Translate interface. The interface is shown in both English and Chinese, with the English text on the left and the Chinese translation on the right. The screenshots are arranged in a grid format, with each row showing a different part of the interface.\n\nThe interface appears to be a text translation tool, with options for translating between English and Chinese. The English text is highlighted in blue, while the Chinese translation is highlighted in red. This color-coding helps users easily distinguish between the original text and its translation.\n\nIn the top right corner of each screenshot, there's a small image of two people, likely representing the Google Translate logo or branding.\n\nThe interface includes various elements such as:\n\n1. A navigation bar at the top with options for different languages.\n2. A text box for entering the text to be translated.\n3. A button to initiate the translation process.\n4. A list of translated text below the input box.\n\nThe screenshots are arranged in a grid format, with each row showing a different part of the interface. This allows viewers to see the interface from multiple angles and understand its functionality.\n\nOverall, the video provides a comprehensive overview of the Google Translate interface, showcasing its user-friendly design and bilingual capabilities."}, {"start": 150, "end": 180, "narrative": "The video appears to be a presentation slide about a tool called \"Code International.\" The slide is divided into two main sections:\n\n1. On the left side, there's a screenshot of a Google Translate page. This screenshot shows a text box with some English text and a corresponding Chinese translation. The English text includes phrases like \"import program,\" \"calculate weight on the moon,\" and \"get your weight on earth.\" The Chinese translation is visible on the right side of the screenshot.\n\n2. On the right side of the slide, there's a black background with white text. The text reads:\n\n\"Someone: Chris, can't you just translate everything by hand?\nChris: ...\"\n\nBelow this, there are three numbered points:\n1. Learn how non-English coders use language in code.\n2. Code International: A tool to translate code between human-languages.\n3. Example use: Translating a Computer Science text book.\n\nThe slide seems to be discussing the challenges of translating code and introducing Code International as a solution for this problem. It highlights the importance of understanding how non-English coders use language in their code and presents Code International as a tool to facilitate translation between different human languages, particularly in the context of computer science textbooks."}, {"start": 180, "end": 210, "narrative": "The video appears to be a presentation slide about a tool called \"Code International.\" It's focused on translating code between human languages, particularly for non-English coders. The slide has a black background with white text and a blue border.\n\nThe main points covered in the slide are:\n\n1. Learning how non-English coders use language in code.\n2. Introducing \"Code International\" as a tool for translating code between human languages.\n3. Providing an example use case: translating a Computer Science text book.\n\nAt the bottom of the slide, there's a section titled \"Some Vocabulary\" which includes:\n\n- L1 language = Mother tongue\n- Translation = namaste duniya > Namaste Duniya\n- Translation = namaste duniya > Hello World\n- Right to Left Language = Arabic or Hebrew\n\nThe slide also features a small image of a person in the top right corner, likely the presenter.\n\nOverall, the presentation seems to be about making coding more accessible to non-English speakers by providing tools for translating code into their native languages."}, {"start": 210, "end": 240, "narrative": "The video appears to be a presentation slide about language analysis on GitHub. It's divided into two main sections:\n\n1. The top section is titled \"Some Vocabulary\" and contains information about the L1 language (mother tongue), a translation of \"Namaste Duniya\" to \"Hello World,\" and mentions that right-to-left languages like Arabic or Hebrew are being considered.\n\n2. The bottom section is titled \"World's First Analysis of Human Languages on Git\" and provides statistics about the number of projects and users on GitHub. It also explains why Java was chosen for this analysis.\n\nThe slide includes a logo for GitHub and a Java logo, indicating the platform and programming language being used for this analysis. There's also a note about the number of public users on GitHub.\n\nThe presentation seems to be discussing the use of GitHub for analyzing human languages, possibly in the context of programming or software development."}, {"start": 240, "end": 270, "narrative": "The video appears to be a presentation slide about analyzing human languages in code. It's titled \"World's First Analysis of Human Languages on Git\" and features a cat logo with a coffee cup next to it, along with the Java logo.\n\nThe slide provides some key statistics:\n- 2.9 million projects\n- 1.1 million users\n\nIt also shows the distribution of non-English users:\n- Chinese: 48%\n- Spanish: 23%\n- Portuguese: 13%\n- French: 7%\n\nThe slide mentions that there are 1,097,809 public users on GitHub.\n\nThere's a section titled \"Aside: Why Java?\" which lists three reasons:\n1. Tons of code\n2. Lots of student code\n3. Easy to parse\n\nThe slide also includes a code snippet with comments in various languages, demonstrating how they analyzed human language in code. The code shows:\n- A comment in Chinese: \"void 函数名(参数列表)\"\n- A comment in Spanish: \"void potencia(int base, int exponente)\"\n- A comment in Portuguese: \"void potencia(int base, int exponente)\"\n- A comment in French: \"void potencia(int base, int exponente)\"\n\nThe slide concludes with a question: \"How did we analyze human language in code?\"\n\nOverall, this presentation seems to be discussing a study or analysis of how human languages are used in code repositories, particularly on GitHub, and how they approached this analysis using Java."}, {"start": 270, "end": 300, "narrative": "The video appears to be a presentation slide about analyzing human language in code. It's divided into three sections: English, Script, and Translation. The slide is in Chinese and English, with the main title \"How did we analyze human language in code?\" at the top.\n\nThe slide explains that they looked at three aspects of code to analyze human language:\n\n1. Commit message language\n2. Comments\n3. Identifiers\n\nThe English section shows code snippets with comments in English. The Script section shows the same code snippets with comments in Chinese. The Translation section shows the code snippets with comments in both English and Chinese.\n\nAt the bottom of the slide, there's a key icon followed by text that says \"You can better estimate a user's L1 language by including their git commit messages. Not perfect! But useful.\"\n\nThe slide also includes a logo in the bottom right corner, which appears to be a seal or emblem.\n\nOverall, the slide seems to be discussing methods for analyzing programming languages to determine a user's first language (L1) based on their commit messages and code comments."}, {"start": 300, "end": 330, "narrative": "The video appears to be a presentation slide deck discussing language patterns on GitHub. It's divided into several slides, each with different content:\n\n1. The first slide has a gold key icon and text that reads: \"You can better estimate a user's L1 language by including their git commit messages. Not perfect! But useful.\"\n\n2. The second slide is black with the word \"[Suspense]\" written in white.\n\n3. The third slide is titled \"Language Patterns on GitHub\" and contains a scatter plot graph. The x-axis is labeled \"% Projects with local language identifiers\" and ranges from 0 to 100. The y-axis is labeled \"% With local language comments\" and ranges from 0 to 100. There are two data points labeled \"French\" and \"Korean\" on the graph.\n\n4. The fourth slide is similar to the third, but with a different color scheme. It has the same title and graph, but the data points are labeled \"French\" and \"Dutch.\"\n\n5. The fifth slide is identical to the fourth, with the same title, graph, and data points.\n\n6. The sixth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n7. The seventh slide is identical to the sixth, with the same title, graph, and data points.\n\n8. The eighth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n9. The ninth slide is identical to the eighth, with the same title, graph, and data points.\n\n10. The tenth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n11. The eleventh slide is identical to the tenth, with the same title, graph, and data points.\n\n12. The twelfth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n13. The thirteenth slide is identical to the twelfth, with the same title, graph, and data points.\n\n14. The fourteenth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n15. The fifteenth slide is identical to the fourteenth, with the same title, graph, and data points.\n\n16. The sixteenth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n17. The seventeenth slide is identical to the sixteenth, with the same title, graph, and data points.\n\n18. The eighteenth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n19. The nineteenth slide is identical to the eighteenth, with the same title, graph, and data points.\n\n20. The twentieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n21. The twenty-first slide is identical to the twentieth, with the same title, graph, and data points.\n\n22. The twenty-second slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n23. The twenty-third slide is identical to the twenty-second, with the same title, graph, and data points.\n\n24. The twenty-fourth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n25. The twenty-fifth slide is identical to the twenty-fourth, with the same title, graph, and data points.\n\n26. The twenty-sixth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n27. The twenty-seventh slide is identical to the twenty-sixth, with the same title, graph, and data points.\n\n28. The twenty-eighth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n29. The twenty-ninth slide is identical to the twenty-eighth, with the same title, graph, and data points.\n\n30. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n31. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n32. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n33. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n34. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n35. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n36. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n37. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n38. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n39. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n40. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n41. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n42. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n43. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n44. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n45. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n46. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n47. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n48. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n49. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n50. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n51. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n52. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n53. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n54. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n55. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n56. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n57. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n58. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n59. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n60. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n61. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n62. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n63. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n64. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n65. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n66. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n67. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n68. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n69. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n70. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n71. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n72. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n73. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n74. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n75. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n76. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n77. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n78. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n79. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n80. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n81. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n82. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n83. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n84. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n85. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n86. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n87. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n88. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n89. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n90. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n91. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n92. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n93. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n94. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n95. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n96. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n97. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n98. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n99. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n100. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n101. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n102. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n103. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n104. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n105. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n106. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n107. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n108. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n109. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n110. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n111. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n112. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n113. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n114. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n115. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n116. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n117. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n118. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n119. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n120. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n121. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n122. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n123. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n124. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n125. The thirtieth slide is identical to the thirtieth, with the same title, graph, and data points.\n\n126. The thirtieth slide is similar to the previous ones, but with a different color scheme. It has the same title, graph, and data points.\n\n127."}, {"start": 330, "end": 360, "narrative": "The video displays a slide titled \"Language Patterns on GitHub.\" It features a scatter plot graph with two axes: the x-axis represents the percentage of projects with local language identifiers, while the y-axis shows the percentage of comments with local language comments.\n\nThe graph is populated with data points for various languages, including Chinese, Korean, Japanese, Russian, Dutch, French, Spanish, Portuguese, German, and Indonesian/Malay. Each language is represented by a different colored dot on the graph.\n\nA notable feature of the slide is a purple oval shape that encircles several of the data points, specifically those representing Western European languages. This oval is accompanied by a text box that states, \"Western European coders often write in their own language.\"\n\nAdditionally, there's a red circle on the left side of the graph that includes Chinese, Korean, Japanese, and Russian. This circle is accompanied by a text box that reads, \"Non-Latin scripts often use English identifiers (or transliterate).\"\n\nThe slide appears to be part of a presentation, as evidenced by the presence of a presenter's image in the top right corner. The overall purpose of the slide seems to be to illustrate language usage patterns among GitHub users, highlighting differences between Western European and non-Latin script languages."}, {"start": 360, "end": 390, "narrative": "The video displays a slide titled \"Language Patterns on GitHub.\" The slide contains a scatter plot graph with two axes: the x-axis is labeled \"% Projects with local language identifiers\" and the y-axis is labeled \"% With local language comments.\" The graph shows various data points representing different languages, including Chinese, Korean, Japanese, French, Spanish, Portuguese, German, Russian, Dutch, and Indo-Malay.\n\nA notable feature of the graph is a purple oval shape that encircles the data points for Dutch and Indo-Malay. This oval is accompanied by a text box that states \"Lower resource languages have an interesting composition of language.\"\n\nThe slide also includes a legend indicating that blue dots represent \"Comments\" and green dots represent \"Identifiers.\"\n\nIn the bottom right corner of the slide, there's a red circular logo with a white design inside it.\n\nThe slide appears to be part of a presentation analyzing language usage patterns on GitHub, particularly focusing on how lower resource languages are represented in project identifiers and comments."}, {"start": 390, "end": 420, "narrative": "The video displays a PowerPoint presentation slide titled \"Language Patterns on GitHub.\" The slide features a bar graph comparing the percentage of projects with transliterated identifiers and comments in Spanish and Chinese.\n\nThe graph shows that for both languages, the percentage of projects with transliterated identifiers is significantly higher than those with transliterated comments. Specifically, the graph indicates that:\n\n- For Spanish, 90% of projects have transliterated identifiers, while only 40% have transliterated comments.\n- For Chinese, 80% of projects have transliterated identifiers, and 30% have transliterated comments.\n\nThe slide includes a note stating \"Most users transliterate identifiers,\" which aligns with the data presented in the graph.\n\nIn the bottom right corner of the slide, there's a statement in Arabic: \"هناك مشاريع قليلة جداً تستخدم الأحرف العربية من اليمين إلى اليسار\" which translates to \"There are virtually zero projects with right-to-left language scripts.\"\n\nThe slide also features a small image of a person in the top right corner, likely the presenter of the presentation.\n\nThe overall presentation appears to be discussing language usage patterns on GitHub, focusing on the prevalence of transliteration in code comments and identifiers, as well as the rarity of right-to-left language scripts in projects."}, {"start": 420, "end": 450, "narrative": "The video appears to be a presentation slide deck discussing language patterns on GitHub and the need for human-language code translation. Here's a detailed description of the content:\n\n1. The title slide reads \"Language Patterns on GitHub\" and includes a subtitle: \"Many people live in a world of mixed languages in code.\"\n\n2. The first slide shows a graph with various languages plotted on it, including Chinese, Korean, Japanese, French, Spanish, Portuguese, Russian, Dutch, and Indonesian/Malay. The graph illustrates the percentage of projects with local language identifiers.\n\n3. The next slide emphasizes that many people explicitly want content in their mother tongue.\n\n4. A motivational slide states: \"the people need human-language code translation\" and poses the question \"But how? (slightly subtle)\"\n\n5. The final slide is titled \"Translating Identifiers\" and shows an example of code with a class name \"MoonWeight\" being translated to \"Moon Weight\" and then to \"Peso Lunar\" in Spanish.\n\nThe presentation seems to be advocating for tools to support learners by translating code identifiers into local languages, making it easier for non-English speakers to understand and work with code."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation slide about translating identifiers in programming languages, specifically focusing on English to Spanish translations. The slide is titled \"Gotcha 1: Watch out for short identifiers\" and contains two main sections:\n\n1. A comparison of English and Spanish code snippets:\n   - English: \"for(int i = 0; i < 3; i++) { print(i); }\"\n   - Spanish: \"for(int yo = 0; yo < 3; yo++) { print(yo); }\"\n\n2. A note about transliterating right-to-left languages, mentioning a special Arabic transliteration invented by Sami.\n\nThe slide is designed to highlight potential pitfalls when translating code between languages, particularly when dealing with short identifiers and right-to-left languages.\n\nThe layout is clean and professional, with a white background and black text. The English and Spanish code snippets are enclosed in blue boxes, making them stand out. The slide also includes a small image of a person in the top right corner, adding a personal touch to the presentation.\n\nOverall, the slide serves as an educational tool to help programmers be aware of common issues when translating code between languages, emphasizing the importance of careful consideration of identifier lengths and language-specific transliteration rules."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation slide about code internationalization. It's divided into two main sections:\n\nThe first section is titled \"Gotcha 3: Transliterate right to left languages.\" This part seems to focus on the challenges of handling languages that are written from right to left, such as Arabic. It mentions that Sami invented a special Arabic transliteration that never starts with a number.\n\nThe second section is titled \"Code International.\" This part outlines the process of internationalizing code, with three main steps:\n\n1. Collect identifiers\n2. Translate identifiers\n3. Translate comments\n\nThe slide uses a visual representation to show the flow of this process, with arrows indicating the direction of translation from English to Chinese.\n\nThere's also a note at the bottom of the slide that emphasizes the importance of consistently translating identifiers.\n\nThe slide has a clean, professional design with a white background and black text. It includes a logo in the bottom right corner, which appears to be a red seal with a white design inside it.\n\nOverall, the video seems to be an educational resource for developers working on internationalizing their code, particularly when dealing with languages that have unique writing systems like Arabic."}, {"start": 510, "end": 540, "narrative": "The video appears to be a presentation slide about \"Code Internationalization\" in programming. It's divided into two main sections:\n\n1. The top half shows a flowchart illustrating the process of internationalizing code. It demonstrates how code written in English is transformed into an internationalized version, which can then be translated into Chinese.\n\n2. The bottom half displays a comparison between English and Chinese code. It shows how the same code looks in both languages, highlighting the differences in syntax and structure.\n\nThe slide emphasizes the importance of maintaining consistency across files during the internationalization process. It also mentions that comments often refer to identifiers, which is a key aspect of code internationalization.\n\nThe presentation seems to be focused on teaching or explaining the concept of internationalizing code, particularly in the context of Java programming."}, {"start": 540, "end": 570, "narrative": "The video appears to be a presentation or lecture about translating a textbook, specifically focusing on a Java textbook. The slides are in English and Spanish, with some content also in Chinese. The presentation includes various elements:\n\n1. A title slide that reads \"Translating a textbook\" with a subtitle \"100+ languages translated into 100+ languages.\"\n\n2. A slide showing a Java logo and the phrase \"Java es\" in Spanish, which translates to \"Java is\" in English.\n\n3. A slide with a code example and a reference section.\n\n4. A slide titled \"Capítulo 5: Ciclos For\" (Chapter 5: For Loops) with diagrams and code examples.\n\n5. A slide titled \"Capítulo 6: Ciclos While\" (Chapter 6: While Loops) with similar content.\n\n6. A slide with a Chinese title \"卡雷尔机器人\" (Karel the Robot) and the phrase \"学Java\" (Learn Java).\n\nThe presentation seems to be about teaching Java programming, possibly using a Karel the Robot framework. It includes examples of for loops and while loops, which are fundamental concepts in programming.\n\nThe slides are designed to be educational, with clear headings, code examples, and diagrams to illustrate programming concepts. The use of multiple languages suggests this is a multilingual educational resource, likely aimed at a diverse audience or for translation purposes."}, {"start": 570, "end": 600, "narrative": "The video appears to be a presentation or lecture about teaching coding to children. It's divided into several slides, each with different content.\n\nThe first slide shows a screenshot of a website with Chinese text. The main title is \"学Java\" which translates to \"Learn Java\" in English. Below that, there's a button that says \"开始学习\" meaning \"Start Learning.\"\n\nThe second slide displays a world map with various locations marked. The text above the map reads \"Used by people around the world,\" suggesting that the coding program or website is used globally.\n\nThe third slide contains a conversation between two people:\nSkeptic: \"Kids should learn English before they learn to code.\"\nChris: \"Reality is that most students are not native speakers of English. We believe language is a barrier to S4ALL\"\n\nThe final slide shows a screenshot of a website with Chinese text. The main title is \"学Java\" which translates to \"Learn Java\" in English. Below that, there's a button that says \"开始学习\" meaning \"Start Learning.\"\n\nThroughout the video, there's a watermark in the bottom right corner that says \"Used by people around the world,\" reinforcing the global reach of the coding program or website being discussed.\n\nThe video seems to be advocating for teaching coding in multiple languages, particularly for non-native English speakers, to make it more accessible to a wider audience."}, {"start": 600, "end": 630, "narrative": "The video appears to be a presentation or lecture about the importance of learning to code, particularly in the context of non-native English speakers. It's divided into several slides, each with different content.\n\nThe first slide presents a skeptical viewpoint that children should learn English before coding. This is countered by Chris, who states that most students are not native English speakers and that language can be a barrier to learning.\n\nThe second slide asks \"What about other languages?\" and features a logo for C++.\n\nThe final slide shows a screenshot of a Wikipedia page, suggesting that the next topic will be about translating Wikipedia content.\n\nThroughout the video, there's a watermark visible in the bottom right corner, which appears to be a red circular stamp with a white border and some text inside.\n\nThe overall theme seems to be advocating for inclusive coding education, recognizing that language barriers can hinder learning and emphasizing the importance of multilingual resources like Wikipedia."}, {"start": 630, "end": 660, "narrative": "The video appears to be a presentation slide about translating Wikipedia content. It's divided into two main sections:\n\n1. On the left side, there's a screenshot of a Wikipedia page. The page is in English and shows a lightning bolt image with the word \"Umenme\" visible.\n\n2. On the right side, there's a screenshot of a different Wikipedia page. This one is in a non-English language, likely Spanish, and also features the \"Umenme\" text.\n\nAt the top of the slide, there's a title that reads \"Next up: Translate Wikipedia.\"\n\nBelow the screenshots, there's a URL: https://swiki.wikipedi.org/wiki/Umenme\n\nIn the bottom right corner, there's a Twitter handle: @chrisspiech\n\nThe slide seems to be part of a presentation about translating Wikipedia content, possibly for a class or workshop. It's likely discussing the process of translating Wikipedia articles from English to other languages, using the \"Umenme\" page as an example."}, {"start": 660, "end": 690, "narrative": "The video appears to be a presentation slide from a lecture or talk. It's set against a black background with white text and a Twitter logo. The slide contains three main points:\n\n1. \"Learn how non-English coders use language in code.\"\n2. \"Code International: A tool to translate code between human-languages.\"\n3. \"Example use: translating a Computer Science text book.\"\n\nAt the bottom of the slide, there's a Twitter handle \"@chrisspiech\" displayed.\n\nThe slide also includes a URL: https://compedu.stanford.edu/, which suggests this content is related to computer education at Stanford University.\n\nIn the top right corner, there's a small video thumbnail showing two people, likely the presenter and a co-presenter or guest speaker for this lecture.\n\nThe overall presentation style is clean and professional, focusing on delivering key information about code translation and its applications in computer science education."}, {"start": 690, "end": 720, "narrative": "The video displays a slide presentation with a black background and white text. The slide appears to be part of a lecture or presentation on computer science, specifically focusing on non-English coders and code translation.\n\nThe slide contains three main points:\n\n1. \"Learn how non-English coders use language in code.\"\n2. \"Code International: A tool to translate code between human-languages.\"\n3. \"Example use: translating a Computer Science text book.\"\n\nAt the bottom of the slide, there's a Twitter handle \"@chrisspiech\" and a Twitter logo.\n\nThe slide also includes a URL at the top: \"https://compedu.stanford.edu/\".\n\nIn the top right corner, there's a small video feed showing a person, likely the presenter, with a green background.\n\nThe slide seems to be discussing the challenges and solutions for non-English speakers in the coding world, particularly focusing on a tool called \"Code International\" that can translate code between different human languages. The example given is translating a Computer Science textbook, which suggests this tool could be used for educational purposes as well.\n\nOverall, the slide appears to be part of a lecture or presentation on the topic of code translation and its applications, particularly for non-English speaking coders and educators."}]