[{"start": 0, "end": 30, "narrative": "The video showcases a presentation at the ACM BuildSys 2024 conference. The main focus is on a woman standing at a podium, delivering a speech. She appears to be discussing the topic of \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\"\n\nThe background features a large screen displaying a futuristic cityscape with blue and purple hues, along with the conference title and date. The setting is a conference room with rows of chairs and tables visible in the foreground.\n\nThe presentation seems to be exploring the potential of time series foundation models in the field of predictive building analytics. This suggests a discussion on how advanced data analysis techniques could transform the way we understand and optimize building systems.\n\nThe video captures the professional atmosphere of the conference, with the speaker engaging the audience on an important topic in the realm of smart buildings and energy efficiency."}, {"start": 30, "end": 60, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of the ACM BuildSys 2024 conference.\n\nThe slide has a blue background with a cityscape image at the bottom. On the left side, there's a photo of a woman, presumably the presenter, named Omer Bar. She's wearing a black jacket and has long dark hair.\n\nThe main content of the slide is a graph showing a sampling rate over time. The x-axis represents time in hours, ranging from 0 to 48 hours. The y-axis shows the sampling rate in minutes, starting at 15 minutes and increasing to 48 hours.\n\nThe graph has two lines:\n1. A green line representing a 15-minute sampling rate.\n2. A red line representing a 48-hour sampling rate.\n\nThere's a question mark at the end of the red line, suggesting a point of discussion or analysis.\n\nThe slide also includes the names of other presenters:\n- Omer Bar (University of California, Los Angeles)\n- Cathy Wu (Massachusetts Institute of Technology)\n- Xingjian Xu (University of Hong Kong)\n- Kian Ming Aik (University of Hong Kong)\n\nAt the bottom of the slide, there are navigation options for the presentation: Introduction, Motivation, Review, Methodology, Results, and Future.\n\nThis slide seems to be introducing the topic of time series foundation models in the context of predictive building analytics, likely discussing the implications of different sampling rates on data analysis and prediction accuracy."}, {"start": 60, "end": 90, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Cesar Barra, Cameron Mullen, and Kianoush Gharibzadeh from the University of California, Los Angeles.\n\nThe slide is divided into two main sections:\n\n1. Introduction:\n   - A woman is shown speaking at a podium, likely the presenter.\n   - There's a graph with a line representing a sampling rate over time, showing a peak at 15 minutes, followed by a drop to 48 hours and then 12 hours.\n\n2. Motivation:\n   - This section explains that Foundation Models gained popularity due to their success with Large Language Models.\n\nThe slide also includes logos for SIGEnergy and ACM BuildSys 2024, indicating the event and organization hosting the presentation.\n\nThe background of the slide features a cityscape with a blue sky, adding a professional and modern aesthetic to the presentation."}, {"start": 90, "end": 120, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Cesar Barraza from the University of California, Los Angeles.\n\nThe slide has a blue background with a cityscape image at the bottom. On the left side, there's a photo of the presenter, Cesar Barraza, who is a woman with long dark hair. She's wearing a black top and is seated at a desk with a laptop.\n\nThe main content of the slide is divided into two sections:\n\n1. A \"Motivation\" section that explains the rise in popularity of Foundation Models due to their success with Large Language Models.\n\n2. A section titled \"Foundation Models\" that provides more details about these models, including their ability to achieve zero-shot or few-shot performance without domain-specific training.\n\nThe slide also includes logos for SIGEnergy and ACM BuildSys 2024 at the top, indicating the conference and organization associated with this presentation.\n\nOverall, the slide seems to be discussing the potential impact of Foundation Models on predictive building analytics, suggesting that these models could significantly advance the field by enabling more efficient and effective predictive analysis in building systems."}, {"start": 120, "end": 150, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by a woman named Carol Bar (University of California, Los Angeles).\n\nThe slide is divided into two main sections:\n\n1. Motivation:\n   - This section explains that Foundation Models rose in popularity due to their success with Large Language models.\n   - It mentions that these models excelled in generalization, achieving zero-shot or few-shot performance without domain-specific training.\n   - Researchers have attempted to replicate this success with Time Series Foundation Models (TSFMs).\n\n2. Review:\n   - This section appears to be about assessing TSFMs' readiness for building analytics.\n   - There's a table comparing different TSFM models, but the details are not fully visible.\n\nThe slide has a blue background with a cityscape image at the bottom, likely representing urban environments where building analytics are relevant. The presenter's image is shown on the left side of the slide.\n\nThe slide seems to be discussing the potential of Time Series Foundation Models in the field of predictive building analytics, exploring their capabilities and readiness for application in this domain."}, {"start": 150, "end": 180, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. The slide is titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of a SIGEnergy session.\n\nThe slide has a blue background with a cityscape image at the bottom. On the left side, there's a photo of a woman, presumably the presenter, named Ceren Melis Yılmaz. She's identified as the session chair.\n\nThe main content of the slide is a table titled \"Review of TSFMs: Have the necessary features.\" This table compares different models based on their features:\n\n- Zero Modelling\n- Handling time-series\n- Time-series tasks\n- Time-series tasks\n\nThe table lists several models, including:\n- LSTM\n- GRU\n- Transformer\n- Transformer-XL\n- Longformer\n- T5\n- BERT\n- GPT-3\n\nEach model is evaluated against the four features mentioned above, with checkmarks indicating which features they support.\n\nThe slide also includes a navigation bar at the bottom with options for Introduction, Motivation, Review, Methodology, Results, and Future.\n\nOverall, the slide seems to be discussing the potential of time series foundation models in predictive building analytics, comparing their capabilities and features."}, {"start": 180, "end": 210, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. The slide is titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, a PhD student at the University of California, Los Angeles.\n\nThe slide has a blue background with a cityscape image in the bottom right corner. The main content is divided into two sections:\n\n1. A review of Time Series Foundation Models (TSFMs) and their features:\n   - The slide lists various TSFM models and their capabilities in handling zero values, time series tasks, and timestamps.\n\n2. A statement about today's TSFMs:\n   - It mentions that current TSFMs do not take timestamps and are not task-agnostic.\n\nThe slide also includes a list of presenters:\n- Caren Bar (University of California, Los Angeles)\n- Pranav Balu (University of California, Los Angeles)\n- Kianoush Ghiassi (University of California, Los Angeles)\n- Vicent Goyet (University of Science and Technology)\n\nAt the bottom of the slide, there are navigation options for \"Introduction,\" \"Motivation,\" \"Review,\" \"Methodology,\" \"Results,\" and \"Future.\"\n\nThe overall presentation seems to be discussing the potential of TSFMs in predictive building analytics, highlighting their current capabilities and limitations."}, {"start": 210, "end": 240, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, a PhD student at the University of California, Los Angeles.\n\nThe slide has a blue background with a cityscape image in the bottom right corner. The main content is divided into two sections:\n\n1. A review of Time Series Foundation Models (TSFMs) and their features:\n   - The slide lists various TSFM models and their capabilities, including zero-shot, handling time-series, time-agnostic, and timestamp features.\n\n2. A statement about today's TSFMs:\n   - It mentions that current TSFMs are not time-series forecasting due to the limited number of univariate zero-shot forecasting models with covariance handling.\n\nThe presenter, Caren Bar, is shown in a small video feed on the left side of the slide. The slide also includes logos for SIGEnergy and ACM BuildSys 2024 at the top.\n\nThe overall presentation seems to be discussing the potential of TSFMs in predictive building analytics, highlighting their current capabilities and limitations."}, {"start": 240, "end": 270, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Oscar Baris, Cameron Mullen, and Kianoush Gharibzadeh from the University of California, Los Angeles.\n\nThe slide is divided into two main sections:\n\n1. On the left side, there's a blue background with a cityscape image. A woman is visible, likely the presenter, standing in front of a podium with a microphone.\n\n2. On the right side, there's a white background with a green and purple logo at the top. Below the logo, there's a title and a subtitle.\n\nThe main content of the slide is divided into two parts:\n\n1. \"Methodology-1\" is written at the top of the right side.\n\n2. Below that, there's a section titled \"Generability\" with a green and purple globe icon.\n\nThe slide also includes a navigation bar at the bottom with options for \"Introduction,\" \"Motivation,\" \"Review,\" \"Methodology,\" \"Results,\" and \"Future.\"\n\nThe overall design is professional and visually appealing, with a clear focus on the topic of predictive building analytics and the potential impact of time series foundation models in this field."}, {"start": 270, "end": 300, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, Cameron Mullen, and Xiangyu Wang.\n\nThe slide is divided into two main sections:\n\n1. On the left side, there's a blue background with a cityscape image. At the top, there's a white text box containing the title of the presentation. Below the title, there's a list of presenters' names and affiliations:\n   - Caren Bar (University of California, Los Angeles)\n   - Cameron Mullen (University of California, Los Angeles)\n   - Xiangyu Wang (University of California, Los Angeles)\n\n2. On the right side, there's a white background with a green text box containing the subtitle \"Methodology - I\". Below this, there's a diagram showing \"Generability\" with two branches:\n   - \"Data-level Familiarity\"\n   - \"Modality-level Familiarity\"\n\nThe slide also includes a list of datasets used in their research:\n- ecebe DYD Dataset: 1,000 homes in California, Texas, Illinois, New York, 5-minute intervals\n- UCI 30-minute dataset: 370 apartments in Portugal, 2011-2014, 15-minute intervals\n- Smart Homes Dataset: 14 apartments in Amherst, Massachusetts, 2014-2016, 30-minute intervals\n\nThe slide has a professional and academic appearance, typical of a conference presentation in the field of building analytics and predictive modeling."}, {"start": 300, "end": 330, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of a SIGEnergy session.\n\nThe slide is divided into two main sections:\n\n1. Methodology-I:\n   - This section seems to focus on the data used for the study. It mentions:\n     - 1,000 homes in California, Texas, Illinois, New York, and 5 other states.\n     - 30 minute intervals for 2016-2017.\n     - 30 minute intervals for 2014-2015.\n     - 14 apartments in Massachusetts for 2014-2015.\n\n2. Methodology-II:\n   - This section appears to be about the experimental design details, though the specific content is not clearly visible.\n\nThe slide also includes a small video thumbnail on the left side, showing a woman speaking. Her name is listed as \"Catherine Mullen\" from the University of California, Los Angeles.\n\nThe background of the slide features a cityscape with a blue sky, giving it a professional and modern look.\n\nOverall, this presentation seems to be discussing the potential of time series foundation models in improving predictive analytics for building systems, likely focusing on energy efficiency and smart building technologies."}, {"start": 330, "end": 360, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. The slide is titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of a session called \"Methodology-II.\"\n\nThe slide contains several key elements:\n\n1. A presenter's image in the top left corner, showing a woman speaking into a microphone.\n\n2. The title of the presentation in large white text at the top of the slide.\n\n3. A subtitle \"Methodology-II\" in a smaller font below the main title.\n\n4. A section titled \"Experimental Design details\" with a graph and some text.\n\n5. A list of presenters' names and affiliations:\n   - Cesar Barraza (University of California, Los Angeles)\n   - Kevin Wu (University of California, Los Angeles)\n   - Xianqiang Wang (University of California, Los Angeles)\n   - Xiangqian Wang (University of California, Los Angeles)\n\n6. A graph showing two lines with different sampling rates (12.5 Hz and 25 Hz) and a \"Best Fit Curve\" line.\n\n7. A note at the bottom of the slide indicating that statistical models were trained from scratch for each prediction.\n\nThe slide seems to be discussing the use of time series foundation models in predictive building analytics, specifically focusing on experimental design and methodology. The graph likely illustrates the results of their experiments with different sampling rates and the effectiveness of their models."}, {"start": 360, "end": 390, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Baru, a researcher from the University of California, Los Angeles.\n\nThe slide is divided into two main sections:\n\n1. Methodology:\n   - This section includes a graph showing \"Exponential Design details\" with labels for \"Context,\" \"Horizon,\" and \"Sampling.\"\n   - There's a mention of \"Statistical Models\" being trained from only the specific each prediction using \"Auto-ARIMA,\" \"Best Fit Curve,\" and \"Seasonal ARIMA.\"\n\n2. Results:\n   - A bar graph comparing \"UCI\" (presumably University of California, Irvine) with \"Best TSFM\" (Time Series Foundation Models).\n   - The graph shows different categories on the x-axis, with \"UCI\" and \"Best TSFM\" represented by red and blue bars respectively.\n\nThe background of the slide features a cityscape with a blue sky, adding a visual element to the presentation. The overall design is professional and informative, typical of academic conference presentations.\n\nThis slide seems to be discussing the potential of time series foundation models in improving predictive analytics for building systems, comparing their performance to traditional statistical models."}, {"start": 390, "end": 420, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. The slide is titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, with a co-presenter named Caren Mullen.\n\nThe slide contains a bar graph comparing the performance of two models: T5-FS and T5-FS. The graph shows that T5-FS has a higher UCI (presumably a performance metric) than T5-FS.\n\nThe slide also includes a list of institutions involved in the research:\n- University of California, Los Angeles\n- University of California, Los Angeles\n- University of California, Los Angeles\n- University of California, Los Angeles\n- University of California, Los Angeles\n\nThe background of the slide features a cityscape with a blue sky, and there's a small inset image of a woman speaking into a microphone.\n\nThe slide is part of a larger presentation, as indicated by the navigation buttons at the bottom of the slide: Introduction, Motivation, Review, Methodology, Results, and Future."}, {"start": 420, "end": 450, "narrative": "The video appears to be a presentation slide from a conference or seminar. The slide is titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of the SIGEnergy ACM BuildSys 2024 conference.\n\nThe slide features a woman presenting, with her image displayed in the top left corner. She's wearing a black jacket and has long dark hair. The background behind her is blue with a cityscape design.\n\nThe main content of the slide includes two graphs:\n\n1. The first graph is titled \"UCI\" and compares the performance of T5-FSFM models with other statistical models. It shows that T5-FSFM models generally outperform the others.\n\n2. The second graph is titled \"Smart\" and compares different models on an unseen dataset. It also shows that T5-FSFM models perform well.\n\nThe slide also includes logos for SIGEnergy and ACM BuildSys 2024 at the top, along with a navigation bar at the bottom that includes options for \"Introduction,\" \"Motivation,\" \"Review,\" \"Methodology,\" \"Results,\" and \"Future.\"\n\nThe overall design is professional and visually appealing, with a blue color scheme and a modern, tech-focused aesthetic. The presentation seems to be discussing the potential of T5-FSFM models in predictive building analytics, suggesting they may offer significant improvements over traditional statistical models."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caglar Baris, Cynthia Mullenweg, and Xiangyu Wang from the University of California, Los Angeles.\n\nThe slide is divided into two main sections:\n\n1. On the left side, there's a photo of a woman giving a presentation. She's wearing a black jacket and has long dark hair. The background behind her is blue with a cityscape image.\n\n2. On the right side, there are two graphs:\n\n   - The first graph is titled \"UCI\" and compares the performance of TSFM (Time Series Foundation Models) with other models. It shows that TSFM has a higher Mean R2 score than the best static model.\n\n   - The second graph is titled \"Smart\" and also compares TSFM with other models. It shows that TSFM has a higher Mean R2 score than the best static model.\n\nThe slide also includes a footer with the SIGEnergy logo and the ACM BuildSys 2024 conference information.\n\nThe overall design is professional and visually appealing, with a blue color scheme and a cityscape background that adds a modern, urban feel to the presentation."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of the ACM BuildSys 2024 conference.\n\nThe slide is divided into two main sections:\n\n1. On the left, there's a speaker's image with the text \"Cameron Bui (University of California, Los Angeles)\" and \"Catherine Mullen (University of California, Los Angeles)\".\n\n2. On the right, there's a graph titled \"Results - TSFM fails to generalize to an unseen modality (Tf, indoor temp.)\". The graph compares the performance of TSFM (Time Series Foundation Models) with best statistical models and the mean of all models.\n\nThe graph shows that TSFM performs worse than the best statistical models and the mean of all models in predicting indoor temperature.\n\nAt the bottom of the slide, there's a section labeled \"Future\" with a graph showing temperature over time. The graph has two sampling rates indicated: 48 hours and 12 hours.\n\nThe slide also includes logos for SIGEnergy and ACM BuildSys 2024, indicating the event and sponsors.\n\nOverall, the slide seems to be discussing the limitations of TSFM models in predictive building analytics and suggesting future research directions."}, {"start": 510, "end": 540, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is part of the ACM BuildSys 2024 conference.\n\nThe slide is divided into two main sections:\n\n1. On the left, there's a speaker's image with the name \"Cesar Barra\" and affiliation \"University of California, Los Angeles.\"\n\n2. On the right, there's a graph showing temperature fluctuations over time. The graph has a blue line representing temperature, with a green line indicating a 48-hour sampling rate and a red line showing a 12-hour sampling rate.\n\nThe slide also includes a question mark, suggesting an open-ended discussion or analysis about the topic.\n\nAt the bottom of the slide, there are navigation options for \"Introduction,\" \"Motivation,\" \"Review,\" \"Methodology,\" \"Results,\" and \"Future.\"\n\nThe background of the slide features a cityscape with a blue sky, giving it a professional and modern look.\n\nOverall, this slide seems to be part of a presentation exploring the potential of time series models in improving predictive analytics for building systems, specifically focusing on temperature data."}, {"start": 540, "end": 570, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Oscar Baro, Camille Moulin, and Xinchen Guo from the University of California, Los Angeles.\n\nThe slide has a blue background with a cityscape image at the bottom. The main content is divided into two sections:\n\n1. On the left, there's a graph showing temperature fluctuations over time. The x-axis represents time in hours, while the y-axis shows temperature. There are two green arrows pointing to specific time intervals: -48 hours and -12 hours.\n\n2. On the right side, there's a text box with the title \"Sampling Rate: 15 mins.\" Below that, it mentions \"This is the indoor temperature from Pittsburgh.\" There's also a cloud icon labeled \"Context\" and a question mark.\n\nThe slide seems to be discussing the potential of time series foundation models in improving predictive analytics for building systems, specifically focusing on indoor temperature data. The graph likely illustrates how these models could analyze temperature patterns over time to make more accurate predictions.\n\nThe presenters are shown in a small video feed on the left side of the slide, with Oscar Baro speaking. The slide also includes navigation options at the bottom for \"Introduction,\" \"Motivation,\" \"Review,\" \"Methodology,\" \"Results,\" and \"Future.\"\n\nOverall, this presentation appears to be exploring the latest advancements in using time series data for predictive building analytics, with a focus on improving indoor temperature control and management."}, {"start": 570, "end": 600, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, Cindy Mullen, and Vincent Wong from UCLA.\n\nThe slide has a blue background with a cityscape at the bottom. On the left side, there's a graph showing temperature fluctuations over time, with a green line indicating a 48-hour period and a red line showing a 12-hour period.\n\nThe main content of the slide focuses on the future of predictive building analytics. It mentions a community effort to develop 15 TFSMs (Time Series Foundation Models) with key features. These features include:\n\n1. Sampling Rate: 15 minutes\n2. Indoor temperature\n3. Context\n4. Task\n5. Indoor/outdoor temperature, solar gain\n6. New attributes\n\nThe slide also includes logos for SIGEnergy and ACM BuildSys 2024 at the top.\n\nAt the bottom of the slide, there's a QR code and a link to a GitHub page for TFSMs.\n\nThe presenters are shown in a small video window on the left side of the slide, with Caren Bar speaking."}, {"start": 600, "end": 630, "narrative": "The video appears to be a presentation slide from the ACM BuildSys 2024 conference. It's titled \"Are Time Series Foundation Models Ready to Revolutionize Predictive Building Analytics?\" and is presented by Caren Bar, Cynthia Mullen, and Vincent Ouyang.\n\nThe slide has a blue background with a cityscape image at the bottom. On the left side, there's a photo of a woman giving a presentation. The main content is divided into two sections:\n\n1. The title and presenter information at the top.\n2. A list of key features for developing TSFM (Time Series Foundation Models) on the right side.\n\nThe key features listed are:\n- Data Curation and Sharing\n- Architectural Innovation\n- Evaluation and Benchmarking\n- Resource Sharing and Training Techniques\n\nThere's also a QR code on the right side, likely for accessing more information or resources related to the presentation.\n\nThe slide seems to be discussing the potential of time series foundation models in predictive building analytics, focusing on key areas for their development and implementation."}, {"start": 630, "end": 660, "narrative": "The video showcases a professional conference setting for the ACM BuildSys 2024 event. The scene is set in a large conference room with a stage at the front, featuring a presenter giving a presentation. The stage is equipped with a podium and a large screen displaying the conference details and a graph.\n\nThe audience is seated in rows of chairs, attentively watching the presentation. The room is well-lit with overhead lighting, and the ceiling features a modern design with recessed lights.\n\nThe large screen behind the presenter displays the conference title \"ACM BuildSys 2024\" along with the dates \"November 4-8, 2024\" and the location \"Hangzhou, China.\" The screen also shows a graph with a line representing temperature over time, accompanied by a legend and some explanatory text.\n\nTo the right of the screen, there's a logo for Carnegie Mellon University, indicating their involvement in the conference. The overall atmosphere appears to be focused and professional, with attendees engaged in the presentation.\n\nThe video captures the essence of a high-level academic or industry conference, highlighting the importance of the ACM BuildSys 2024 event in the field of building systems and technologies."}, {"start": 660, "end": 690, "narrative": "The video showcases a large conference room hosting a professional event. The room is filled with attendees seated in rows of white chairs, facing a stage at the front. The stage features a podium and a large blue screen displaying a presentation slide with a graph and text.\n\nThe room has a sophisticated design with a high ceiling, recessed lighting, and a patterned carpet. There are two large screens on either side of the stage, also displaying the same presentation content.\n\nThe audience appears engaged, with many attendees taking notes or using laptops. The overall atmosphere suggests a formal business or academic conference, possibly related to finance or economics given the graph on the screen.\n\nThe video captures the scene from the back of the room, providing a comprehensive view of the entire space and the ongoing presentation."}, {"start": 690, "end": 720, "narrative": "The video showcases a large conference room filled with attendees. The room is spacious and well-lit, featuring a high ceiling with recessed lighting. The floor is covered with a patterned carpet, and the walls are adorned with decorative elements.\n\nAt the front of the room, there's a stage with a podium and a large screen displaying a presentation. The screen shows a graph and some text, though the specific details are not clear. The presentation appears to be related to \"Future of Buildings 2022\" and \"JACM 2022\".\n\nThe audience is seated in rows of chairs, facing the stage. Many attendees have laptops open in front of them, suggesting this is a professional or academic event. The room is filled with people, indicating a well-attended conference.\n\nThe overall atmosphere appears formal and professional, with attendees focused on the presentation. The setting suggests this is a significant event, likely related to architecture, construction, or urban planning given the \"Future of Buildings\" theme.\n\nThe video captures the essence of a modern conference environment, highlighting the importance of such events in the professional world."}, {"start": 720, "end": 750, "narrative": "The video showcases a large conference room filled with attendees. The room is spacious and well-lit, featuring a high ceiling with recessed lighting. The floor is covered with a patterned carpet, and the walls are adorned with decorative elements.\n\nIn the center of the room, there's a stage with a podium and a large screen displaying a presentation. The screen shows a graph and some text, though the specific details are not clear. The stage is flanked by two large blue banners with white text, though the exact wording isn't visible.\n\nThe audience is seated in rows of chairs, facing the stage. Many attendees have laptops open in front of them, suggesting this is a professional or academic event. The room is filled with people, indicating a well-attended conference or seminar.\n\nThe overall atmosphere appears formal and professional, with attendees focused on the presentation. The setting suggests this could be a business conference, academic lecture, or industry event.\n\nThe video captures the essence of a large-scale professional gathering, highlighting the importance of such events in knowledge sharing and networking within various industries or academic fields."}, {"start": 750, "end": 780, "narrative": "The video showcases a large conference room hosting a professional event. The room is filled with attendees seated in rows of chairs, facing a stage at the front. The stage features a large blue screen displaying various presentations, including graphs and charts. There are also two smaller screens on either side of the main screen.\n\nThe room has a sophisticated design with a high ceiling and blue lighting. The floor is covered with a patterned carpet, and there are tables with water bottles and cups in front of the chairs.\n\nThroughout the video, we see different presenters on stage, some standing and others seated at a table. The audience appears engaged, with many attendees taking notes.\n\nThe event seems to be a business or academic conference, possibly related to finance or data analysis given the visual content on the screens. The atmosphere is professional and focused, with attendees dressed in business casual attire.\n\nThe video captures the dynamic nature of the event, showing different moments of presentations and audience engagement. It provides a comprehensive view of the conference setup and the activities taking place."}, {"start": 780, "end": 810, "narrative": "The video showcases a large conference room filled with attendees seated in rows of chairs. The room has a high ceiling with recessed lighting, creating a bright and professional atmosphere. The walls are adorned with decorative panels, adding a touch of elegance to the space.\n\nIn the center of the room, there's a stage with a podium, where a speaker is likely addressing the audience. Behind the stage, a large blue screen dominates the back wall, displaying colorful graphs and charts. The screen is divided into two sections, with the left side showing a bar graph and the right side displaying a line graph. The graphs appear to be related to some form of data analysis or presentation.\n\nThe audience is diverse, with people of various ages and ethnicities. Many attendees are wearing business casual attire, while some are dressed more formally in suits. The room is well-organized, with chairs neatly arranged in rows and tables placed between them.\n\nThe overall setting suggests this is a professional conference or seminar, possibly related to business, finance, or data analysis. The presence of the large screen with detailed graphs indicates that the event is focused on presenting and discussing complex data or information.\n\nThe video captures the essence of a formal, professional gathering where important information is being shared and discussed among a diverse group of attendees."}, {"start": 810, "end": 840, "narrative": "The video showcases a professional conference or seminar taking place in a large, well-lit room. The setting appears to be a hotel or conference center, with a spacious layout featuring a stage at the front and rows of chairs arranged for attendees.\n\nThe stage is equipped with a podium and a large screen displaying various presentations. The screen shows different slides, including graphs, charts, and diagrams, suggesting a technical or business-oriented event. The presentations seem to be related to topics like \"ACM 2024\" and \"ACM 2024 Buildings,\" indicating it might be an architecture or construction industry conference.\n\nThe room is filled with people, some seated and others standing, all focused on the presentations. The attendees are dressed in business casual attire, with many wearing blue shirts. The atmosphere appears to be serious and attentive, typical of a professional conference setting.\n\nThe lighting is bright and even, with a mix of overhead lights and spotlights on the stage. The ceiling is high, giving the room an airy feel, and there are decorative elements like paintings on the walls.\n\nOverall, the video captures the essence of a high-level professional gathering, likely focused on architectural or construction industry developments and trends."}, {"start": 840, "end": 870, "narrative": "The video showcases a large conference room hosting a professional event. The room is filled with attendees seated in rows of chairs, facing a stage at the front. The stage features a podium where a speaker is likely addressing the audience.\n\nBehind the speaker, there's a large blue screen displaying a presentation. The presentation includes a bar graph and some text, though the specific details are not clear. The screen also has logos for \"ACM\" and \"ACM BuildSys 2024\" visible.\n\nThe room has a sophisticated design with a high ceiling and recessed lighting. The walls are adorned with artwork, and there are speakers mounted on the sides of the stage. The overall atmosphere suggests a formal academic or industry conference.\n\nThe video appears to be a time-lapse or series of still images, capturing the same scene multiple times. This creates a sense of continuity and emphasizes the scale of the event.\n\nThe attendees seem engaged, with many looking towards the stage. The room is well-lit, creating a professional and focused environment for the conference.\n\nThis setting is typical for events like ACM BuildSys, which is likely a conference focused on building systems or related technologies. The presence of the bar graph suggests data analysis or research presentations are part of the agenda."}, {"start": 870, "end": 900, "narrative": "The video showcases a large conference room with a sophisticated setup for a presentation or lecture. The room features a spacious layout with rows of white chairs arranged in neat rows, creating a professional and organized atmosphere.\n\nThe focal point of the room is a large blue screen at the front, displaying colorful graphs and charts. This screen is flanked by two smaller screens on either side, also showing similar data visualizations. The presentation appears to be about \"ACM 2023\" and includes various graphs with bars and lines, likely representing statistical data or trends.\n\nThe room is well-lit with a combination of overhead lighting and spotlights, enhancing the visibility of the presentation. The ceiling is adorned with decorative elements, adding a touch of elegance to the space.\n\nOn the left side of the room, there's a speaker's podium with a microphone, indicating that a presentation is in progress or about to begin. The audience consists of numerous attendees, all facing the screen, suggesting an engaged and attentive group.\n\nThe overall ambiance of the room is professional and formal, typical of a high-level conference or academic event. The combination of the large screen, professional seating arrangement, and the presence of a speaker's podium creates an environment conducive to serious discussions and presentations."}, {"start": 900, "end": 930, "narrative": "The video showcases a large conference room hosting a professional event. The room is filled with attendees seated in rows of white chairs, facing a stage at the front. The stage features a podium with a blue lectern, where a speaker is likely addressing the audience.\n\nBehind the stage, there's a massive blue screen displaying various charts and graphs. The screen is divided into two sections, with the left side showing a bar graph and the right side displaying a line graph. The graphs appear to be related to some form of data analysis or financial information.\n\nThe room has a sophisticated design with a high ceiling and recessed lighting. The walls are adorned with artwork, adding to the professional atmosphere. The overall setting suggests this is a high-level business or academic conference, possibly related to finance, economics, or data analysis.\n\nThe video captures the event from multiple angles, providing a comprehensive view of the room and the ongoing presentation. The attendees seem engaged, indicating the topic is of significant interest to the audience.\n\nThis conference room setup is typical for major industry events, academic conferences, or corporate meetings where important data and insights are being shared with a large audience."}, {"start": 930, "end": 960, "narrative": "The video shows a large conference room with a stage at the front. The stage features a podium and a large screen displaying a presentation. The presentation appears to be about \"ACM Build 2022\" and includes a list of topics or agenda items.\n\nThe room is filled with rows of chairs, most of which are occupied by attendees. The audience is diverse, with people of various ages and ethnicities. Many attendees are wearing lanyards, suggesting this is a formal event.\n\nThe room has a modern design with a blue carpet and white ceiling. There are also some decorative elements visible, including a floral pattern on the carpet and a large painting on the wall to the left of the stage.\n\nThe lighting is bright, creating a professional atmosphere for the conference. The overall setting appears to be a high-end hotel or convention center, suitable for hosting a significant industry event like ACM Build 2022.\n\nThe video captures the essence of a professional conference, with the focus on the stage and the presentation being delivered. It gives a sense of the scale and importance of the event, as well as the engaged audience present to hear the speaker."}]