[{"start": 0, "end": 30, "narrative": "The video appears to be a presentation slide about privacy issues related to behavioral user profiling through mouse tracking. The slide is titled \"My Mouse, My Rules\" and discusses privacy concerns associated with this type of tracking.\n\nThe slide features logos for several institutions, including:\n\n1. mi.Lu (Université du Luxembourg)\n2. Telefonica\n3. Cyprus University of Technology\n\nThe main content of the slide is focused on the privacy implications of mouse tracking for behavioral user profiling. This suggests that the presentation is likely part of a research or academic discussion on the topic.\n\nAt the bottom of the slide, there's a graphic that reads \"Privacy is a rare commodity,\" emphasizing the central theme of the presentation.\n\nThe slide seems to be part of a larger discussion on privacy in the digital age, specifically addressing how mouse movements can be used to profile users and the potential privacy risks associated with this type of data collection."}, {"start": 30, "end": 60, "narrative": "The video appears to be a promotional or educational clip about privacy and data protection. It features a split-screen design with two main sections:\n\nOn the left side, there's an illustration of a woman walking towards a credit card with a lock symbol on it. This likely represents financial privacy or secure transactions.\n\nOn the right side, there's an image of a laptop with a large eye on the screen, symbolizing digital surveillance or online privacy concerns.\n\nAt the bottom of the screen, there's a bold statement in red text that reads \"PRIVACY IS A RARE COMMODITY,\" emphasizing the scarcity and importance of privacy in today's digital world.\n\nThe video seems to be discussing various privacy-related topics, including:\n\n1. Ad blocking and user privacy extensions\n2. GDPR (General Data Protection Regulation)\n3. ePrivacy\n4. Consumer Privacy Act\n5. AdChoices\n\nThe phrase \"TRAGEDY OF THE COMMONS\" is also visible, which is a concept in economics and environmental science that refers to the depletion of shared resources when individuals act in their own self-interest.\n\nOverall, the video appears to be raising awareness about the challenges and importance of privacy in the digital age, highlighting various measures and regulations aimed at protecting personal data and online privacy."}, {"start": 60, "end": 90, "narrative": "The video appears to be a presentation slide discussing privacy concerns related to mouse tracking technology (MT). The slide is titled \"The Dangers of Unregulated MT\" and contains two main points:\n\n1. Mouse cursor tracking is used for various purposes, including:\n   - Informing ability tests\n   - Predicting user engagement\n   - Measuring visual attention\n   - Detecting search frustration\n\n2. This technology can also be used to profile user demographics, such as age and gender.\n\nThe slide emphasizes that these practices are often justified by seemingly positive objectives, like providing detailed analytics to website owners. However, the underlying purpose of tracking user behavior and demographics is highlighted as a potential privacy concern.\n\nThe slide has a black background with white text, and the title is in red. There's also a graphic of people holding blue shields in the bottom right corner, which might be related to privacy protection.\n\nOverall, the slide seems to be part of a larger discussion about the ethical implications of using mouse tracking technology without proper regulation, particularly in terms of user privacy and data collection."}, {"start": 90, "end": 120, "narrative": "The video displays a slide titled \"The Dangers of Unregulated MT\" with a white background and black text. The slide appears to be discussing the potential risks associated with unregulated mouse tracking technology (MT).\n\nThe main points presented on the slide are:\n\n1. Mouse cursor tracking can be used for usability tests, predicting user engagement, visual attention, and detecting searcher frustration.\n\n2. It's also possible to profile user demographics like age and gender.\n\n3. The purpose of this technology is often disguised behind seemingly positive objectives, such as providing fine-grained, in-page analytics to website owners.\n\nThe slide seems to be warning about the potential for invasive data collection and profiling that could occur with unregulated use of mouse tracking technology. It highlights how these practices might be justified under the guise of improving user experience or providing detailed analytics, but could actually lead to significant privacy concerns and potential misuse of personal data."}, {"start": 120, "end": 150, "narrative": "The video appears to be a presentation slide discussing the dangers of unregulated mouse tracking (MT) technology. The slide is titled \"The Dangers of Unregulated MT\" and contains two main bullet points:\n\n1. Mouse cursor tracking to inform ability tests, predict user engagement, visual attention, and detect searcher frustration.\n\n2. Also possible to profile user demographics like age and gender attributes.\n\nThe slide emphasizes that these practices are often hidden behind seemingly positive objectives, such as providing fine-grained, in-page analytics to website owners.\n\nAt the bottom of the slide, there's a section titled \"Research Objectives\" which states:\n\n\"This work aims at raising awareness on the emerging privacy threats in the online world and exposes some of the unaccounted - yet sizeable risks - of tracking technologies.\n\nWe want to show how straightforward it is to capture behavioral data and predict demographics information with reasonable accuracy using a few lines of code.\"\n\nThe slide is presented against a white background with black text, and the title and research objectives are highlighted in red. The overall tone of the presentation seems to be focused on privacy concerns and the potential misuse of tracking technologies on websites."}, {"start": 150, "end": 180, "narrative": "The video displays a slide with the title \"Research Objectives\" in bold red text. Below the title, there are two bullet points:\n\n1. \"This work aims at raising awareness on the emerging privacy threats in the online world and exposes some of the unaccounted - yet sizeable risks - of tracking technologies\"\n\n2. \"We want to show how straightforward it is to capture behavioral data and predict demographics information with reasonable accuracy using a few lines of code\"\n\nThe slide appears to be part of a presentation, likely discussing privacy concerns in the digital realm and the ease with which personal data can be collected and analyzed. The text is presented in a clear, easy-to-read format, with the bullet points in black text on a white background. The slide seems to be designed to convey important information about online privacy risks and the potential for data collection and analysis."}, {"start": 180, "end": 210, "narrative": "The video displays a slide from a presentation, focusing on the \"Experimental Design\" section. The slide has a clean, professional layout with a white background and black text. The title \"Experimental Design\" is prominently displayed at the top in bold black letters.\n\nThe main content of the slide is divided into two bullet points:\n\n1. \"Brief transactional search task where participants were presented with a predefined search query and the corresponding SERP, and were asked to click on any element of the page that answered it best\"\n\n2. \"The search task consisted of three parts:\n   - pre-task guidelines\n   - the web search task\n   - a post-task questionnaire\"\n\nAt the bottom of the slide, there's a note in a smaller font that reads: \"Each participant was allowed to perform the search task only once\"\n\nThe slide appears to be part of a larger presentation, likely discussing research methods or experimental procedures in the context of web search tasks. The design is simple and straightforward, focusing on delivering the key information about the experimental setup."}, {"start": 210, "end": 240, "narrative": "The video displays a slide from a presentation about an experimental design for a search task. The slide is titled \"Experimental Design\" and provides details about the study's methodology.\n\nThe main content of the slide explains that participants were given a predefined search query and asked to click on any element of the search results page (SERP) that best answered the query. The search task was divided into three parts:\n\n1. Pre-task guidelines\n2. The web search task\n3. Post-task questionnaire\n\nEach participant was allowed to perform the search task only once.\n\nThe slide also includes a screenshot of a Google search results page. The search query shown is \"buy noun\" (with \"noun\" being a placeholder for an actual word). The task instructions are visible on the left side of the screen, asking participants to browse the search results and click on the element they would normally select under this scenario.\n\nThe SERP displays various search results, including images and text links. A red arrow points to a specific result, likely indicating the correct answer or the element participants were supposed to click on.\n\nThis experimental design appears to be focused on understanding how users interact with search results pages and make decisions about which elements to click on when searching for specific types of information."}, {"start": 240, "end": 270, "narrative": "The video appears to be a presentation slide from a research study. It's divided into two main sections:\n\nOn the left side, there's a screenshot of a Google search results page. The search query is \"You want to buy noun (for you or someone else as a gift) and you have submitted the search query noun-to Google Search. Please browse the search results page and click on the element that you would normally select under this scenario.\"\n\nOn the right side, there's a screenshot of a webpage with a red line drawn across it. This line seems to be highlighting a specific element on the page.\n\nAt the bottom of the slide, there's a section titled \"Experimental Design\" with bullet points. It mentions using EvTrack, an open-source JavaScript library for event tracking. The study collected data from 3,206 participants aged 18-66, and collected questionnaire data at post-task about users' gender, age group, and native language.\n\nThe slide seems to be discussing an experiment related to user behavior on Google search results pages, possibly focusing on how users interact with search results when looking for gift ideas."}, {"start": 270, "end": 300, "narrative": "The video displays a slide from a presentation, focusing on the experimental design of a study. The slide is titled \"Experimental Design\" and contains two main sections of information.\n\nThe first section explains the data collection process:\n- They used EvTrack, an open-source JavaScript library for event tracking.\n- Data was collected from 3,206 participants aged 18-66.\n- Post-task questionnaires were administered to gather information about:\n  - Users' gender\n  - Age group\n  - Native language\n\nThe second section provides details about the data analysis:\n- After excluding logs with no demographic information and those with fewer than 10 mouse cursor data points (less than 2% of interaction data), they concluded with 1,467 search sessions.\n- The average mouse cursor trajectory length was 25.2 (x,y) coordinates.\n- The dataset was divided into a 90:10 training-test split.\n\nThe slide appears to be part of a research presentation, likely discussing a study on user behavior or interaction with a website or application. The use of EvTrack suggests they were tracking user interactions, possibly for usability testing or behavioral research.\n\nThe slide is presented in a professional, academic style, with a white background and black text. It's a typical format for research presentations, providing key details about the study's methodology and data analysis."}, {"start": 300, "end": 330, "narrative": "The video appears to be a presentation slide from a machine learning project. It's divided into two main sections: \"Experimental Design\" and \"Machine Learning Models.\"\n\nThe \"Experimental Design\" section provides information about the dataset used in the study. It mentions that after excluding logs with no demographic information and few mouse cursor data (less than 10 mouse coordinates, which is 2% of interaction data), they concluded to 1,467 search sessions. The average mouse cursor trajectory length was 25.2 (x,y) coordinates. The dataset was divided into a 90:10 training-test split.\n\nThe \"Machine Learning Models\" section shows two types of models: Random Forest and SimpleNN (Neural Network). The Random Forest model is represented by a diagram with multiple decision trees, while the SimpleNN model is depicted with a series of interconnected nodes and layers.\n\nThe slide is presented in a clean, professional format with a white background and black text. The diagrams are simple and easy to understand, providing a clear overview of the machine learning models used in the project.\n\nOverall, this slide appears to be part of a larger presentation, likely for a research paper or academic talk, detailing the methodology and models used in a machine learning study related to search session analysis."}, {"start": 330, "end": 360, "narrative": "The video provides an overview of two main types of machine learning models: Random Forest and Simple RNN (Recurrent Neural Network).\n\nOn the left side of the screen, we see a diagram of a Random Forest model. This model is composed of multiple decision trees, each with its own set of features and decision points. The trees are arranged in a forest-like structure, with each tree contributing to the final prediction. The diagram shows how data flows through the trees, with each tree making a decision based on its unique set of features.\n\nOn the right side, we see a diagram of a Simple RNN model. This model is designed to process sequential data, such as time series or natural language. The diagram illustrates how the model processes data over time, with each time step influencing the next. The RNN includes LSTM (Long Short-Term Memory), BLSTM (Bidirectional LSTM), and GRU (Gated Recurrent Unit) components, which help the model maintain long-term dependencies in the data.\n\nThe video appears to be part of a larger presentation or lecture on machine learning, providing a visual explanation of these two important model types."}, {"start": 360, "end": 390, "narrative": "The video provides an overview of two main types of machine learning models: Random Forest and Simple RNN (Recurrent Neural Network).\n\nOn the left side of the screen, we see a diagram of a Random Forest model. This model is composed of multiple decision trees, each with its own set of features and decision points. The trees are interconnected, with the output of one tree serving as input for the next. At the bottom, there's a final decision layer that combines the results from all the trees to make a final prediction.\n\nOn the right side, we have a diagram of a Simple RNN model. This model is designed to process sequential data over time. It consists of a series of nodes connected in a chain-like structure. Each node takes in an input, processes it, and passes the output to the next node. The model also includes a feedback loop, allowing information to be passed back to previous nodes. The diagram shows how the model processes data over time, with the \"Time\" axis at the bottom.\n\nThe video appears to be part of a larger presentation or lecture on machine learning, providing a visual explanation of these two important model types."}, {"start": 390, "end": 420, "narrative": "The video appears to be a presentation slide about machine learning models. It's divided into two main sections:\n\n1. Random Forest:\n   - This section shows a diagram of a random forest model. It consists of multiple decision trees, each with different features and thresholds. The trees are interconnected, with some branches leading to different outcomes.\n\n2. Simple RNN, LSTM, BLSTM, GRU:\n   - This part of the slide illustrates a sequence model. It shows a series of nodes connected by arrows, representing the flow of information over time. The nodes are labeled with \"x\" and \"y\" values, indicating input and output sequences.\n\nThe slide is titled \"Machine Learning Models\" and has a white background with black text. The diagrams are in black and white, with some elements highlighted in blue.\n\nAt the bottom of the slide, there's a section labeled \"BiGRU Architecture\" with bullet points describing the architecture of a bidirectional gated recurrent unit model. This section includes details about the input, output, and training parameters of the BiGRU model.\n\nOverall, the slide provides a visual overview of two different types of machine learning models: a random forest for classification tasks and a sequence model for processing time-series data. The BiGRU architecture section at the bottom offers more specific information about a particular type of recurrent neural network."}, {"start": 420, "end": 450, "narrative": "The video displays a slide titled \"BiGRU Architecture\" with a white background and black text. The slide provides a detailed explanation of a specific neural network architecture used for processing sequential data.\n\nThe architecture is described as follows:\n\n1. Input: Raw sequences of (x,y)timestamp coordinates\n\n2. Output: Gender and age likelihood (male/female, young/adult)\n\n3. Sequence padding/truncating to 100 time steps\n\n4. Adam optimizer with learning rate (η) = 0.0005\n\n5. Batch size: 32, 400 epochs with early stopping after 40 epochs\n\nThe slide is presented in a clear, professional format, making it easy to understand the key components of the BiGRU (Bidirectional Gated Recurrent Unit) architecture being discussed."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation slide about a BiGRU (Bidirectional Gated Recurrent Unit) architecture used for user profiling experiments. The slide is divided into two main sections:\n\n1. BiGRU Architecture:\n   - This section outlines the structure of the BiGRU model.\n   - It includes an input layer, a BiGRU layer with 64 units, and a dropout layer with a rate of 0.25.\n   - The input is described as raw sequences of (x,y)timestamp coordinates.\n   - The output is gender and age likelihood (male/female, young/adult).\n   - Sequence padding/truncating is set to 100 time steps.\n   - The Adam optimizer is used with a learning rate of 0.0005.\n   - The batch size is 32, and the model is trained for 400 epochs with early stopping after 40 epochs.\n\n2. User Profiling Experiments:\n   - This section discusses the experiments conducted using the BiGRU model.\n   - It mentions age classification, linking age with motor control and pointing performance.\n   - Gender classification is also mentioned, noting sensory-motor differences due to gender.\n   - Baseline models are mentioned, including RF (Random Forest) and ZeroR classifier.\n\nThe slide is presented in a clean, professional format with a white background and black text. The information is organized clearly, making it easy to understand the key points of the BiGRU architecture and the user profiling experiments conducted."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation slide about user profiling experiments. It's divided into two main sections:\n\n1. User Profiling Experiments:\n   - Age Classification: The slide mentions that prior work has linked age with motor control and pointing performance.\n   - Gender Classification: It notes that prior research has identified sensory-motor differences due to gender.\n   - Baseline models: The slide lists RF (Random Forest) and ZeroR classifier as baseline models.\n\n2. Age Classification:\n   - This section seems to be a visual representation of age classification results, though the specific details are not clear from the image.\n\nThe slide has a clean, professional design with a white background and black text. The content is organized in a clear, bullet-point format, making it easy to understand the key points being presented.\n\nThe video appears to be part of a larger presentation on user profiling, focusing on how age and gender can be classified based on motor control and pointing performance. It seems to be discussing the use of machine learning models, particularly Random Forest and ZeroR classifiers, to analyze these factors."}, {"start": 510, "end": 540, "narrative": "The video displays a slide titled \"Age Classification\" with a white background and a gray gradient on the right side. The slide is divided into two main sections, each containing two bar graphs.\n\nThe first section on the left shows two bar graphs:\n1. The first graph is labeled \"Adj. Precision\" and has a y-axis ranging from 0.2 to 0.8.\n2. The second graph is labeled \"Adj. Recall\" and also has a y-axis ranging from 0.2 to 0.8.\n\nThe second section on the right shows two more bar graphs:\n1. The first graph is labeled \"ROC AUC\" and has a y-axis ranging from 0.2 to 0.8.\n2. The second graph is labeled \"Adj. F1\" and also has a y-axis ranging from 0.2 to 0.8.\n\nEach graph contains three bars representing different models:\n- ZeroR\n- RF (Random Forest)\n- BIGRU (Bidirectional Gated Recurrent Unit)\n\nThe bars are color-coded:\n- ZeroR: Blue\n- RF: Green\n- BIGRU: Red\n\nThe slide appears to be comparing the performance of these three models across different metrics for age classification. The graphs show varying heights for each model, indicating different levels of performance in each metric.\n\nThe slide is likely part of a presentation or research paper discussing the effectiveness of these models in age classification tasks."}, {"start": 540, "end": 570, "narrative": "The video displays a slide titled \"Age Classification\" with a white background and black text. The slide is divided into two main sections, each containing two bar graphs.\n\nThe left section is labeled \"Age Classification\" and shows two bar graphs:\n1. The first graph is titled \"Adj. Precision\" and has a y-axis ranging from 0.2 to 0.8.\n2. The second graph is titled \"Adj. Recall\" and also has a y-axis ranging from 0.2 to 0.8.\n\nThe right section is labeled \"Age Classification\" and shows two more bar graphs:\n1. The first graph is titled \"Adj. Precision\" and has a y-axis ranging from 0.2 to 0.8.\n2. The second graph is titled \"Adj. Recall\" and also has a y-axis ranging from 0.2 to 0.8.\n\nEach bar graph contains three bars:\n- A blue bar labeled \"ZeroR\"\n- A red bar labeled \"RF\"\n- A green bar labeled \"BiGRU\"\n\nThe slide appears to be comparing the performance of three different models (ZeroR, RF, and BiGRU) in terms of adjusted precision and adjusted recall for age classification. The graphs show that the BiGRU model consistently performs better than the other two models across both metrics.\n\nThe slide is presented in a professional, academic style, likely from a research presentation or conference. The consistent use of color coding and clear labeling makes it easy to compare the performance of the different models at a glance."}, {"start": 570, "end": 600, "narrative": "The video displays a slide presentation focused on gender classification. The slide is divided into two main sections: \"Age Classification\" and \"Gender Classification.\" Each section contains two bar graphs comparing different classification methods.\n\nThe \"Age Classification\" section shows two bar graphs:\n1. The first graph compares \"Zero\" and \"RF BIGRU\" methods for age classification.\n2. The second graph compares \"Zero\" and \"RF BIGRU\" methods for age classification, with a focus on \"ROC AUC.\"\n\nThe \"Gender Classification\" section also contains two bar graphs:\n1. The first graph compares \"Zero\" and \"RF BIGRU\" methods for gender classification.\n2. The second graph compares \"Zero\" and \"RF BIGRU\" methods for gender classification, with a focus on \"ROC AUC.\"\n\nEach bar graph has three bars representing different metrics:\n- The first bar represents \"Adj. Precision.\"\n- The second bar represents \"Adj. Recall.\"\n- The third bar represents \"ROC AUC.\"\n\nThe bars are color-coded:\n- Blue bars represent the \"Zero\" method.\n- Green bars represent the \"RF BIGRU\" method.\n\nThe slide appears to be part of a larger presentation, likely discussing the performance of these classification methods in terms of precision, recall, and ROC AUC for both age and gender classification tasks."}, {"start": 600, "end": 630, "narrative": "The video displays a slide titled \"Gender Classification\" with a white background and black text. The slide is divided into two main sections:\n\n1. The top section contains the title \"Gender Classification\" in bold black text.\n\n2. The bottom section is divided into four quadrants, each containing a bar graph. These graphs appear to be comparing different models or methods for gender classification.\n\nEach quadrant contains:\n- A title indicating the type of classification being measured (e.g., \"Gender classification\")\n- A y-axis labeled \"Precision\" with values ranging from 0.0 to 0.8\n- A x-axis labeled \"Recall\" with values ranging from 0.0 to 0.8\n- Two sets of bars representing different models or methods:\n  - A blue bar labeled \"Zero\"\n  - A green bar labeled \"RF BIGRU\"\n\nThe graphs seem to be comparing the performance of these two models across different metrics. The blue bars (Zero) consistently appear to have higher precision and recall values than the green bars (RF BIGRU) in all four quadrants.\n\nThe slide appears to be part of a presentation, likely discussing the effectiveness of different machine learning models for gender classification tasks."}, {"start": 630, "end": 660, "narrative": "The video appears to be a presentation slide about gender classification and profiling prevention. It's divided into two main sections:\n\n1. Gender Classification:\n   - This section shows a bar chart comparing different models for gender classification. The models include ZeroR, RF (Random Forest), and BIGRU (Bidirectional Gated Recurrent Unit).\n   - The chart displays metrics such as Accuracy, Precision, Recall, F1 Score, and ROC AUC for each model.\n\n2. Profiling Prevention: Adversarial Noise:\n   - This section illustrates a concept related to adversarial noise in profiling prevention.\n   - It shows a line graph with two curves labeled \"Original\" and \"Distorted.\"\n   - The graph is accompanied by mathematical notation, including e_t ~ N(0,σ) and σ ~ U(0,1).\n\nThe slide seems to be part of a larger presentation on machine learning models, specifically focusing on gender classification and techniques to prevent profiling through adversarial noise."}, {"start": 660, "end": 690, "narrative": "The video displays a slide titled \"Profiling Prevention: Adversarial Noise.\" The slide is divided into two main sections:\n\n1. On the left side, there's a line graph labeled \"Original.\" This graph shows a series of peaks and valleys, representing some form of data or signal.\n\n2. On the right side, there's a cluster of circles labeled \"Distorted.\" These circles are connected by lines, suggesting a network or graph structure.\n\nThe slide also includes mathematical notation:\n- \"e_t ~ N(0, σ)\" which likely refers to a normal distribution with mean 0 and standard deviation σ.\n- \"σ ~ U(0, 1)\" which indicates that σ is uniformly distributed between 0 and 1.\n\nThe slide appears to be discussing how adversarial noise can distort original data or signals, potentially for the purpose of preventing profiling. The combination of the line graph and the network of circles suggests a comparison between an original signal and its distorted version, possibly to illustrate the effects of adversarial noise on data integrity or security."}, {"start": 690, "end": 720, "narrative": "The video appears to be a presentation slide about \"Profiling Prevention: Adversarial Noise.\" It's divided into two main sections:\n\n1. The top section shows a graph comparing \"Original\" data points to \"Distorted\" data points. The original data is represented by a line graph, while the distorted data is shown as circular points. There are mathematical notations related to noise distributions (e_t ~ N(0, σ) and σ ~ U(0, 1)).\n\n2. The bottom section presents a table titled \"Profiling Prevention\" with columns for \"Demographics,\" \"Adj. Precision,\" \"Adj. Recall,\" \"Adj. F-measure,\" and \"ROC AUC.\" It includes data for \"Age\" and \"Gender\" demographics.\n\nThe slide seems to be discussing methods for preventing profiling through the use of adversarial noise, likely in the context of machine learning or data analysis."}, {"start": 720, "end": 750, "narrative": "The video displays a slide titled \"Profiling Prevention\" with a white background and black text. The slide contains a graph and a table, both of which are related to demographic profiling.\n\nThe graph is divided into two sections: \"Age\" and \"Gender.\" Each section shows a line graph with three lines representing different metrics:\n\n1. Red line: Precision\n2. Blue line: Recall\n3. Green line: F-Measure\n\nThe x-axis of the graph is labeled \"Noise (σ)\" and ranges from 0 to 1. The y-axis is labeled \"Adj. Recall\" and ranges from 0 to 1.\n\nBelow the graph, there's a table with four columns:\n\n1. Demographics\n2. Adj. Precision\n3. Adj. Recall\n4. Adj. F-Measure\n5. ROC AUC\n\nThe table lists \"Age\" and \"Gender\" as demographics, with corresponding values for each metric.\n\nThe slide appears to be part of a presentation on preventing demographic profiling, likely in the context of machine learning or data analysis. The graph and table provide visual and numerical representations of how different levels of noise affect the accuracy and fairness of demographic profiling models."}, {"start": 750, "end": 780, "narrative": "The video appears to be a presentation slide discussing profiling prevention. It's divided into two main sections:\n\n1. A graph comparing \"Age\" and \"Gender\" profiling prevention metrics.\n\n2. A table summarizing demographic data and performance metrics.\n\nThe graph shows three lines representing different metrics:\n- Red line: Adj. Precision\n- Blue line: Adj. Recall\n- Green line: Adj. F-Measure\n\nThe x-axis of the graph is labeled \"Noise (σ)\" and ranges from 0.025 to 0.5. The y-axis is labeled \"ROC AUC\" and ranges from 0.5 to 0.8.\n\nThe table below the graph provides specific values for:\n- Adj. Precision\n- Adj. Recall\n- Adj. F-Measure\n- ROC AUC\n\nFor \"Age\" profiling:\n- Adj. Precision: 0.6831\n- Adj. Recall: 0.5966\n- Adj. F-Measure: 0.5333\n- ROC AUC: 0.6074\n\nFor \"Gender\" profiling:\n- Adj. Precision: 0.6429\n- Adj. Recall: 0.5643\n- Adj. F-Measure: 0.5363\n- ROC AUC: 0.6038\n\nThe slide also includes a section titled \"Implications and Outlook\" at the bottom, but the text is not fully visible in the image.\n\nThis presentation seems to be analyzing the effectiveness of different profiling prevention methods, likely in the context of machine learning or data privacy."}, {"start": 780, "end": 810, "narrative": "The video displays a slide titled \"Implications and Outlook\" with a white background and black text. The slide contains three bullet points:\n\n1. \"Advertising is the main business model of 'free' content and services on the Web - though if something is free it usually means that the user is the product\"\n\n2. \"Our analysis demonstrates that through a very simple ML implementation we can infer people's gender or age\"\n\n3. \"Being a low-cost and reasonable proxy of visual attention, it cannot be discounted from being a modern Trojan horse (if users do not give informed consent)\"\n\nThe text is presented in a clear, readable font. The slide appears to be part of a presentation discussing the implications of free content on the internet, particularly in relation to user data and privacy concerns."}, {"start": 810, "end": 840, "narrative": "The video appears to be a presentation slide discussing the implications and outlook of a machine learning model. The slide is titled \"Implications and Outlook\" and contains three bullet points:\n\n1. \"Advertising is the main business model of 'free' content and services on the Web - though if something is free it usually means that the user is the product\"\n\n2. \"Our analysis demonstrates that through a very simple ML implementation we can infer people's gender or age\"\n\n3. \"Being a low-cost and reasonable proxy of visual attention, it cannot be discounted from being a modern Trojan horse (if users do not give informed consent)\"\n\nThe slide emphasizes the potential privacy concerns and ethical implications of using machine learning for user profiling and attention tracking.\n\nAt the bottom of the slide, there's a section titled \"Five Lines of Code is all it Takes,\" which shows a code snippet. The code appears to be written in Python and is related to building a machine learning model. It includes lines for creating a sequential model, adding layers, and compiling the model with specific parameters.\n\nThe slide seems to be part of a larger discussion about the ethical considerations of machine learning applications, particularly in the context of user data and privacy."}, {"start": 840, "end": 870, "narrative": "The video appears to be a presentation slide discussing privacy threats in the online world. It's divided into two main sections:\n\n1. \"Five Lines of Code is all it Takes\" - This section shows a code snippet for a neural network model. The model is defined using the Keras library and includes layers like Bidirectional GRU, Dropout, and Dense. It's compiled with binary crossentropy loss and Adam optimizer.\n\n2. \"Implications and Outlook\" - This section outlines the goals of the work. It aims to raise awareness about emerging privacy threats and expose unaccounted risks of tracking technologies. The presentation also mentions a proposed adversarial noise technique to give users control over their mouse data, which is described as the first countermeasure against user profiling based on mouse cursor tracking.\n\nThe slide is presented in a clean, professional format with a white background and black text. The code snippet is highlighted in different colors for better readability. The overall tone suggests this is part of a technical presentation, likely related to cybersecurity or data privacy research."}, {"start": 870, "end": 900, "narrative": "The video appears to be a presentation slide about privacy threats in the online world. It's divided into two main sections:\n\n1. Implications and Outlook:\n   - This section aims to raise awareness about emerging privacy threats in the online world.\n   - It highlights unaccounted yet significant risks associated with tracking technologies.\n   - The presentation also intends to give users control over their mouse data.\n   - A proposed adversarial noise technique is mentioned as the first countermeasure against user profiling based on mouse cursor tracking.\n\n2. Thank you for your attention:\n   - This section thanks the audience for their attention.\n   - It provides links to a Mouse Cursor Dataset and a Chrome Extension.\n   - Social media handles and websites are listed, likely for further information or contact.\n\nThe slide has a clean, professional design with a white background and black text. The content is organized clearly, making it easy to follow the main points being presented."}]