[{"start": 0, "end": 30, "narrative": "The video appears to be a live stream from NeurIPS 2018, a prominent artificial intelligence conference held in Montreal, Canada. The stream is coming from Room 220CDE.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring the concept of bioelectric computation, which is a fascinating area of research that examines how biological systems, particularly those outside the nervous system, process information and perform computations using electrical signals.\n\nThe video is being broadcast on Facebook Live, as indicated by the \"LIVE\" label and the Facebook logo in the bottom left corner. The NeurIPS 2018 logo is visible in the bottom right corner, confirming the event and year.\n\nThis presentation likely delves into how non-neural tissues can perform complex computations, potentially leading to new insights into biological intelligence and the development of novel computational models inspired by nature."}, {"start": 30, "end": 60, "narrative": "The video appears to be a live stream from NeurIPS 2018, a major conference in the field of artificial intelligence and machine learning. It's being broadcast from Room 220CDE in Montreal, Canada.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring the concept of bioelectric computation, which is a fascinating area of research that looks at how biological systems, particularly those outside the nervous system, process information and perform computations using electrical signals.\n\nThe video is being streamed on Facebook, as indicated by the \"LIVE\" logo and the Facebook logo in the bottom left corner. The overall quality of the video appears to be good, with clear audio and video.\n\nThis presentation likely delves into how non-neural tissues in organisms can perform complex computations and contribute to cognitive processes, potentially offering new insights into the nature of intelligence and consciousness."}, {"start": 60, "end": 90, "narrative": "The video appears to be a live stream from NeurIPS 2018, a prominent artificial intelligence conference held in Montreal, Canada. The stream is coming from Room 220CDE.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring the concept of bioelectric computation, which is a fascinating area of research that examines how biological systems, particularly those outside the nervous system, process information and perform computations using electrical signals.\n\nThe video is being broadcast on Facebook Live, as indicated by the \"LIVE\" label in the bottom left corner. The NeurIPS 2018 logo is visible in the bottom right corner, confirming the event and year.\n\nThis presentation likely delves into how non-neural tissues in organisms can perform complex computations and contribute to cognitive processes, potentially offering new insights into the nature of intelligence and computation in living systems."}, {"start": 90, "end": 120, "narrative": "The video appears to be a live stream from NeurIPS 2018, a major conference in the field of neural information processing systems. It's being broadcast from Room 220CDE in Montreal, Canada.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring the concept of bioelectric computation, which is a fascinating area of research that examines how biological systems, particularly those outside the nervous system, process information through electrical signals. This could potentially lead to new insights into how organisms develop, heal, and adapt, as well as inspire innovative approaches to synthetic biology and robotics.\n\nThe live stream format suggests that this is an interactive event, allowing viewers to watch and potentially ask questions in real-time. This is a common feature of major academic conferences, enabling remote participation and engagement with leading experts in the field.\n\nOverall, this video represents an exciting opportunity to learn about cutting-edge research in neural computation and synthetic biology, showcasing the interdisciplinary nature of modern neuroscience and related fields."}, {"start": 120, "end": 150, "narrative": "The video appears to be a live stream from NeurIPS 2018, a prominent artificial intelligence conference held in Montreal, Canada. The stream is coming from Room 220CDE.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring innovative concepts in neuroscience and artificial intelligence, focusing on how biological systems process information beyond the traditional nervous system. It likely discusses the potential for bioelectric computation and its implications for understanding cognition and developing synthetic morphologies.\n\nThe video is being broadcast on Facebook Live, as indicated by the \"LIVE\" label and the Facebook logo in the bottom left corner. The NeurIPS logo is visible in the bottom right corner, confirming the event's identity.\n\nOverall, this video represents an advanced discussion in the field of neuroscience and AI, showcasing cutting-edge research and ideas presented at a major international conference."}, {"start": 150, "end": 180, "narrative": "The video appears to be a live stream from NeurIPS 2018, a major conference in the field of neural information processing systems. It's being broadcast from Room 220CDE in Montreal, Canada.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring innovative concepts in neuroscience and artificial intelligence, focusing on how biological systems process information beyond the traditional nervous system. It likely discusses the potential for bioelectric computation and synthetic morphology in advancing our understanding of cognition and neural processing.\n\nThe live stream is being broadcast on Facebook, as indicated by the \"LIVE\" label and the Facebook logo in the bottom left corner of the screen."}, {"start": 180, "end": 210, "narrative": "The video appears to be a live stream from NeurIPS 2018, a major conference in the field of artificial intelligence and machine learning. It's being broadcast from Room 220CDE in Montreal, Canada.\n\nThe video features a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation seems to be exploring innovative concepts in neuroscience and artificial intelligence, focusing on how biological systems process information beyond the traditional nervous system. It likely discusses the potential for developing artificial systems that mimic these natural processes.\n\nThe live stream is being broadcast on Facebook, as indicated by the \"LIVE\" label and the Facebook logo in the bottom left corner of the screen."}, {"start": 210, "end": 240, "narrative": "The video appears to be a live stream from NeurIPS 2018, a prominent artificial intelligence conference held in Montreal, Canada. The stream is being broadcast on Facebook, as indicated by the \"LIVE\" logo and the Facebook logo in the bottom left corner.\n\nThe main focus of the video is a presentation by Michael Levin from the Allen Discovery Center at Tufts University. The title of his talk is \"What Bodies Think About: Bioelectric Computation Outside the Nervous System, Primitive Cognition, and Synthetic Morphology.\"\n\nThe presentation is taking place in Room 220CDE, as shown in the bottom right corner of the screen. The background is dark, which is typical for conference presentations to ensure the speaker and any slides are clearly visible.\n\nThe speaker, Michael Levin, is visible in the bottom right corner of the screen. He appears to be a woman with long brown hair, wearing a black top. She's standing at a podium with microphones, which is standard for conference presentations.\n\nThe video quality is not particularly high, with some pixelation visible, which is common for live streams. The overall layout of the screen is clean and professional, with the title of the talk and presenter information prominently displayed.\n\nThis live stream provides an opportunity for viewers to watch and engage with cutting-edge research in artificial intelligence and related fields, even if they couldn't attend the conference in person."}, {"start": 240, "end": 270, "narrative": "The video shows a woman giving a presentation at what appears to be a conference or seminar. She's standing behind a white podium with a microphone, and the background is completely black, creating a stark contrast that focuses attention on her.\n\nThe woman has long, straight brown hair and is wearing a black lace top with a white lanyard around her neck. She seems to be speaking, though the audio isn't clear enough to make out specific words.\n\nThe video is divided into multiple frames, each capturing a slightly different angle or moment of her presentation. In some frames, she's looking down, possibly at notes or a laptop screen, while in others she's looking up, likely addressing the audience.\n\nThe \"facebook\" logo appears in the bottom right corner of each frame, suggesting this presentation might be from a Facebook event or conference.\n\nOverall, the video captures the essence of a professional presentation, with the speaker engaging with her material and likely the audience, though the details of her speech remain unclear."}, {"start": 270, "end": 300, "narrative": "The video shows a woman giving a presentation at a conference or event. She has long brown hair and is wearing a black lace jacket over a black top. The woman is standing behind a white podium with a microphone in front of her. The background is completely black, which makes her the focal point of the image.\n\nThe woman appears to be speaking, as she has her mouth open and is looking down at the podium. Her posture suggests she's in the middle of delivering her speech.\n\nIn the bottom right corner of the video, there's a watermark that says \"facebook,\" indicating this is likely a Facebook Live stream or a video posted on Facebook.\n\nThe video seems to be a professional setting, possibly a tech conference or similar event, given the woman's attire and the presence of the podium. The overall atmosphere appears formal and serious, with the woman fully engaged in her presentation."}, {"start": 300, "end": 330, "narrative": "The video appears to be a recording of a conference or seminar presentation. It shows a woman speaking at a podium, likely delivering a lecture or presentation. The woman has long brown hair and is wearing a black lace top with a white lanyard around her neck. She is speaking into a microphone positioned in front of her.\n\nThe background is dark, which helps to focus attention on the speaker. The audience is visible in the lower part of the screen, though their faces are blurred for privacy reasons. They appear to be attentively listening to the presentation.\n\nIn the bottom right corner of the video, there's a small inset showing a man in a red shirt speaking into a microphone. This could be another speaker or a different angle of the same presentation.\n\nThe video has a Facebook watermark in the top right corner, indicating it was likely shared or recorded on the social media platform.\n\nAt the bottom of the screen, there's a slide with text that reads \"Main Message: Biology has been computing long before.\" This suggests the topic of the presentation is related to biology and computing, possibly exploring how biological systems process information or how computing can be inspired by biological processes.\n\nOverall, this video captures a moment from what seems to be an academic or professional conference, focusing on the intersection of biology and computing."}, {"start": 330, "end": 360, "narrative": "The video appears to be a presentation or lecture by Michael Levin at the NeurIPS conference in 2016. The main focus is on the topic of biolocomotion and its potential applications in artificial intelligence.\n\nThe presentation is divided into two main sections:\n\n1. On the left side, there's a slide titled \"Main Message\" with a purple background. It contains text explaining that biology has been computing long before brains evolved, and that brainless decision-making and memory are mediated by ancient, pre-memorial bioelectric networks across all cells.\n\n2. On the right side, there's a detailed diagram titled \"Tiers of Biological Cognition.\" This diagram illustrates different levels of biological cognition, including:\n   - Natural network\n   - Somatic\n   - Biological non-neural cognition\n   - Biological cognition\n   - Group cognition\n   - World-wide cognition\n\nThe presenter, Michael Levin, is shown in the bottom right corner of the screen. He's wearing a red shirt and appears to be speaking into a microphone.\n\nThe presentation seems to be exploring the concept of using biological principles to develop more advanced AI systems, potentially beyond traditional neural networks. It suggests that there's a lot to learn from the natural computing processes found in living organisms, which could lead to breakthroughs in artificial intelligence.\n\nOverall, this video appears to be a thought-provoking exploration of the intersection between biology and artificial intelligence, presented by a researcher in the field."}, {"start": 360, "end": 390, "narrative": "The video appears to be a presentation slide from a Facebook event. The main content is divided into two sections:\n\nOn the left side, there's a white background with black text. The title \"Main Message\" is prominently displayed at the top. Below this, there are three bullet points:\n\n1. \"Biology has been computing long before brains evolved\"\n2. \"Brains evolved decision-making and memory are dedicated by ancient, pre-memory bioelectric networks across all cells\"\n3. \"Exploiting non-neural cognition is an exciting, unapped frontier for an development of robust AI platforms\"\n\nAt the bottom of this section, there's a call to action: \"We are looking for experts in ML to collaborate with us to take bioelectronics beyond regenerative medicine\"\n\nOn the right side, there's a purple background with a white Facebook logo at the top. Below this, there's a black and white image of a man speaking at a podium. The man is wearing a red shirt and a black hat.\n\nThe overall layout suggests this is part of a presentation or lecture, likely discussing the intersection of biology, artificial intelligence, and machine learning. The speaker seems to be emphasizing the potential of bioelectronics and non-neural cognition in advancing AI technology."}, {"start": 390, "end": 420, "narrative": "The video appears to be a presentation slide from a talk or lecture. The main content is divided into two sections:\n\n1. Outline:\n   - Brain-body plasticity: processing info across brain and body\n   - Somatic cognition in the body: decision-making during self-editing of anatomy\n   - Biophysical mechanisms of non-neural pattern control\n   - The future: regenerative medicine, synthetic living machines, novel AI architectures\n\n2. Behavioral Programs Adapt to Hardware Change:\n   - This section features an image of a butterfly's life cycle, showing the caterpillar, chrysalis, and adult butterfly stages.\n   - The text explains that the butterfly has the caterpillar's memories despite radical brain reconstruction.\n\nThe slide is presented in a dark purple background with white text, giving it a professional and scientific appearance. In the bottom right corner, there's a small inset image of a man speaking at a podium, likely the presenter of the talk.\n\nThe content suggests this is a presentation on advanced topics in neuroscience, cognitive science, and future technologies. The butterfly example illustrates how complex behaviors can persist through significant physical changes, which is a fascinating topic in the study of memory and cognition."}, {"start": 420, "end": 450, "narrative": "The video appears to be a TED Talk presentation about the fascinating topic of memory and brain regeneration in planarians, a type of flatworm. The presentation is divided into two main sections:\n\n1. Behavioral Programs Adapt to Hardware Change:\nThis section focuses on the life cycle of a butterfly, showing the caterpillar stage, the chrysalis, and the adult butterfly. It highlights how the butterfly's behavior changes dramatically as it undergoes metamorphosis, despite having a completely different brain structure.\n\n2. Planarian Memories Survive Brain Regeneration:\nThe second part of the presentation delves into the remarkable ability of planarians to regenerate their entire body, including their brain. It explains how memories are stored outside the head and can be imprinted on a regenerated brain.\n\nThe presentation is accompanied by a speaker, likely the TED Talk presenter, who is visible in the bottom right corner of the screen. The background is predominantly purple, with white text and images used to illustrate the points being made.\n\nThe video seems to be exploring the concept of memory and its relationship with brain structure, using both the butterfly and planarian as examples to demonstrate how memories can persist and adapt even when the physical brain undergoes significant changes."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation or lecture about planarian memories surviving brain regeneration. It's set against a dark purple background with white text and images. The main title reads \"Planarian Memories Survive Brain Regeneration\" and includes a subtitle \"Memory stored outside the head, imprinted on regenerated brain.\"\n\nOn the left side of the screen, there's a series of images showing the process of planarian regeneration. These images depict a planarian worm undergoing various stages of regeneration, including head regeneration and memory testing.\n\nOn the right side, there's a circular diagram with a blue section, though its specific details aren't clear. Below this diagram, there's a black and white image of a planarian worm.\n\nIn the bottom right corner, there's a small video feed of a man speaking. He's wearing a red shirt and a black hat, and he appears to be giving the presentation.\n\nThe video seems to be from a Facebook Live stream, as indicated by the \"facebook\" text in the top right corner.\n\nOverall, the presentation appears to be discussing the fascinating ability of planarian worms to regenerate their brains and retain memories even after the original brain has been removed. This research has implications for understanding memory storage and regeneration in animals."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation or lecture on the topic of brain regeneration and memory in planarians, which are flatworms. The presentation is divided into two main sections:\n\n1. \"Planarian Memories Survive Brain Regeneration\"\n   - This section discusses how memories in planarians can survive the process of brain regeneration.\n   - It shows images of planarians at different stages of the regeneration process.\n   - There's a diagram illustrating the training, decapitation, head regeneration, and memory testing phases.\n\n2. \"Capturing the Public Interest\"\n   - This part seems to focus on how the research has garnered public attention.\n   - It includes a humorous meme about training flatworms.\n   - There's also an image of a laboratory setup, possibly related to the research.\n\nThe presentation is being delivered by a man with a beard, wearing a red jacket and a black hat. He's standing at a podium, which suggests this is likely a formal lecture or conference presentation.\n\nThe video seems to be from a Facebook Live stream, as indicated by the \"facebook\" text visible in the corner of the screen.\n\nOverall, the presentation appears to be a scientific lecture aimed at explaining the fascinating research on memory retention in planarians during the brain regeneration process, while also highlighting its public appeal and potential implications for future research in regenerative biology and artificial intelligence."}, {"start": 510, "end": 540, "narrative": "The video appears to be a presentation or lecture on advanced cognitive science and neuroscience topics. It's divided into two main sections:\n\n1. An outline slide:\n   - The title is \"Outline\"\n   - It mentions \"Brain-body plasticity: processing across brain and body\"\n   - \"Somatic cognition in the body: decision-making during self-editing of anatomy\"\n   - \"Bioelectric mechanisms of non-neural pattern control\"\n   - \"The future: regenerative medicine, synthetic living machines, novel AI architectures\"\n\n2. A slide titled \"Wiener's Levels of Cognition\":\n   - This slide presents a diagram with various levels of cognition, including \"First step,\" \"Second step,\" and \"Third step.\"\n   - There's a small image of a person on the right side of the slide.\n\nThe video also includes a small inset image of a man speaking at a podium, likely the presenter of the lecture. The background is predominantly purple, and there's a Facebook logo visible in the top right corner.\n\nThe content seems to be exploring cutting-edge research in cognitive science, including brain-body interactions, decision-making processes, and future technological advancements in areas like regenerative medicine and artificial intelligence."}, {"start": 540, "end": 570, "narrative": "The video appears to be a presentation slide from a lecture or conference. It's divided into two main sections:\n\nOn the left side, there's a title that reads \"Unicellular organisms robustly achieve physiology, patterning, and behavior goals.\" Below this title, there's a black rectangle containing a white image of a single cell labeled \"Lacrymaria.\" This cell is described as having \"no brain.\"\n\nOn the right side, there's a Facebook logo, suggesting this presentation might be related to or shared on Facebook.\n\nIn the bottom right corner, there's a small video window showing a man speaking at a podium. He's wearing a red jacket and has a beard. The background behind him is dark, which makes him stand out.\n\nThe overall layout suggests this is part of a scientific or educational presentation, possibly discussing the capabilities of unicellular organisms and their ability to achieve complex functions without a brain."}, {"start": 570, "end": 600, "narrative": "The video appears to be a presentation or lecture on cellular biology and multicellular organisms. It's divided into two main sections:\n\n1. The left side shows a slide with text and images:\n   - The title reads \"Unicellular organisms robustly achieve physiology, patterning, and behavior goals\"\n   - Below this, there's a caption that says \"1 cell no 'brain'\"\n   - The image shows a microscopic view of a single cell, labeled \"Lacrymaria\"\n\n2. The right side shows a live video feed of a presenter:\n   - The presenter is a man with a beard, wearing a red hoodie and glasses\n   - He's seated at a desk with a laptop in front of him\n   - The background is dark, suggesting this is likely a professional presentation setting\n\nThe slide on the left seems to be discussing how single-celled organisms can achieve complex functions without a brain. The image of Lacrymaria, a type of ciliate, likely serves as an example of this capability.\n\nThe presenter on the right appears to be giving a lecture or presentation, possibly explaining the concepts shown on the slide. The Facebook logo in the corner suggests this might be a live stream or recording of a presentation on the social media platform.\n\nOverall, this video seems to be an educational resource, likely aimed at students or researchers interested in cellular biology and the capabilities of single-celled organisms."}, {"start": 600, "end": 630, "narrative": "The video appears to be a presentation or lecture on embryogenesis and self-assembly in biology. It's divided into two main sections:\n\n1. The left side shows a slide with text and images. The text discusses how cells don't lose their intelligence when forming multicellular creatures, broadening their computational horizons. It mentions the concept of the \"self\" and its boundaries.\n\n2. The right side features a live video feed of a presenter. The presenter is a man with a beard, wearing a red shirt and a black hat. He's seated at a desk with a laptop in front of him.\n\nThe slide on the left contains images of a frog embryo and a developing nervous system, illustrating the topic being discussed. The presenter seems to be explaining these concepts in more detail.\n\nThe overall presentation appears to be about the development of complex organisms from single cells, focusing on how intelligence and self-awareness evolve during embryonic development."}, {"start": 630, "end": 660, "narrative": "The video appears to be a presentation slide about embryogenesis, specifically focusing on the concept of reliable self-assembly in embryos. The slide is titled \"Embryogenesis: reliable self-assembly\" and includes a Facebook logo in the top right corner.\n\nThe main content of the slide is divided into two sections:\n\n1. \"Normal Embryo Development\" - This section shows a series of images representing different stages of embryonic development, including a pink jellyfish, a goldfish, a snake, a bird, and a giraffe. These images illustrate the progression from simple to complex organisms.\n\n2. \"Birth defects\" - This section highlights potential issues that can arise during embryonic development, such as birth defects and cancer.\n\nThe slide also includes a red arrow pointing upwards with the text \"Stem cell differentiation is not enough\" and \"Tumors: differentiated cells without large-scale organization.\" This suggests that while stem cell differentiation is crucial, it's not sufficient for proper development, and tumors represent a lack of large-scale organization in differentiated cells.\n\nIn the bottom right corner of the slide, there's a small image of a man speaking at a podium, likely the presenter of the lecture or presentation.\n\nThe overall theme of the slide seems to be exploring the complexities of embryonic development and the challenges that can arise, particularly in relation to stem cell differentiation and the formation of tumors."}, {"start": 660, "end": 690, "narrative": "The video appears to be a presentation or lecture on embryogenesis and developmental biology. It's divided into several slides, each focusing on different aspects of embryonic development.\n\nThe first slide is titled \"Embryogenesis: reliable self-assembly\" and features images of various animals, including a fish, a snake, and a bird. It discusses normal embryonic development and mentions issues like birth defects and cancer.\n\nThe second slide is titled \"Development: initial generation of form\" and includes a diagram showing the relationship between genes, effectors, and physics in the development process. It also has images of different animals and mentions the current paradigm of open-loop systems.\n\nThe third slide is titled \"Embryogenesis is reliable, but not hardwired - regulation after drastic perturbation.\" It shows images of a split embryo and a combined embryo, demonstrating the embryo's ability to recover from drastic changes.\n\nThroughout the video, there's a small inset image of a man in a red jacket, likely the presenter, who appears to be speaking or explaining the content on the slides.\n\nThe video seems to be part of a larger lecture or presentation on developmental biology, focusing on the processes and mechanisms involved in embryonic development."}, {"start": 690, "end": 720, "narrative": "The video appears to be a presentation slide from a Facebook Live event. The main focus is on the topic of embryogenesis and its reliability in response to drastic perturbations.\n\nThe slide is divided into two main sections:\n\n1. On the left, there's an image of two women, likely scientists or researchers, discussing or examining something. This suggests the topic is being explored by experts in the field.\n\n2. On the right, there's an illustration of a mouse embryo. The text next to it reads \"nice from aggregated embryos,\" which seems to be discussing the process of creating embryos from aggregated cells.\n\nBelow these images, there are two key points highlighted:\n\n- \"Splitting an embryo in half makes 2 normal embryos\"\n- \"Combining 2 embryos gives normal organism\"\n\nThese points illustrate the remarkable resilience and adaptability of embryogenesis, showing how embryos can recover from significant disruptions.\n\nIn the bottom right corner, there's a small inset image of a man speaking at a podium. He's wearing a red jacket and a hat, and appears to be the presenter or speaker for this Facebook Live event.\n\nThe slide's title, \"Embryogenesis is reliable, but not hardwired - regulation after drastic perturbation,\" emphasizes the main theme of the presentation: while embryogenesis is a reliable process, it's not rigidly predetermined, and can adapt to significant changes.\n\nOverall, this slide seems to be part of a scientific presentation or lecture, likely aimed at an audience interested in developmental biology or embryology. It highlights the fascinating ability of embryos to recover from major disruptions, showcasing the complexity and adaptability of biological development processes."}, {"start": 720, "end": 750, "narrative": "The video appears to be a presentation slide from a lecture or talk about regeneration in biology. The slide is divided into two main sections:\n\n1. On the left side, there's a diagram showing the process of regeneration. It includes a tree branch with a circle representing a limb, and a label \"Regeneration\" pointing to the limb. Below this, there's a smaller circle with a line connecting it to the limb, indicating the regrowth process.\n\n2. On the right side, there's a photograph of an axolotl, a complex vertebrate known for its regenerative abilities. The axolotl is shown in a dark background, highlighting its distinctive features.\n\nAt the top of the slide, there's a title that reads \"Regeneration: rebuild the target morphology after unpredictable deformations, then stop.\" This title emphasizes the key concept of regeneration - the ability to restore damaged or lost body parts to their original form.\n\nIn the bottom right corner, there's a small inset image of a man speaking at a podium, likely the presenter of the lecture. The background of this inset is purple, and there's a Facebook logo visible, suggesting this presentation might be part of a Facebook Live event or a video shared on the platform.\n\nThe slide effectively combines visual elements and text to convey the concept of regeneration, using the axolotl as a prime example of an organism with remarkable regenerative capabilities."}, {"start": 750, "end": 780, "narrative": "The video appears to be a presentation or lecture on the topic of regeneration in biology. It's divided into two main sections:\n\n1. Axolotl Regeneration:\nThe first part focuses on axolotls, which are complex vertebrates capable of regenerating various body parts. The slide shows an image of an axolotl and explains that they can regenerate limbs, eyes, jaws, parts of the heart, and even the spinal cord and muscle.\n\n2. Planarian Regeneration:\nThe second part discusses planarians, which are flatworms known for their remarkable regenerative abilities. The slide illustrates the process of planarian regeneration, showing how they can restore global order in their body structure.\n\nThe presentation is set against a purple background and includes a small inset image of a man speaking at a podium, likely the presenter of the lecture. The Facebook logo is visible in the top right corner, suggesting this might be a live stream or recorded session from a Facebook event.\n\nThe content seems to be aimed at an audience interested in biological sciences, particularly those studying regenerative biology or developmental biology."}, {"start": 780, "end": 810, "narrative": "The video appears to be a presentation or lecture on the topic of regeneration, specifically focusing on planarian regeneration. The slide shown is titled \"Planarian Regeneration: Restoring Global Order\" and features a series of images and diagrams illustrating the process of planarian regeneration.\n\nThe slide includes:\n\n1. A photograph of a planarian worm on the left side.\n2. A series of illustrations showing the stages of planarian regeneration, starting with a cut planarian and progressing through various stages of regrowth.\n3. A diagram of a planarian's anatomy, highlighting different body parts.\n4. A sequence of images showing the growth of a planarian over time.\n\nThe slide also contains text that reads \"Precise diastereomeric rescaling, Immortality\" and \"Regeneration is not just for 'lower' animals.\"\n\nIn the bottom right corner of the slide, there's a small image of a man speaking at a podium, likely the presenter of the lecture.\n\nThe overall presentation seems to be discussing the remarkable regenerative abilities of planarian worms, which can regrow entire body parts from small fragments. The slide emphasizes the precision and efficiency of this regenerative process, suggesting it could have implications for understanding regeneration in other organisms, including humans."}, {"start": 810, "end": 840, "narrative": "The video appears to be a presentation or lecture on the topic of regeneration in humans and animals. It's divided into two main sections:\n\n1. The first part focuses on regeneration in animals, particularly highlighting that regeneration is not limited to \"lower\" animals. It mentions that deer regenerate their antlers every year, and human children under 7-11 years old can regenerate fingertips.\n\n2. The second part of the video discusses \"Closed Loop Pattern Homeostasis.\" This seems to be a complex biological process involving genes, proteins, and the physical emergence of anatomy. The diagram shows a flowchart with various components like \"Anatomical Error Detection and Control Loop,\" \"Genes,\" \"Effectors,\" and \"Physics of Anatomy.\"\n\nThe presentation is set against a purple background and includes images of a deer with antlers and a human child. There's also a small inset image of a man speaking at a podium, likely the presenter of the lecture.\n\nThe video seems to be part of a larger discussion on biological processes and regeneration, combining information about animal regeneration with more complex biological concepts."}, {"start": 840, "end": 870, "narrative": "The video appears to be a presentation slide from a lecture or talk about \"Closed Loop Pattern Homeostasis.\" The slide is divided into two main sections:\n\n1. The left side contains a detailed diagram illustrating the concept of anatomical error detection and control loop. It shows a flowchart with various components such as GRNs (Gene Regulatory Networks), genes, proteins, and effectors. The diagram explains how these elements interact to maintain the correct shape of an organism, even in the face of unpredictable environmental perturbations.\n\n2. The right side of the slide features a photograph of a man, likely the presenter, wearing a red shirt and a black hat. He is seated at a desk with a laptop in front of him.\n\nThe slide also includes text that explains the process of remodeling until a \"correct frog face\" is made, suggesting that the presentation may be discussing developmental biology or morphogenesis in frogs.\n\nThe overall layout and content of the slide indicate that this is part of an academic or scientific presentation, possibly related to developmental biology, genetics, or systems biology. The presenter seems to be explaining complex biological processes in a structured and visually aided manner."}, {"start": 870, "end": 900, "narrative": "The video shows a presentation slide titled \"Remodeling until a 'correct frog face' is made.\" The slide is divided into two main sections. On the left, there are images of frog embryos at different stages of development, labeled \"Normal\" and \"Picasso-like.\" These images illustrate the process of frog face formation.\n\nOn the right side of the slide, there's a section titled \"Change biotic prepatterning Craniofacial mispatterning.\" This appears to be discussing how changes in biological patterning can lead to misshapen craniofacial structures in frogs.\n\nBelow this, there's a question posed: \"How does it know when it's 'right'?\" This seems to be the central topic of the presentation, exploring how frogs' facial structures develop correctly.\n\nIn the bottom right corner of the slide, there's a small image of a man with a beard, likely the presenter of the talk. The background of the slide is purple, and there's a Facebook logo in the top right corner.\n\nThe slide appears to be part of a scientific presentation, possibly at a conference or seminar, discussing the complex process of frog facial development and the factors that influence it."}, {"start": 900, "end": 930, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. The slide is titled \"Remodeling until a 'correct frog face' is made\" and is divided into two main sections.\n\nOn the left side, there are images of frog embryos at different stages of development. The top image is labeled \"Normal\" and shows a typical frog embryo. Below it is a \"Picasso-like\" image, which seems to be a stylized or artistic representation of the embryo. There's also a \"D1\" image showing a cross-section of the embryo.\n\nOn the right side, there's a photograph of a fully developed frog. Below it are four smaller images showing different views of the frog's face, including dorsal, ventral, and lateral perspectives.\n\nThe slide includes text that reads \"Cannot just follow a hardwired set of movements. How does it know when it's 'right'?\" This suggests the topic is about the complex process of frog facial development and how it achieves the correct shape.\n\nIn the bottom right corner, there's a small image of a man, likely the presenter, wearing a red shirt and a hat.\n\nThe slide seems to be discussing the intricate process of frog facial development, highlighting how it's not a simple, predetermined process but rather involves complex remodeling and decision-making."}, {"start": 930, "end": 960, "narrative": "The video appears to be a presentation slide from a Facebook Live event. The slide is divided into two main sections:\n\nOn the left side, there's a series of images showing a salamander with a tail grafted onto its side. The salamander is depicted in three stages:\n1. The initial state with the tail attached.\n2. The tail beginning to grow and integrate.\n3. The tail fully integrated and remodeled into a limb.\n\nBelow these images, there's text that reads \"Tail grafted onto flank.\"\n\nOn the right side of the slide, there's a diagram of a brain with a red arrow pointing to a specific area. The text next to this diagram states \"not just local environmental cues matter.\"\n\nIn the bottom right corner of the slide, there's a small inset image of a man wearing a red jacket and a black hat. He appears to be the presenter of the event.\n\nThe slide is titled \"Tissues can form highly robust, plastic goal-seeking systems that handle novelty!\" at the top, with the Facebook logo visible in the top right corner.\n\nThis presentation seems to be discussing the remarkable regenerative abilities of salamanders and how their tissues can adapt to form new structures, even when grafted onto unusual locations. The brain diagram likely relates to the neural mechanisms involved in this process."}, {"start": 960, "end": 990, "narrative": "The video appears to be a presentation or lecture on the topic of regeneration and patterning in biology. It's divided into two main sections:\n\n1. Regeneration as a computational problem:\n   - The first part of the video discusses how regeneration can be viewed as a computational problem. It mentions the challenges of determining the shape needed for regeneration, the process of getting from the current state to the desired state, and when to stop growing.\n\n2. What determines patterning:\n   - The second part focuses on the factors that determine patterning, specifically mentioning the role of non-coding RNA (ncRNA) in controlling when to make and when to stop making cells.\n\nThroughout the video, there are visual aids such as diagrams and images to illustrate the concepts being discussed. The presenter is shown in a small inset window on the right side of the screen, wearing a red jacket and a hat.\n\nThe video seems to be part of a larger discussion on biological processes, particularly those related to growth, development, and repair in organisms."}, {"start": 990, "end": 1020, "narrative": "The video appears to be a presentation slide from a lecture or talk. The slide is titled \"What determines patterning?\" and is divided into two main sections.\n\nOn the left side, there's a detailed diagram of a developing embryo. The embryo is shown in cross-section, with various structures labeled. At the top, there's a red circle labeled \"stem cell embryonic mesoderm,\" indicating the starting point of development. Below this, there's a label \"guided self-assembly,\" suggesting the process by which the embryo forms its structures.\n\nThe right side of the slide contains text that poses questions about the patterning process. It asks how DNA specifies proteins, how cells know when to make and when to stop, and what's possible to build. It also mentions \"Engineers\" and \"Anatomy,\" indicating a comparison between biological development and engineering principles.\n\nIn the bottom right corner, there's a small inset image of a man speaking at a podium. He's wearing a red jacket and appears to be giving a lecture or presentation.\n\nThe slide seems to be part of a larger discussion on developmental biology, comparing the natural process of embryonic development to engineered systems. It's likely from a lecture or seminar on the topic of biological patterning and development."}, {"start": 1020, "end": 1050, "narrative": "The video appears to be a presentation slide from a talk or lecture. It's divided into two main sections:\n\nOn the left side, there's a slide titled \"What determines patterning?\" This section seems to be discussing the factors that influence the development of patterns in biological systems. It mentions \"stem cell embryonic blastocyst\" and \"DNA specifies proteins,\" suggesting a focus on early development and genetic control.\n\nOn the right side, there's a slide titled \"Knowledge gap.\" This slide highlights a significant challenge in the field, stating \"We cannot read a genome and predict anatomy!\" It then presents images of an octopus, a human ear, a plant, a human hand, and a human foot, emphasizing the complexity of predicting anatomy from genetic information.\n\nIn the bottom right corner, there's a small inset image of a man speaking at a podium. He's wearing a red shirt and a black hat, and he appears to be giving a presentation or lecture.\n\nThe slide also includes a Facebook logo in the top right corner, indicating that this presentation might be related to or shared on Facebook.\n\nOverall, the video seems to be discussing the complexities of biological development and the challenges in predicting anatomy from genetic information, highlighting a significant gap in our current knowledge and understanding."}, {"start": 1050, "end": 1080, "narrative": "The video appears to be a presentation slide from a Facebook event. The slide is titled \"Knowledge gap\" and is divided into two main sections.\n\nOn the left side, there's a purple background with a white square containing a small image of a human ear. Below this, there's text that reads:\n\n\"We want to fix a birth defect or induce shape change for regenerative repair.\"\n\nOn the right side, there's a white background with red text that says:\n\n\"Huge opportunities for machine learning to impact regenerative medicine (beyond drug discovery)\"\n\nBelow this text, there's a purple background with a white square containing a complex network diagram. The diagram appears to be a representation of a biological network, possibly related to the topic of regenerative medicine.\n\nIn the bottom right corner of the slide, there's a small image of a man wearing a red jacket and a black hat. He's standing in front of a podium, suggesting he might be the presenter of this slide.\n\nThe slide seems to be discussing the potential applications of machine learning in regenerative medicine, particularly in addressing birth defects and inducing shape changes for repair. It highlights the significant opportunities this technology presents beyond traditional drug discovery methods."}, {"start": 1080, "end": 1110, "narrative": "The video appears to be a presentation or lecture on the intersection of biology and computer science. It's divided into two main sections:\n\n1. \"The State of the Art\" slide:\n   - This section discusses the current state of manipulating molecules and cells for complex pattern control.\n   - It mentions the challenges in understanding algorithms for large-scale form and function.\n   - The slide includes a diagram of a rabbit and a mouse, possibly illustrating some biological concepts.\n\n2. \"Key Insights that allowed computer science to drive a revolution in information technology\" slide:\n   - This part focuses on the historical development of computer science.\n   - It includes a photograph of an early computer setup with a person working on it.\n   - The slide mentions the importance of information and control algorithms over hardware.\n\nThroughout the video, there's a small inset showing a man giving the presentation. He's wearing a red shirt and a black hat, and he's speaking at a podium.\n\nThe video seems to be exploring how insights from computer science can be applied to advance biological research and understanding. It appears to be part of a larger discussion on the potential for machine learning and algorithms to impact biological studies and decision-making processes."}, {"start": 1110, "end": 1140, "narrative": "The video appears to be a presentation slide from a Facebook event. The slide is divided into two main sections:\n\nOn the left side, there's a title that reads \"Key insights that allowed computer science to drive a revolution in information technology.\" Below this title, there's a black and white photograph of a man working on a large computer system. The image is labeled \"Biology today\" and includes a line drawing of a computer circuit board.\n\nOn the right side, there's a Facebook logo in the top right corner. Below the logo, there's a photo of a man wearing a red shirt and a black hat, sitting at a desk with a laptop. This man is likely the presenter of the event.\n\nThe slide also includes some text that discusses the focus on information and control algorithms in computer science, rather than hardware. It mentions the hardware-software distinction and device-independence.\n\nThe overall layout suggests this is part of a larger presentation on the evolution of computer science and its impact on information technology."}, {"start": 1140, "end": 1170, "narrative": "The video appears to be a presentation or lecture on cognitive-like properties of pattern homeostasis. It's divided into two main sections:\n\n1. Cognitive-like properties of pattern homeostasis:\n   - Goal-directed behavior toward specific anatomical outcomes\n   - Flexibility (robustness) under variable conditions\n   - Global integration of cell functions into complex large-scale outcomes\n\n2. Outline:\n   - Brain-body plasticity: processing across brain and body\n   - Somatic cognition in body: decision-making during self-editing\n   - Biometric mechanisms of non-neural pattern control\n   - The future: regenerative machines, synthetic living machines, neural AI architectures\n\nThe presentation is set against a purple background with white text. There's a small inset image of a man, likely the presenter, on the right side of the screen. The video seems to be from a Facebook event, as indicated by the Facebook logo in the top right corner.\n\nThe content suggests a discussion on how biological systems, particularly the brain and body, exhibit cognitive-like properties and how these principles could be applied to future technologies like regenerative machines and neural AI."}, {"start": 1170, "end": 1200, "narrative": "The video appears to be a presentation slide from a Facebook Live event. The slide has a white background with black text and a purple border. The main content of the slide is a statement about somatic tissues forming bioelectric networks that make decisions about anatomy, and how this system can be targeted for large-scale pattern editing.\n\nOn the left side of the slide, there's a photograph of a frog. The frog is positioned on its back, with its legs spread out. It has a yellowish-brown coloration and appears to be in a relaxed state.\n\nIn the bottom right corner of the slide, there's a small logo that resembles a blue square with a red \"X\" over it, and a white \"S\" inside the blue square.\n\nThe slide also includes the Facebook logo in the top right corner.\n\nIn the bottom right corner of the image, there's a small inset showing a man with a beard and mustache. He's wearing a red jacket and a black hat, and he's speaking into a microphone. This suggests he's the presenter or speaker for the Facebook Live event.\n\nThe overall presentation seems to be discussing advanced biological concepts, possibly related to genetic engineering or developmental biology. The mention of \"large-scale pattern editing\" implies that the speaker is exploring ways to manipulate biological structures on a significant scale, which could have implications for medical research or biotechnology."}, {"start": 1200, "end": 1230, "narrative": "The video appears to be a presentation or lecture about the evolution of neural computation and the role of somatic tissues in pattern editing. The slide shown is titled \"Brains did not Invent their Tricks de Novo\" and is divided into two main sections.\n\nOn the left side, there's a diagram of a nerve cell with the caption \"nerve cells that make decisions, remember patterns.\" This likely illustrates how nerve cells function in decision-making and pattern recognition.\n\nOn the right side, there's a green image with the caption \"electrically communicating, expectantly communicating (gap junctions, synapses).\" This seems to be showing how nerve cells communicate electrically and through gap junctions and synapses.\n\nBelow these images, there are two bullet points:\n1. \"Our unicellular ancestors already had synapse machinery, ion channels, neurotransmitters.\"\n2. \"Neural computation evolved by speed-optimizing ancient computational machinery.\"\n\nThe slide also includes a Facebook logo in the top right corner, suggesting this presentation might be part of a Facebook Live event or shared on a Facebook page.\n\nIn the bottom right corner, there's a small image of a red mushroom with white spots, which could be a decorative element or related to the topic being discussed.\n\nThe presenter, visible in the bottom right corner, is wearing a red jacket and a black hat. He appears to be giving a lecture or presentation on this topic.\n\nOverall, the video seems to be discussing how neural computation and decision-making processes have evolved from ancient cellular mechanisms, highlighting the interconnectedness of nerve cells and their communication methods."}, {"start": 1230, "end": 1260, "narrative": "The video appears to be a presentation slide from a lecture or talk about brain evolution. The slide is titled \"Brains did not Invent their Tricks de Novo\" and is presented on a purple background. \n\nThe slide contains two main images:\n1. On the left, there's a microscopic image of nerve cells, showing their intricate structure.\n2. On the right, there's a close-up of a red mushroom with white spots, which is likely being used as a visual metaphor for the complexity of brain structures.\n\nBelow these images, there are two key points:\n1. \"Our unicellular ancestors already had syn machinery, ion channels, neurotransmitters\"\n2. \"Neural computation evolved by speed-optimizing ancient computational\"\n\nIn the bottom right corner, there's a small inset image of a man wearing a red jacket and a black hat, who appears to be the presenter of the lecture.\n\nThe slide seems to be discussing how the complexity of brain structures and neural computation evolved from simpler, ancient forms of life. The use of the mushroom image suggests a comparison between the intricate structures of brains and the complex forms found in nature.\n\nThe slide also includes a Facebook logo in the top right corner, indicating that this presentation might be part of a lecture series or event that is being shared on social media.\n\nOverall, this slide appears to be part of an educational presentation aimed at explaining the evolutionary origins of brain structures and neural computation in a visually engaging way."}, {"start": 1260, "end": 1290, "narrative": "The video appears to be a presentation slide from a lecture or talk about the evolution of neural computation. The slide is divided into two main sections: \"Hardware\" and \"Software.\"\n\nOn the left side, under \"Hardware,\" there's an illustration of a neuron with various components labeled:\n- Ion channels\n- Electrical channels\n- Synaptic products\n\nOn the right side, under \"Software,\" there's a diagram showing the relationship between gene products, electrical circuits, and memory.\n\nThe slide also includes text that explains:\n1. Our unicellular ancestors already had synaptic machinery (ion channels, neurotransmitters)\n2. Neural computation evolved by speed-optimizing ancient computational somatic cells\n\nIn the bottom right corner of the slide, there's a small image of a mushroom, which might be related to the topic or simply used as a decorative element.\n\nThe slide is presented on a purple background, and there's a small inset image of a man in a red shirt, likely the presenter of the lecture.\n\nThis presentation seems to be discussing how neural computation evolved from simpler forms of cellular communication in unicellular organisms to the complex systems we see in modern brains. It emphasizes the idea that the basic components of neural communication (ion channels, neurotransmitters) were present in early life forms, and that neural computation has evolved to optimize speed and efficiency in processing information."}, {"start": 1290, "end": 1320, "narrative": "The video appears to be a presentation slide from a lecture or conference. It's divided into two main sections: \"Hardware\" and \"Software.\"\n\nOn the left side, under \"Hardware,\" there's an illustration of a neuron with various components labeled:\n- Ion channels\n- Electrical synapses\n\nBelow this, there's a label \"neural\" with an arrow pointing to the neuron.\n\nOn the right side, under \"Software,\" there's a diagram showing:\n- Gene products\n- Electrical circuits\n- Electrical dynamics\n- Memory\n\nBelow this, there's a label \"developmental\" with an arrow pointing to a circular diagram containing a green and red color scheme.\n\nIn the bottom right corner, there's a small inset image of a man giving a presentation. He's wearing a red jacket and a black hat, and he's speaking into a microphone.\n\nThe slide has a purple background with white text, and there's a Facebook logo in the top right corner.\n\nOverall, the slide seems to be discussing the relationship between neural hardware and software components, possibly in the context of neuroscience or artificial intelligence."}, {"start": 1320, "end": 1350, "narrative": "The video appears to be a presentation slide from a lecture or conference. It's divided into two main sections: \"Hardware\" and \"Software.\"\n\nOn the left side, under \"Hardware,\" there's a detailed diagram of a neuron. The neuron is depicted with various components labeled, including:\n\n- Ion channels\n- Electrical synapses\n- Neural\n\nThe diagram shows the structure of the neuron, with the cell body, dendrites, and axon clearly visible. There's also a label \"developmental\" pointing to the neuron, suggesting this might be part of a developmental biology discussion.\n\nOn the right side, under \"Software,\" there's a smaller image of a brain scan. This likely represents the software or computational aspect of the topic being discussed.\n\nAt the bottom of the slide, there's a label \"TBD\" (To Be Determined) next to a green and red circle, which could be a placeholder for additional information or a key concept that will be covered later in the presentation.\n\nIn the bottom right corner, there's a small inset image of a man giving a presentation. He's wearing a red shirt and a hat, and he's speaking into a microphone. This suggests the slide is part of a live lecture or conference presentation.\n\nThe slide seems to be discussing the relationship between the hardware (neuronal structure) and software (brain function) aspects of neuroscience or cognitive science. The presence of the Facebook logo in the top right corner indicates this presentation might be part of a Facebook Live event or a Facebook-hosted conference."}, {"start": 1350, "end": 1380, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. The slide is divided into two main sections: \"Hardware\" and \"Software.\"\n\nOn the left side, under \"Hardware,\" there's a diagram showing the components of a biological system. It includes:\n\n1. Ion channels, electrical synapses, and neural synapses.\n2. A representation of a cell with ion channels and electrical synapses.\n3. A label indicating \"developmental.\"\n\nOn the right side, under \"Software,\" there's a colorful image that seems to be a representation of electrical dynamics or memory.\n\nBelow these sections, there's a text box with the following information:\n\n\"Vmen pattern = spatial difference of cells' resting potential across a tissue\"\n\n\"Bioelectrical signal = a change (in time) of spatial distribution = resting potentials in vivo\"\n\nThe slide also includes a small inset image of a man in a red shirt, likely the presenter of the lecture.\n\nIn the bottom right corner, there's a Facebook logo, suggesting this presentation might be part of a live stream or recorded session on Facebook.\n\nThe slide seems to be discussing the relationship between hardware (biological components) and software (electrical dynamics) in a biological system, possibly focusing on how resting potentials in cells contribute to overall tissue function and bioelectrical signaling."}, {"start": 1380, "end": 1410, "narrative": "The video appears to be a presentation or lecture on biophysical computation, specifically focusing on how to detect and model bioelectric signals. The slide is divided into two main sections:\n\n1. On the left, there's a colorful image of a brain-like structure with various colors representing different areas. This is likely a visualization of bioelectric activity in the brain.\n\n2. On the right, there's a detailed diagram showing a model of bioelectric signals. It includes various components labeled \"L,\" \"R,\" \"V,\" \"H,\" and \"D,\" which likely represent different parts of the model or the brain.\n\nThe slide also contains text explaining the process of detecting and modeling bioelectric signals, mentioning \"Chromatization of endogenous voltage gradients\" and \"Quantitative computer synthesis of bioelectric signals.\"\n\nIn the bottom right corner, there's a small image of a man, presumably the presenter, wearing a red jacket and a hat. He's standing in front of a microphone, suggesting this is part of a live presentation or lecture.\n\nThe slide is titled \"How we detect and model bioelectric signals\" and includes a Facebook logo in the top right corner, indicating it might be part of a Facebook Live event or a presentation shared on Facebook.\n\nOverall, this video seems to be an educational resource on the topic of bioelectric signals and their modeling, likely aimed at an audience interested in neuroscience, biophysics, or computational biology."}, {"start": 1410, "end": 1440, "narrative": "The video appears to be a presentation slide from a talk titled \"Eavesdropping on Biophysical Computation during Patterning.\" The slide is divided into two main sections:\n\nOn the left side, there's a section labeled \"Normal\" with three images:\n1. A black and white image of a developing embryo with a green outline.\n2. A black and white image of a developing embryo with a red outline.\n3. A black and white image of a developing embryo with a blue outline.\n\nOn the right side, there's a section labeled \"Pathological\" with two images:\n1. A black and white image of a developing embryo with a red outline.\n2. A black and white image of a developing embryo with a blue outline.\n\nBelow the \"Pathological\" section, there's a caption that reads: \"Biophysical signature of human oncogenic tumor cells to boundary of self.\"\n\nIn the bottom right corner, there's a small image of a man giving a presentation. He's wearing a red jacket and has a beard.\n\nThe slide seems to be discussing the differences between normal and pathological development patterns, possibly in the context of cancer research. The images likely represent different stages or conditions of embryonic development, with the colored outlines possibly indicating areas of interest or abnormality.\n\nThe Facebook logo is visible in the top right corner, suggesting this presentation might be part of a Facebook Live event or shared on a Facebook page."}, {"start": 1440, "end": 1470, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. It's divided into two main sections:\n\nOn the left side, there's a detailed diagram of a \"Non-neural network\" with various components labeled. The network is depicted as a complex web of interconnected nodes and pathways. There are labels for \"Network Activity\" and \"Tools we developed,\" suggesting this is a demonstration of research methods or findings.\n\nOn the right side, there's a photo of a man giving a presentation. He's wearing a red shirt and a black hat, and he's speaking into a microphone. The background is dark, which makes him stand out.\n\nThe slide has a purple background with white text, and there's a Facebook logo in the top right corner, indicating this presentation might be part of a Facebook Live event or related to a Facebook page.\n\nThe title of the slide is \"Manipulating Non-neural Bioelectric Networks,\" which suggests the topic is about controlling or studying bioelectric processes in non-neural tissues or cells.\n\nOverall, this slide seems to be part of a scientific presentation, likely discussing research methods or findings related to bioelectric networks in non-neural systems."}, {"start": 1470, "end": 1500, "narrative": "The video appears to be a presentation or lecture on the topic of \"Manipulating Non-neural Bioelectric Networks.\" The main focus is on the manipulation of Vmem (membrane voltage) to enable organ-level reprogramming.\n\nThe presentation is divided into two main sections:\n\n1. Manipulating Non-neural Bioelectric Networks:\n   - This section discusses tools developed for manipulating non-neural bioelectric networks.\n   - It mentions the use of GZ mutants with altered gating, dominant negative Commissure proteins, and drug blockers of native channel openers.\n   - The tools developed include synaptic plasticity and intrinsic plasticity.\n\n2. Manipulation of Vmem enables organ-level reprogramming:\n   - This section shows images of a fish with a red eye and a black eye.\n   - It explains how manipulating Vmem can lead to reprogramming of organs, specifically mentioning the gut endoderm into a complete eye.\n   - There's a diagram showing how cells can be made to form a second head.\n\nThe presentation is accompanied by a live video feed of the presenter, who is wearing a red shirt and a hat. The background of the presentation is purple, and there's a Facebook logo visible in the top right corner.\n\nThe content suggests that this is a scientific lecture or presentation, likely given at a conference or academic event. The focus is on the innovative research being conducted in the field of bioelectricity and its potential applications in regenerative medicine and organ reprogramming."}, {"start": 1500, "end": 1530, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. The slide is titled \"Manipulation of Vn enables organ-level reprogramming\" and is presented by Facebook.\n\nThe slide contains several key elements:\n\n1. A large image of a fish with a red arrow pointing to its eye, labeled \"eye.\"\n\n2. A diagram showing how gut endoderm can be transformed into a complete eye.\n\n3. A section titled \"Cells make 2nd and 3rd head,\" with images of fish heads.\n\n4. A colorful image of a fish with a gradient from blue to green, labeled \"endogenous body wall.\"\n\n5. A text box explaining how to use drugs and RNAi to change the fate of a fragment.\n\n6. A series of images showing different stages of fish development, including a question mark.\n\n7. A photo of a man in a red jacket and black hat, likely the presenter, on the right side of the slide.\n\nThe slide seems to be discussing research on regenerative biology, specifically how manipulating a protein called Vn can lead to the reprogramming of organs at an organ-level. The presenter appears to be explaining how certain drugs and RNA interference techniques can be used to alter the developmental fate of specific tissue fragments in fish, potentially leading to the formation of new body parts like eyes or additional heads.\n\nThis presentation likely comes from a scientific conference or lecture series, given the formal layout and the presence of the Facebook logo, suggesting it may be part of a sponsored or partnered event."}, {"start": 1530, "end": 1560, "narrative": "The video appears to be a presentation slide from a scientific talk or lecture. The slide is titled \"Manipulation of Vn enables organ-level reprogramming\" and is presented by Facebook. The main content of the slide is divided into two sections:\n\n1. On the left side, there's an image of a fish with a red arrow pointing to its eye. Below this image, there's text that reads \"gut - endoderm into complete eye\" and \"cells - make 2nd head.\"\n\n2. On the right side, there's a detailed diagram showing a fish with a blue arrow pointing to its head. Below this diagram, there's text that reads \"endogenous body\" and \"use drug and RNAi to change Vn across fragment.\"\n\nThe slide seems to be discussing a scientific experiment or research related to manipulating a gene called Vn to reprogram organ development in fish. The Facebook logo in the top right corner suggests this presentation might be part of a Facebook-hosted event or series.\n\nIn the bottom right corner of the slide, there's a small image of a man, likely the presenter of the talk. He's wearing a red shirt and a hat, and appears to be speaking into a microphone.\n\nOverall, this slide appears to be part of a scientific presentation, possibly at a conference or seminar, focusing on genetic manipulation and its effects on organ development in fish."}, {"start": 1560, "end": 1590, "narrative": "The video appears to be a presentation slide from a scientific talk or lecture. It's divided into two main sections:\n\nOn the left side, there's a detailed diagram explaining how manipulation of Vn (likely a protein or gene) enables organ-level reprogramming. This section includes images of cells and tissues, with annotations showing how different cell types can be transformed into other structures, such as gut into complete eye and cells into head and body.\n\nOn the right side, there's a series of images showing brain shape and cell pattern changes. These images are labeled with \"Change\" and \"Control,\" suggesting a comparison between experimental and control groups.\n\nThe slide is titled \"Bioelectric circuit editing over-rides default genome-specified target morphology and switches among species,\" indicating that the research focuses on how bioelectric circuits can override genetic programming to alter the shape and structure of organisms.\n\nIn the bottom right corner, there's a small image of a man, likely the presenter, wearing a red shirt and a black hat. He's sitting at a desk with a laptop in front of him.\n\nThe slide also includes a Facebook logo in the top right corner, suggesting it may have been shared or presented on social media.\n\nOverall, this slide appears to be part of a presentation on advanced genetic and cellular manipulation techniques, showcasing how researchers are exploring ways to reprogram cells and tissues to form different structures, potentially leading to breakthroughs in regenerative medicine and evolutionary biology."}, {"start": 1590, "end": 1620, "narrative": "The video appears to be a presentation slide from a conference or lecture. It's titled \"Bioelectric circuit editing over-rides default genome-specified target morphology and switches among species\" and is presented by Michael Levin at NeurIPS 2016.\n\nThe slide is divided into two main sections:\n\n1. On the left, there's a diagram showing a bioelectric circuit with yellow arrows pointing to different images of embryos. The text explains that tweaking bioelectric network connectivity causes regeneration of head shapes appropriate to other species (e.g., Xenopus laevis).\n\n2. On the right, there's a series of images showing brain shape and cell pattern changes. These images are labeled \"Change\" and \"Control,\" likely demonstrating the effects of bioelectric circuit editing.\n\nThe slide is presented on a purple background with a white banner at the bottom displaying \"NeurIPS Michael Levin\" and the year 2016.\n\nIn the bottom right corner, there's a small inset image of Michael Levin, the presenter, who appears to be speaking at a podium.\n\nThis presentation seems to be discussing groundbreaking research in bioelectric circuit editing, showing how manipulating these circuits can lead to significant changes in the morphology and development of organisms, potentially even across different species."}, {"start": 1620, "end": 1650, "narrative": "The video appears to be a presentation slide from a scientific conference, specifically NeurIPS 2018, featuring Michael Levin. The slide is titled \"Bioelectric circuit editing over-rides default genome-specified target morphology and switches among species\" and is sponsored by Facebook.\n\nThe slide is divided into two main sections:\n\n1. On the left side, there's a diagram showing a bioelectric circuit with a yellow arrow pointing to a \"half head\" structure. Below this, there are images of different head shapes, including a normal head and a half head, with text explaining that tweaking bioelectric network connectivity causes regeneration of head shapes appropriate to other species (e.g., 500 million years distant).\n\n2. On the right side, there's a series of images showing brain shape and cell patterns, with labels \"D,\" \"E,\" \"F,\" \"G,\" \"H,\" \"I,\""}, {"start": 1650, "end": 1680, "narrative": "The video appears to be a presentation or lecture on the topic of bioelectric circuits and their role in controlling body patterns in flatworms. The main focus is on how altering the bioelectric circuit dynamics can lead to drastic changes in the body plan of these organisms.\n\nThe presentation is divided into two main sections:\n\n1. Drastic body-plan editing in flatworms:\n   - The slide shows a comparison between a normal flatworm and one with a bioelectric circuit altered after bisection.\n   - It mentions that flatworms with a normal planarian genome don't have to be flat, implying that their body shape can be significantly altered.\n\n2. Global pattern control by dynamics of bioelectric circuits:\n   - This section discusses the idea that information in the dynamics of electrical \"software\" can be used to rewrite goal states without editing the genomic hardware.\n   - It includes diagrams showing how bioelectric networks interact with each other and how this can influence the overall body pattern.\n\nThe presenter, a man with a beard and mustache, is visible in the bottom right corner of the screen. He's wearing a red shirt and a black hat, and he appears to be speaking into a microphone.\n\nThe presentation seems to be part of a scientific lecture or conference, possibly related to developmental biology or bioengineering. The content suggests that the researchers are exploring how manipulating bioelectric signals can lead to significant changes in the morphology of organisms, potentially opening up new avenues for studying and controlling biological development."}, {"start": 1680, "end": 1710, "narrative": "The video appears to be a presentation slide from a talk about bioelectric circuits and pattern memory. The slide is divided into two main sections:\n\n1. The left side contains a diagram showing a 3D structure with various colored dots and lines, likely representing neural connections or electrical pathways.\n\n2. The right side features a series of images showing different anatomical outcomes, suggesting that these are results of some kind of experiment or study.\n\nAt the bottom of the slide, there's a text box that reads \"Can Pattern Memory be Re-written?\" followed by \"distinct anatomical outcomes despite identical, genomic sequence.\"\n\nIn the bottom right corner, there's a small image of a man speaking into a microphone, presumably the presenter of the talk.\n\nThe slide seems to be exploring the concept of bioelectric circuits and their role in pattern memory, suggesting that these circuits may be able to influence anatomical outcomes even when the underlying genomic sequence remains the same. This could have implications for understanding how certain traits or conditions develop in organisms, potentially offering new avenues for research in genetics and developmental biology."}, {"start": 1710, "end": 1740, "narrative": "The video appears to be a presentation slide from a lecture or conference. The slide is titled \"Can Pattern Memory be Re-written?\" and is presented by someone on Facebook. The slide is divided into two main sections:\n\n1. The left side contains a series of images and text, likely illustrating different stages or examples related to pattern memory.\n\n2. The right side features a photo of a man, presumably the presenter, wearing a red shirt and a black hat.\n\nThe slide includes a caption that reads \"distinct anatomical outcomes despite identical, genetic sequence,\" suggesting the topic is about how different anatomical structures can result from the same genetic code.\n\nThe slide seems to be part of a larger discussion on developmental biology or genetics, exploring how patterns in biological development can be altered or \"rewritten.\"\n\nThe Facebook logo in the top right corner indicates that this presentation is being shared or viewed on the social media platform."}, {"start": 1740, "end": 1770, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. The slide is titled \"Revising the Pattern Engram\" and is presented by someone named \"facebook\" in the top right corner. The main content of the slide is divided into two sections:\n\n1. On the left side, there's a series of images showing different stages of a biological process. These images are labeled \"Revising the Pattern Engram\" and include:\n   - A normal anatomy image\n   - A normal muscle image\n   - An edited anatomy image\n   - An edited muscle image\n\n2. On the right side, there's a 3D model of a biological structure, likely representing a muscle or organ. This model is colored in shades of red and blue, with a green outline.\n\nBelow the images, there's a text box that reads: \"The biologic pattern doesn't indicate what the anatomy is now. It encodes the pattern that will guide anatomy if it is cut at a future time.\"\n\nIn the bottom right corner of the slide, there's a small image of a man wearing a red shirt and a black hat, likely the presenter of the lecture.\n\nThe slide seems to be discussing how biological patterns can influence future anatomical development, possibly in the context of regenerative medicine or developmental biology."}, {"start": 1770, "end": 1800, "narrative": "The video appears to be a presentation or lecture on developmental biology, specifically focusing on the concept of the \"Pattern Engram\" and its role in determining an organism's anatomy. The presentation is divided into two main sections:\n\n1. \"Revising the Pattern Engram\":\n   - This section seems to discuss the idea that the biophysical pattern encoded in an organism's cells doesn't necessarily indicate its current anatomy, but rather the potential anatomy it could develop into if cut at a future time.\n\n2. \"Long term: an organism's genome sets its long-term anatomy, doesn't it?\"\n   - This part of the presentation challenges the traditional view that an organism's genome solely determines its long-term anatomy. It suggests that there may be other factors at play.\n\nThe presentation includes various images and diagrams, likely illustrating different concepts related to developmental biology and anatomy. There's also a small inset image of a man, possibly the presenter, in the bottom right corner of the screen.\n\nThe overall tone of the presentation seems to be questioning established scientific theories and proposing new ideas about how an organism's anatomy is determined over time."}, {"start": 1800, "end": 1830, "narrative": "The video appears to be a presentation slide from a Facebook Live event. The slide is titled \"Long term: an organism's genome sets its long-term anatomy, doesn't it?\" and features a diagram with a worm-like creature and various scientific illustrations.\n\nThe main content of the slide includes:\n\n1. A large image of a worm with a cut-out section labeled \"Get and traffic pattern\" and \"Get and traffic pattern\" with arrows pointing to it.\n\n2. A smaller image of the same worm with a cut-out section labeled \"Get and traffic pattern\" and \"Get and traffic pattern\" with arrows pointing to it.\n\n3. A diagram with yellow and red boxes and lines connecting them, labeled \"Get and traffic pattern\" and \"Get and traffic pattern.\"\n\n4. Text that reads: \"surely a normal worm must result once ectopic heads are removed in plain water (more regents... since genome is wild-type)\"\n\nThe slide seems to be discussing the concept of how an organism's genome influences its long-term anatomy, specifically in the context of worms and their regenerative abilities.\n\nIn the bottom right corner of the slide, there's a small image of a man wearing a red shirt and a black hat, likely the presenter of the Facebook Live event.\n\nThe slide appears to be part of a scientific or educational presentation, possibly discussing genetic research or developmental biology."}, {"start": 1830, "end": 1860, "narrative": "The video appears to be a presentation slide from a Facebook event. The slide is titled \"Transient re-writing of bioelectric circuit state permanently changes target morphology without genomic editing.\" It's divided into two main sections:\n\nOn the left side, there's a detailed diagram showing a process of transient re-writing of bioelectric circuit states. This diagram includes images of cells and a flowchart-like structure with arrows indicating the process flow. The diagram seems to illustrate how altering bioelectric circuit states can lead to permanent changes in cell morphology without altering the genome.\n\nOn the right side, there's a smaller image of a man, likely the presenter, wearing a red shirt and a hat. This image is positioned in the bottom right corner of the slide.\n\nBelow the main diagram, there's a section titled \"Basic properties of memory\" which lists:\n- Long-term stability\n- Latency\n- Rewritability\n- Density conditional recall (v. 2.x)\n\nThe slide also includes a note about possible outcomes in Z.H.\n\nThe overall presentation seems to be discussing advanced biological research, specifically focusing on how bioelectric circuit states can be manipulated to change cell morphology, which could have significant implications for medical research and treatment."}, {"start": 1860, "end": 1890, "narrative": "The video appears to be a presentation slide from a Facebook event. The slide is divided into two main sections:\n\nOn the left side, there's a detailed diagram illustrating the process of transient re-writing of biocircuit states. This diagram shows how cutting and pasting biocircuit states can lead to permanent changes in target morphology without genomic editing. The diagram includes images of cells and arrows indicating the flow of the process.\n\nOn the right side, there's a photo of a man wearing a red shirt and a hat. He's seated at a desk with a laptop in front of him, suggesting he might be the presenter or speaker for this event.\n\nThe slide also contains text that explains the basic properties of memory, including long-term stability, latency, and the possibility of conditional recall.\n\nThe overall presentation seems to be about advanced biological or genetic research, possibly related to memory or cellular manipulation. The Facebook logo in the top right corner indicates this is part of a Facebook event or webinar."}, {"start": 1890, "end": 1920, "narrative": "The video appears to be a presentation slide from a Facebook event. It's divided into two main sections:\n\nOn the left side, there's a detailed diagram explaining a scientific concept. The diagram shows a complex process involving \"non-neuronal cells\" and \"neuronal-like cells.\" It illustrates how these cells interact, with arrows indicating the flow of information or processes. The diagram also includes images of what look like microscopic organisms or cells.\n\nOn the right side, there's a photo of a man giving a presentation. He's wearing a red shirt and a black hat, and he's speaking into a microphone. The background behind him is purple, and there's a Facebook logo visible.\n\nThe slide is titled \"Exploiting bioelectric signals to trigger anatomical subroutines.\" This suggests the presentation is about using electrical signals in non-neuronal cells to control or influence biological processes.\n\nThe slide seems to be part of a scientific or medical presentation, possibly discussing research on how bioelectric signals can be manipulated to trigger specific biological responses or processes."}, {"start": 1920, "end": 1950, "narrative": "The video appears to be a presentation slide from a talk or lecture. It's titled \"Exploiting bioelectric signals to trigger anatomical subroutines\" and is associated with Facebook. The slide is divided into two main sections:\n\nOn the left side, there's a detailed diagram showing a \"Control\" group and a \"Treated\" group. The diagram illustrates the process of manipulating bioelectric signals in microcell fates to trigger anatomical subroutines. It includes images of microcells and arrows indicating the direction of treatment.\n\nOn the right side, there's a photograph of a regenerated leg. The caption states, \"The regenerated leg is both the sensation and mobility.\"\n\nIn the bottom right corner, there's a small inset image of a man wearing a red shirt and a black hat. He appears to be the presenter or speaker for this talk.\n\nThe slide seems to be discussing advanced biological research, specifically focusing on how bioelectric signals can be used to control and regenerate body parts. The regenerated leg shown is likely an example of the successful application of this research.\n\nThis presentation appears to be part of a scientific or medical conference, possibly related to regenerative medicine or developmental biology."}, {"start": 1950, "end": 1980, "narrative": "The video appears to be a presentation slide from a scientific talk or lecture. It's divided into two main sections:\n\nOn the left side, there's a detailed explanation of a research method called \"Exploiting bioelectric signals to trigger anatomical subroutines.\" This section includes a diagram showing a \"Control\" group and a \"Treated\" group, with images of what looks like a worm or similar organism. The treated group seems to have undergone some kind of treatment or manipulation, as evidenced by the changes in its appearance.\n\nOn the right side, there's a photograph of a regenerated leg, which is described as having both sensation and mobility. This suggests the research is focused on regenerative medicine, particularly in the context of limb regeneration.\n\nAt the bottom of the slide, there's a section titled \"Next: mammalian applications,\" indicating that the research is moving towards applications in mammals, possibly humans.\n\nIn the bottom right corner, there's a small inset image of a man, likely the presenter of the talk. He's wearing a red shirt and a black hat, and appears to be speaking into a microphone.\n\nThe slide is presented on a purple background, and there's a Facebook logo visible in the top right corner, suggesting this presentation might be part of a Facebook Live event or webinar.\n\nOverall, this slide seems to be discussing cutting-edge research in regenerative medicine, specifically focusing on how bioelectric signals can be used to trigger the regeneration of body parts, with a particular emphasis on moving from animal models to potential human applications."}, {"start": 1980, "end": 2010, "narrative": "The video appears to be a presentation slide from a scientific lecture or conference. It's divided into two main sections:\n\nOn the left side, there's a detailed slide titled \"Bioelectric patterns over-ride genetic defects in vertebrate brain patterning.\" This section contains several graphs, charts, and images related to brain research. There are three main images showing different brain structures, likely from MRI or other imaging techniques. The graphs and charts seem to be analyzing data related to brain patterns and genetic defects.\n\nOn the right side, there's a smaller section with the Facebook logo and the word \"bioelectric\" visible. This part of the slide seems to be a separate topic or a different aspect of the presentation.\n\nIn the bottom right corner, there's a small video feed showing a man giving the presentation. He's wearing a red shirt and has a beard. He appears to be speaking into a microphone, likely explaining the content of the slide.\n\nThe overall presentation seems to be focused on advanced brain research, possibly exploring how bioelectric patterns can influence or override genetic defects in brain development."}, {"start": 2010, "end": 2040, "narrative": "The video appears to be a presentation or lecture on the topic of \"Bioelectric patterns over-ride genetic defects in vertebrate brain patterning.\" The main focus is on a slide that contains various scientific graphs, charts, and images related to this subject.\n\nThe slide is divided into several sections:\n\n1. A bar graph on the left side showing some data points.\n2. A circular diagram in the center with a gradient from red to blue.\n3. A line graph on the right side with a blue line and a red line.\n4. Four images below the main graphs, which seem to be microscopic or imaging results of brain tissue.\n\nIn the bottom right corner of the slide, there's a small image of a man, likely the presenter, wearing a red shirt and a black hat.\n\nThe slide also includes some text, but it's not clearly legible in the image provided.\n\nThe overall presentation seems to be discussing how bioelectric patterns can influence or override genetic defects in the development of vertebrate brains. This is an advanced scientific topic that likely involves concepts from neuroscience, genetics, and developmental biology.\n\nThe presenter appears to be explaining these complex concepts to an audience, possibly at a scientific conference or seminar. The use of multiple visual aids suggests an attempt to make the information more accessible and understandable to the viewers."}, {"start": 2040, "end": 2070, "narrative": "The video appears to be a presentation or lecture on the topic of \"Bioelectric patterns over-ride genetic defects in vertebrate brain patterning.\" The main focus is on a slide that's displayed on a large screen, which contains various scientific diagrams and images related to this subject.\n\nThe slide is divided into several sections:\n\n1. A title at the top: \"Bioelectric patterns over-ride genetic defects in vertebrate brain patterning\"\n\n2. A bar graph on the left side, showing some data points with red and blue bars.\n\n3. A central image that looks like a cross-section of a brain or neural structure, with a red and blue pattern.\n\n4. Two images on the right side, which seem to be microscopic views of brain tissue or neural structures.\n\n5. A graph on the bottom right, showing a curve with a peak.\n\nIn the bottom right corner of the screen, there's a small inset image of a man giving a presentation. He's wearing a red shirt and a black hat, and he's speaking into a microphone.\n\nThe presentation seems to be taking place in a lecture hall or conference room setting, as evidenced by the professional presentation setup and the audience visible in the background.\n\nOverall, the video appears to be a scientific lecture or presentation on the complex topic of how bioelectric patterns can influence brain development and potentially override genetic defects in vertebrates."}, {"start": 2070, "end": 2100, "narrative": "The video appears to be a presentation slide from a talk about the intersection of biology and technology. The slide is titled \"Evolution learned to exploit computational properties of electric circuits for large-scale anatomical homeostasis.\"\n\nThe main content of the slide includes:\n\n1. A diagram showing a circuit with a green and red area, connected to a brown object that resembles a biological structure, possibly a brain or neural network.\n\n2. A list of impacts on various fields:\n   - Cellular biophysics\n   - Primitive cognition\n   - Regenerative medicine\n   - Cognitive neuroscience\n   - Synthetic biogenesis\n   - Morphological computation\n   - Soft-body robotics\n\nThe slide also includes a Facebook logo in the top right corner, suggesting it might be part of a Facebook Live event or a presentation shared on the platform.\n\nIn the bottom right corner, there's a small image of a man giving a presentation. He's wearing a red shirt and a black hat, and he appears to be speaking into a microphone.\n\nThe overall theme of the presentation seems to be about how biological systems have evolved to use electrical circuits for complex functions, and how this knowledge can be applied to various fields of science and technology."}, {"start": 2100, "end": 2130, "narrative": "The video appears to be a presentation slide from a talk or lecture. The slide is predominantly purple with white text and features a diagram on the left side. The diagram shows a circuit board with a green square and a blue arrow pointing to a brown object that resembles a brain or neural structure.\n\nThe slide is titled \"Evolution learned to exploit computational properties of electric circuits for large-scale anatomical homeostasis.\" Below the title, there's a subtitle that reads \"Cracking the biologic code = reprogramming biological software.\"\n\nOn the right side of the slide, there's a list of impacts, which includes:\n- Cellular biophysics\n- Primitive cognition\n- Regenerative medicine\n- Cognitive neuroscience\n- Soft-body robotics\n\nIn the bottom right corner, there's a small image of a man with a beard, wearing a red shirt and a lanyard. This appears to be the presenter of the talk.\n\nThe slide also includes a section titled \"Outline\" with bullet points, but the text is too small to read clearly.\n\nThe overall theme of the presentation seems to be about the intersection of biology and technology, specifically how biological systems can be understood and potentially manipulated using principles of electrical engineering and computer science. The presenter is likely discussing how understanding these principles could lead to advancements in various fields, including medicine, robotics, and cognitive neuroscience."}, {"start": 2130, "end": 2160, "narrative": "The video shows a presentation slide with a dark purple background and white text. The slide is titled \"Outline\" and is associated with Facebook. It contains four bullet points:\n\n1. Brain-body plasticity: seeing from a tail\n2. Somatic cognition in the body: decision-making during self-editing of anatomy\n3. Bioelectric mechanisms of non-neural pattern control\n4. The future: regenerative medicine, synthetic living machines, novel AI architectures\n\nAt the bottom of the slide, there's a question: \"Could a highly robust (non-brittle) ML roadmap be based on non-neural architectures? Seeking collaborators!\"\n\nIn the bottom right corner of the slide, there's a small inset image of a man with a beard and mustache wearing a red shirt and a black hat. He appears to be speaking into a microphone, suggesting he's the presenter of this talk.\n\nThe slide seems to be discussing advanced topics in neuroscience, bioelectricity, and artificial intelligence, with a focus on non-neural architectures for machine learning. The presenter is seeking collaborators for a project in this area."}, {"start": 2160, "end": 2190, "narrative": "The video displays a PowerPoint presentation slide with a dark purple background. The slide is titled \"Somatic Cells: bone, heart, pancreas\" and is associated with BMC Cell Biology. On the left side of the slide, there's a white box containing text and a blue box with additional text. The right side of the slide features a black box with white text.\n\nIn the bottom right corner of the slide, there's a small image of a man speaking into a microphone. He's wearing a red jacket and a black hat, and appears to be giving a presentation.\n\nThe slide contains several sections of text, including:\n\n- \"Somatic Cells: bone, heart, pancreas\"\n- \"BMC Cell Biology\"\n- \"Learning Theories of Pancreatic Beta Cell Dysfunction in Diabetes\"\n- \"Do Cells Behave Like a Neural Network?\"\n- \"Cardiac Memory: The Heart and the Brain Remember the Same Memory?\"\n\nThe slide seems to be part of a scientific presentation, likely discussing research related to somatic cells and their functions in different organs. The mention of \"Learning Theories of Pancreatic Beta Cell Dysfunction in Diabetes\" suggests a focus on diabetes research, while the question \"Do Cells Behave Like a Neural Network?\" implies an exploration of cellular behavior and its similarities to neural networks.\n\nThe small image of the speaker in the corner adds a personal touch to the presentation, indicating that this is likely a live or recorded lecture rather than a static slide."}, {"start": 2190, "end": 2220, "narrative": "The video appears to be a presentation or lecture on the topic of \"Pattern Memory in Non-Neural Networks: Extending Connectionism Beyond the Brain.\" The presentation is divided into two main sections:\n\n1. The first section focuses on \"Pattern Memory in Non-Neural Networks.\" It includes a slide with a diagram showing connections between different nodes, likely representing a network model. There's also a small inset photo of a man, possibly the presenter.\n\n2. The second section is titled \"Machine Learning Platforms - 'Robot Scientist' for Cracking the Software of Life.\" This part of the presentation seems to discuss the application of machine learning in scientific research, particularly in understanding biological systems.\n\nThroughout the video, there's a small inset window showing a man in a red jacket, who is likely the presenter. He appears to be speaking or explaining the content of the slides.\n\nThe overall theme of the presentation seems to be exploring how concepts of neural networks and machine learning can be applied beyond traditional biological systems, potentially to understand complex biological processes or even to develop new scientific discoveries."}, {"start": 2220, "end": 2250, "narrative": "The video appears to be a presentation slide from a scientific talk or lecture. The slide is titled \"Machine Learning Platforms - 'Robot Scientist' for cracking the Software of Life\" and is associated with Scientific Reports, a publication from Nature Research.\n\nThe slide contains several key elements:\n\n1. A complex diagram on the left side, likely representing a network or biological system.\n\n2. Text explaining the use of machine learning algorithms to identify network models and their functional details.\n\n3. A section titled \"Research Article\" with a brief description of the study.\n\n4. A \"Thank you\" section at the bottom, listing names and affiliations of researchers involved in the project.\n\n5. A small inset image of a man in a red sweater, presumably the presenter of the talk.\n\nThe slide seems to be discussing the application of machine learning in biological research, specifically in understanding complex biological systems or networks. The \"Robot Scientist\" mentioned in the title likely refers to a system or platform that uses artificial intelligence to analyze and interpret biological data.\n\nThe slide is presented on a purple background, which is typical for scientific presentations to make text and diagrams stand out clearly. The overall layout is professional and designed to convey complex scientific information in a structured manner.\n\nThis presentation appears to be part of a larger discussion on the intersection of machine learning and biological research, showcasing how advanced computational methods are being used to unravel the complexities of life's \"software.\""}, {"start": 2250, "end": 2280, "narrative": "The video appears to be a presentation slide with a purple background. On the left side, there's a white square containing a brown object that looks like a worm or caterpillar. This object is shown in different positions across multiple frames, suggesting it's moving or changing shape.\n\nOn the right side of the slide, there's a photo of a group of people sitting at a table, likely in a classroom or meeting setting. Below this photo, there's a Facebook logo and the word \"facebook\" written in white text.\n\nAt the bottom of the slide, there's a photo of a man wearing a red jacket and white shirt. He's sitting at a desk with a microphone in front of him, suggesting he might be the presenter or speaker for this presentation.\n\nThe slide also contains text that reads \"Openings for post-docs and visiting scientists!\" followed by a list of topics:\n1. Robotic bodies for biological systems\n2. Brain cognition - models of tissue and learning in cells\n3. New M4 platforms based on non-neural architectures\n4. Machine learning for pattern recognition in medical imaging\n5. CS applications for biotechnology, regenerative medicine in birth defects, regeneration, tumor programming\n\nThis presentation seems to be about research opportunities in various scientific fields, particularly focusing on robotics, neuroscience, and medical applications."}, {"start": 2280, "end": 2310, "narrative": "The video appears to be a presentation slide with a dark purple background. On the left side, there's a large image of a brown object, possibly a piece of food or a small animal, on a white surface. This image is repeated multiple times across the video.\n\nOn the right side, there are three smaller images:\n1. A group of people sitting at a table, possibly in a classroom or meeting setting.\n2. A close-up of a man's face, likely the presenter.\n3. A large crowd of people, suggesting a conference or lecture hall.\n\nThe slide contains text that reads:\n\"Openings for post-docs and visiting scientists!\n1) robotic bodies for biological systems\n2) brain cognition - models and learning in cells\n3) new AI platforms based on non-neural architectures\n4) machine learning for pattern recognition in medicine\nin birth defects, regeneration, tumor programming\"\n\nAt the bottom of the slide, there's a URL: \"http://www.icsb2014.org\"\n\nThe video seems to be promoting research opportunities in various scientific fields, particularly in artificial intelligence and biological systems."}, {"start": 2310, "end": 2340, "narrative": "The video displays a PowerPoint presentation slide with a dark purple background. The slide is titled \"Openings for post-docs and visiting scientists!\" and features several key points:\n\n1. Robotic bodies for biological systems\n2. Brain cognition: models of tissue learning in cells\n3. New AI platforms based on non-neural architectures\n4. CS applications for pattern recognition in biomedicine\n5. Machine learning for regenerative medicine in birth defects, regeneration, tumor programming\n\nOn the right side of the slide, there's a photo of a group of people sitting at a table, likely at a conference or meeting. Below this photo, there's a Facebook logo.\n\nIn the bottom right corner of the slide, there's a small inset image showing a man speaking at a podium. He's wearing a red jacket and a black hat, and appears to be giving a presentation.\n\nThe slide also includes a website address: www.robobiol.org\n\nThis presentation seems to be about opportunities for post-doctoral researchers and visiting scientists in the field of robotics and artificial intelligence, particularly focusing on applications in biological systems and medicine."}, {"start": 2340, "end": 2370, "narrative": "The video displays a PowerPoint presentation slide with a dark purple background. The slide is titled \"Openings for post-docs and visiting scientists!\" and features several key points:\n\n1. Robotic bodies for biological systems\n2. Brain cognition: models of decision-making\n3. New AI platforms based on non-architectural models\n4. Machine learning for bioinformatics, regenerative medicine, and applications in birth defects, regeneration, and tumor programming\n\nOn the right side of the slide, there's a photo of a group of people sitting at a table, likely in a classroom or meeting room setting. Below this photo, there's a Facebook logo.\n\nIn the bottom right corner of the slide, there's a small photo of a man with a beard and mustache wearing a red shirt and a black hat. He appears to be giving a presentation or lecture.\n\nThe slide also includes a website address: www.robosciences.org\n\nThis presentation seems to be about opportunities for post-doctoral researchers and visiting scientists in the field of robotics and artificial intelligence, particularly focusing on applications in biological systems and medical research."}, {"start": 2370, "end": 2400, "narrative": "The video appears to be a presentation slide with a purple background. On the left side, there's a large image of a biological sample, possibly a tissue or cell culture, with a grid pattern overlay. This image seems to be the main focus of the slide.\n\nOn the right side, there's a smaller image showing a group of people sitting at a table, likely in a classroom or meeting setting. This image is accompanied by text that reads \"facebook\" and \"robocast.\"\n\nAt the bottom of the slide, there's a photo of a man wearing a red shirt and a hat. He's standing in front of a podium, suggesting he might be the presenter or speaker for this presentation.\n\nThe slide also contains text that mentions \"Openings for post-docs and visiting scientists!\" and lists several research areas, including:\n1. Robotic bodies for biological systems\n2. Brain cognition - models of decision-making\n3. New AI platforms based on non-neural architectures\n4. Machine learning for pattern recognition in medicine\n5. CS applications for biotechnology, regenerative medicine in birth defects, regeneration, tumor programming\n\nThe overall layout suggests this is a presentation slide for a research institution or university, highlighting current research areas and possibly job openings for post-doctoral researchers and visiting scientists."}, {"start": 2400, "end": 2430, "narrative": "The video displays a PowerPoint presentation slide with a dark purple background. The slide is titled \"Openings for post-docs and visiting scientists!\" and features several key points:\n\n1. Robotic bodies for biological systems\n2. Brain cognition: models of tissue and learning in cells\n3. New AI platforms based on non-neural architectures\n4. CS applications in bioinformatics, regenerative medicine, and pattern recognition\n\nOn the right side of the slide, there's a photo of a group of people sitting at a table, likely in a classroom or meeting room setting. Below this photo, there's a Facebook logo.\n\nIn the bottom right corner of the slide, there's a photo of a man wearing a red shirt and a black hat. He appears to be giving a presentation or lecture.\n\nThe slide also includes a website address: www.robosciences.org\n\nThe overall presentation seems to be about opportunities for post-doctoral researchers and visiting scientists in the field of robotics and artificial intelligence, with a focus on applications in biological systems and medical research."}, {"start": 2430, "end": 2460, "narrative": "The video appears to be a presentation or lecture taking place in a conference or seminar setting. The main focus is on a man in a red shirt standing at a podium, likely delivering a speech or presentation. He's wearing a lanyard with a name tag, which suggests this is a formal event.\n\nThe background shows a large screen displaying a slide with text and images. The slide mentions \"Openings for post-docs and visiting scientists!\" and lists several topics related to robotics, artificial intelligence, and machine learning. There's also a photo of a group of people, possibly attendees or participants in the event.\n\nThe video quality is somewhat blurry, which makes it difficult to discern fine details. However, the overall atmosphere suggests a professional scientific or academic conference, with the speaker addressing an audience about research opportunities and advancements in robotics and AI.\n\nThe Facebook logo is visible in the corner, indicating that this presentation might be live-streamed or recorded on the social media platform."}, {"start": 2460, "end": 2490, "narrative": "The video shows a man speaking at what appears to be a conference or seminar. He's standing at a podium with a microphone, addressing an audience. The man is wearing a white sweater and has a lanyard around his neck, suggesting he's a speaker or presenter at the event.\n\nThe audience is seated in rows, facing the speaker. They seem engaged, with many looking directly at the man speaking. The background is dark, which helps the speaker stand out.\n\nIn the top right corner of the video, there's a \"facebook\" watermark, indicating this is likely a Facebook Live stream or recording of the event.\n\nThe video appears to be a series of still images or screenshots, rather than continuous footage. This gives it a somewhat static feel, with the speaker and audience members appearing in the same positions across multiple frames.\n\nOverall, it looks like a professional presentation or lecture taking place at a formal event, with the speaker addressing a sizable audience."}, {"start": 2490, "end": 2520, "narrative": "The video appears to be a recording of a conference or panel discussion. The main focus is on a man standing at a podium, speaking into a microphone. He's wearing a white sweater and has a lanyard around his neck, suggesting he's a speaker or panelist at the event.\n\nThe background is filled with an audience, predominantly male, who seem to be engaged in the presentation. The audience members are wearing lanyards as well, indicating they're likely attendees or participants at the conference.\n\nThe setting is indoors, with a dark background that contrasts with the white podium and the speaker's light-colored sweater. The overall atmosphere suggests a professional or academic event.\n\nIn the bottom right corner of the video, there's a watermark that reads \"facebook,\" indicating this is likely a Facebook Live stream or a video posted on Facebook.\n\nThe video seems to be paused or stopped at the end, as the speaker is no longer visible in the frame."}, {"start": 2520, "end": 2550, "narrative": "The video shows a man giving a presentation at a conference. He's seated at a podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red sweater over a white shirt. He also has a white lanyard around his neck.\n\nThe background is completely black, which makes the speaker stand out prominently. There's a blue banner at the bottom of the screen with white text that reads \"NeurIPS Michael Levin,\" indicating the event and speaker's name.\n\nThe man appears to be in the middle of his presentation, as he's looking slightly to the left and speaking into the microphone. The video quality is clear, and the lighting is focused on the speaker, highlighting his features and the text on the banner.\n\nOverall, it's a professional-looking presentation setup, typical of academic or industry conferences. The speaker seems engaged and focused on delivering his talk."}, {"start": 2550, "end": 2580, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a podium with a microphone, wearing a red shirt and a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man has short brown hair and a beard. He's gesturing with his hands as he speaks, which suggests he's in the middle of explaining something. The video seems to be a recording of a live event, possibly from a Facebook page given the \"facebook\" text visible in the corner of the screen.\n\nThe speaker appears to be engaged and passionate about his topic, as evidenced by his animated hand movements and focused expression. The overall setting looks professional, with the speaker dressed appropriately for a formal presentation.\n\nThe video quality is clear enough to see the details of the speaker and his surroundings, but it's not high-definition. The lighting is focused on the speaker, highlighting his features and the podium.\n\nThis appears to be a typical presentation setup you might see at a tech conference, academic seminar, or similar professional event. The speaker seems to be sharing information or insights related to his area of expertise."}, {"start": 2580, "end": 2610, "narrative": "The video appears to be a series of clips from what seems to be a conference or event. The footage shows multiple speakers addressing an audience, with a focus on a man in a red shirt who is speaking at a podium. This individual is the most prominent figure in the video, appearing in several different shots.\n\nThe man in the red shirt has short brown hair and a beard. He's wearing a red long-sleeve shirt and has a white lanyard around his neck. He's speaking into a microphone at a podium, with his right hand raised as if gesturing or emphasizing a point.\n\nIn the background, there's a dark backdrop, which is typical for conference settings. The audience is visible, though not in great detail, suggesting this is a professional or academic event.\n\nThere are also other speakers shown in the video, including a man in a black suit jacket and white shirt, who appears to be speaking into a microphone on a stage. This speaker is surrounded by other people, some of whom are wearing black hats.\n\nThe video has a watermark that reads \"facebook\" in the top right corner of each frame, indicating it may have been shared or recorded on Facebook.\n\nThe overall tone of the video suggests it's from a formal event, possibly a tech conference, academic lecture, or similar gathering where multiple speakers are addressing an audience."}, {"start": 2610, "end": 2640, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a podium with a laptop on it, and he's wearing a red sweater and a lanyard with a name tag. The background is dark, suggesting it's a stage setting.\n\nThe man has short dark hair and a beard, and he's gesturing with his hands as he speaks. He seems to be in the middle of explaining something, possibly using the laptop as a visual aid.\n\nThe podium has a sign that reads \"Palais des congrès de Montréal,\" indicating this is taking place at the Montreal Convention Center. There's also a Facebook logo visible in the corner of the screen, suggesting this might be a live stream or recording of the event.\n\nThe video appears to be a series of still images or screenshots rather than continuous footage, as the man's position and gestures are consistent across multiple frames."}, {"start": 2640, "end": 2670, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a podium with a microphone, wearing a red sweater and a lanyard around his neck. The background is dark, which makes the speaker stand out prominently.\n\nThe man has short brown hair and a beard, and he's gesturing with his hands as he speaks. He seems to be in the middle of explaining something, possibly about technology or a related topic.\n\nIn the bottom right corner of the video, there's a Facebook logo, indicating that this presentation might be from a Facebook event or is being shared on the platform.\n\nThe setting looks professional, with the speaker well-lit against the dark background. The podium has a laptop on it, suggesting he might be using slides or digital notes for his presentation.\n\nOverall, it appears to be a formal presentation or lecture, likely related to tech or digital topics, given the Facebook branding and the speaker's attire."}, {"start": 2670, "end": 2700, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red long-sleeve shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man is gesturing with his hands as he speaks, which suggests he's in the middle of explaining something. His facial expression appears focused and engaged, indicating he's actively delivering his presentation.\n\nIn the bottom right corner of the video, there's a watermark that says \"facebook,\" suggesting this presentation might be from a Facebook event or was shared on the platform.\n\nThe video seems to be a professional setting, possibly related to technology or social media given the Facebook watermark. The speaker appears to be the main focus of the video, with no other visible elements or audience members in the frame.\n\nOverall, this video captures a moment of public speaking, likely at a tech or social media-related event, with the speaker delivering a presentation to an unseen audience."}, {"start": 2700, "end": 2730, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red long-sleeve shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man seems to be in the middle of delivering his speech, as he's gesturing with his hands while speaking. His facial expression suggests he's engaged and passionate about the topic he's discussing.\n\nIn the bottom right corner of the video, there's a watermark that reads \"facebook,\" indicating this presentation was likely shared or recorded on the Facebook platform.\n\nThe video appears to be a professional setting, possibly related to technology or a similar field, given the Facebook watermark and the formal presentation style."}, {"start": 2730, "end": 2760, "narrative": "The video appears to be a series of screenshots from a Facebook Live stream featuring a man speaking at what seems to be a conference or event. The man has short brown hair and a beard, and he's wearing a red shirt with a white lanyard around his neck. He's standing behind a podium with a microphone, addressing an audience.\n\nThe background shows a large crowd of people, many of whom are wearing lanyards, suggesting this is a professional or organized event. The audience members are seated in rows, facing the speaker.\n\nThe Facebook logo is visible in the top right corner of each screenshot, indicating this is a live stream from the social media platform.\n\nThe man appears to be in the middle of delivering a speech or presentation, as evidenced by his posture and the microphone in front of him. The audience seems engaged, with many people looking directly at the speaker.\n\nThe lighting is bright, likely from stage lights, which helps illuminate the speaker and the audience clearly.\n\nOverall, this video captures a moment from a professional event or conference, with the speaker addressing a sizable audience through a Facebook Live stream."}, {"start": 2760, "end": 2790, "narrative": "The video appears to be a compilation of footage from a conference or event. It features a man with a beard and short brown hair speaking into a microphone. He's wearing a red shirt and has a lanyard around his neck, suggesting he's a speaker or presenter at the event.\n\nThe footage is divided into two main sections:\n\n1. The first part shows the man standing at a podium, addressing an audience. The audience is visible in the background, with many people wearing lanyards, indicating they're attendees or participants. The setting looks like a large conference room or auditorium.\n\n2. The second part shows the same man seated at a desk, still speaking into a microphone. This portion appears to be from a different angle or possibly a different part of the event.\n\nThroughout the video, there's a watermark that says \"facebook\" in the top right corner, suggesting this content may have been shared or recorded on Facebook.\n\nThe overall atmosphere seems professional and focused, typical of a business or technology conference. The man appears to be delivering a presentation or speech, though the specific content of his talk isn't clear from the video alone."}, {"start": 2790, "end": 2820, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's seated at a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red long-sleeve shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man seems to be in the middle of his speech, as he's looking slightly to the left and appears to be speaking. There's a Facebook logo visible in the bottom right corner of the screen, suggesting this presentation might be part of a Facebook event or broadcast.\n\nThe video is a series of still images, likely from a live stream or recording of the presentation. The man's expression and posture indicate he's engaged in delivering his talk, possibly discussing a topic related to technology or social media given the Facebook branding.\n\nOverall, the video captures a professional setting where the speaker is addressing an audience, likely sharing insights or information relevant to the Facebook platform or digital communication in general."}, {"start": 2820, "end": 2850, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red long-sleeve shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man seems to be in the middle of delivering his speech, as he's looking slightly to the left and appears to be speaking. There's a Facebook logo visible in the bottom right corner of the screen, suggesting this presentation might be part of a Facebook event or livestream.\n\nThe video is a series of still images, likely from a live stream or recording of the presentation. The man's posture and expression indicate he's engaged in his talk, possibly discussing a topic related to technology or social media, given the Facebook branding.\n\nOverall, the video captures a professional speaking engagement, with the speaker appearing focused and the setting designed to highlight the presenter against a dark background."}, {"start": 2850, "end": 2880, "narrative": "The video appears to be a series of screenshots from a presentation or conference. The main focus is on a man with brown hair and a beard, wearing a red shirt and a white lanyard with a badge. He's standing behind a podium with a microphone, giving a speech or presentation. The background is dark, which makes the speaker stand out.\n\nThe man seems to be in the middle of his presentation, as he's gesturing with his hands and looking at the audience. The Facebook logo is visible in the corner of each screenshot, suggesting this might be a live stream or recording of a Facebook event.\n\nIn one of the screenshots, there's a group of people standing behind the speaker, including a man wearing a black hat and another with a bald head and glasses. This could indicate a panel discussion or Q&A session.\n\nThe overall atmosphere appears professional and formal, typical of a business or tech conference. The speaker seems engaged and passionate about his topic, which is likely related to technology or social media given the Facebook branding.\n\nThe video captures the essence of a modern conference presentation, with the speaker addressing an audience and possibly interacting with other panelists."}, {"start": 2880, "end": 2910, "narrative": "The video appears to be a recording of a presentation or lecture. The scene is set in what looks like a conference or seminar room. The main focus is on a man standing at a podium, delivering a speech or presentation. He's wearing a red sweater and has a lanyard around his neck, which suggests he might be a speaker or presenter at an event.\n\nThe man is holding a microphone and gesturing with his hands as he speaks, indicating he's in the middle of explaining something to the audience. Behind him, there's a black curtain, which is typical for presentation settings to help focus attention on the speaker.\n\nIn the background, there are other people visible, some of whom are also wearing lanyards. This reinforces the idea that this is a formal event with multiple participants or attendees.\n\nThe video quality is not particularly high, and there's a watermark visible in the corner that says \"facebook,\" suggesting this might be a recording from a Facebook Live stream or a video posted to Facebook.\n\nOverall, the video captures a moment from what seems to be a professional or academic presentation, with the speaker engaging with his audience and sharing information or insights on a particular topic."}, {"start": 2910, "end": 2940, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a white podium with a microphone, wearing a red long-sleeve shirt and a white lanyard with a black strap around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man has short brown hair and a beard. He's gesturing with his hands as he speaks, which suggests he's in the middle of explaining something. The Facebook logo is visible in the bottom right corner of the screen, indicating this is likely a Facebook Live stream or a video posted on Facebook.\n\nThe speaker seems to be addressing an audience, though we can't see them in the frame. The overall setting appears professional and formal, typical of a business or academic presentation.\n\nThe video quality is clear, allowing us to see the speaker's facial expressions and gestures in detail. The lighting is focused on the speaker, highlighting his features and the podium.\n\nThis presentation seems to be part of a larger event, possibly a tech conference or business seminar, given the professional setup and the Facebook branding."}, {"start": 2940, "end": 2970, "narrative": "The video appears to be a Facebook Live stream of a presentation or lecture. It shows a man in a red shirt standing at a podium, speaking to an audience. The man has short brown hair and a beard, and he's wearing a lanyard around his neck. The background is dark, which makes the speaker stand out.\n\nThe audience is seated in rows of chairs, facing the speaker. Many of them are using their phones, likely to take notes or follow along with the presentation. There's a large screen visible behind the speaker displaying a slide with text and an image of a hand.\n\nThe Facebook logo is visible in the bottom right corner of the screen, indicating this is a live stream from the social media platform.\n\nThe video seems to be a professional or educational event, possibly a conference or seminar. The speaker appears to be discussing a topic related to the slide on the screen, which mentions \"Facebook\" and \"Facebook for Business.\"\n\nThe audience is diverse, with people of various ages and backgrounds. Some are actively engaged, while others are more focused on their phones.\n\nOverall, this video captures a moment from what looks like an informative presentation or lecture, with the speaker addressing a live audience and sharing information about Facebook's business tools or strategies."}, {"start": 2970, "end": 3000, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red t-shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man seems to be in the middle of delivering his speech, as he's gesturing with his hands while speaking. His facial expression suggests he's engaged and passionate about the topic he's discussing.\n\nIn the bottom right corner of the video, there's a watermark that reads \"facebook,\" indicating this presentation was likely streamed or recorded on Facebook.\n\nThe video appears to be a professional setting, possibly related to technology or social media given the Facebook watermark. The speaker seems to be explaining something in detail, though the specific content of his presentation isn't visible in the video.\n\nOverall, this video captures a moment of public speaking, with the speaker fully engaged in delivering his message to an audience."}, {"start": 3000, "end": 3030, "narrative": "The video appears to be a Facebook Live stream featuring a man speaking at what looks like a conference or event. The man is wearing a blue shirt and has a lanyard around his neck, suggesting he's a participant or speaker at the event. He's standing in front of a microphone, addressing an audience that's visible in the background.\n\nThe setting seems to be indoors, with a dark background and a crowd of people seated behind the speaker. The audience members are also wearing lanyards, indicating they're attendees of the same event.\n\nThe video quality is somewhat grainy, which is typical for Facebook Live streams. There's a watermark in the top right corner that reads \"facebook,\" confirming this is a Facebook Live broadcast.\n\nThe man appears to be speaking passionately, with his hands gesturing as he talks. The audience seems engaged, with some people looking directly at the speaker and others looking down at their phones.\n\nOverall, this video captures a moment from what looks like a professional or academic conference, with the speaker addressing an attentive audience."}, {"start": 3030, "end": 3060, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's seated at a white podium with a microphone in front of him. The man has short brown hair and a beard, and he's wearing a red long-sleeve shirt with a white lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man seems to be in the middle of his speech, as he's gesturing with his hands while speaking. His facial expression suggests he's engaged and passionate about the topic he's discussing.\n\nIn the bottom right corner of the screen, there's a watermark that reads \"facebook,\" indicating this presentation is being broadcast or recorded on Facebook.\n\nThe video appears to be a live stream or recording of a professional or academic presentation, with the speaker addressing an audience (though the audience itself isn't visible in the frame)."}, {"start": 3060, "end": 3090, "narrative": "The video appears to be a recording of a presentation or lecture taking place in a large auditorium. The scene is dimly lit, with the main focus on a man standing at a podium. He's wearing a red shirt and has a lanyard around his neck, suggesting he's a speaker or presenter at an event.\n\nThe man is speaking into a microphone, gesturing with his hands as he addresses the audience. Behind him, there's a table with a water bottle and a red object that could be a book or folder. The audience is seated in rows of chairs, facing the speaker.\n\nThe Facebook logo is visible in the bottom right corner of the screen, indicating this is likely a live stream or recording of the event on the social media platform.\n\nThe setting and the man's attire suggest this is a formal presentation, possibly at a conference, seminar, or academic event. The audience appears engaged, with many people looking directly at the speaker.\n\nOverall, the video captures a moment of public speaking, with the speaker delivering a presentation to a sizable audience in a professional setting."}, {"start": 3090, "end": 3120, "narrative": "The video shows a man giving a presentation at what appears to be a conference or seminar. He's standing behind a podium with a microphone, wearing a red shirt and a lanyard around his neck. The background is completely black, which makes the speaker stand out prominently.\n\nThe man has short brown hair and a beard. He's gesturing with his hands as he speaks, which suggests he's in the middle of explaining something. The Facebook logo is visible in the bottom right corner of the screen, indicating this is likely a live stream or recording from a Facebook event.\n\nThe speaker seems to be addressing an audience, though we can't see them in the frame. The overall setting appears professional and formal, typical of a business or academic presentation.\n\nThe video is in color, and the lighting is focused on the speaker, highlighting his features and the red of his shirt. The image quality is clear, allowing for easy observation of the speaker's expressions and gestures.\n\nThis presentation seems to be part of a larger event, possibly a tech conference or industry gathering, given the Facebook branding and the professional setup."}, {"start": 3120, "end": 3150, "narrative": "The video appears to be a series of clips from what seems to be a conference or panel discussion. The footage is divided into three distinct sections:\n\n1. The first part shows a man in a blue shirt standing at a microphone. He has short brown hair and is speaking to an audience. The background is dark, suggesting an indoor setting.\n\n2. The second section features a man in a red shirt sitting at a podium. He has short brown hair and is also speaking into a microphone. The background is black, creating a stark contrast with the speaker.\n\n3. The final part shows a man in a black coat and hat standing at a microphone. He has short brown hair and is speaking to an audience. The background is white, which makes the speaker stand out.\n\nThroughout all three sections, there are other people visible in the background, some of whom are also wearing lanyards. The overall atmosphere suggests a formal event or presentation.\n\nThe video has a watermark in the top right corner that reads \"facebook,\" indicating it may have been shared or recorded on the social media platform."}, {"start": 3150, "end": 3180, "narrative": "The video appears to be a recording of a presentation or lecture. The scene is set in a large auditorium with a dark background, creating a professional and focused atmosphere. The main subject is a man standing at a podium, delivering a speech or presentation. He is wearing a red shirt and has a lanyard around his neck, which suggests he might be a speaker or presenter at a conference or seminar.\n\nThe man is speaking into a microphone, and his posture indicates he is engaged in his presentation. Behind him, there's a table with a water bottle and a red object, possibly a book or folder. The audience is seated in rows of chairs, facing the speaker, and appears to be paying attention to the presentation.\n\nThe video is divided into several segments, each showing different angles of the speaker and audience. Some segments focus on the speaker's face, while others show the audience's reaction or the overall setting of the auditorium.\n\nThe Facebook logo is visible in the corner of the screen, indicating that this presentation or lecture was likely shared or recorded on Facebook.\n\nOverall, the video captures a formal presentation or lecture setting, with the speaker engaging an attentive audience in what appears to be an important or informative event."}, {"start": 3180, "end": 3210, "narrative": "The video appears to be a series of screenshots from a presentation or lecture. The main focus is on a man standing at a podium, likely giving a speech or presentation. He has short brown hair and a beard, and is wearing a red shirt with a white lanyard around his neck. The background is dark, which helps highlight the speaker.\n\nThe man is speaking into a microphone, and his facial expressions suggest he's engaged in his topic. The podium has a microphone and a pen on it, indicating this is a formal presentation setting.\n\nIn the bottom right corner of each screenshot, there's a \"facebook\" watermark, suggesting these images might be from a Facebook Live stream or a Facebook video.\n\nThe final screenshot shows a different scene with a crowd of people, some of whom are wearing hats. This could be the audience for the presentation or a different event altogether.\n\nOverall, the video seems to capture a professional speaking engagement, possibly at a conference or seminar. The consistent appearance of the speaker across multiple screenshots suggests this is a single, continuous presentation rather than a montage of different speakers."}, {"start": 3210, "end": 3240, "narrative": "The video appears to be a Facebook Live stream featuring a man speaking into a microphone. He's wearing a black baseball cap, glasses, and a black jacket over a blue shirt. The man seems to be addressing an audience, though the faces of the people in the crowd are blurred for privacy reasons.\n\nThe setting looks like a conference or event, with a stage visible in the background. There's a metal railing behind the speaker, and some people in the audience are wearing lanyards, suggesting this might be a professional or organized event.\n\nThe video quality is somewhat grainy, which is typical for live streams. The Facebook logo is visible in the corner of the screen, confirming that this is indeed a Facebook Live broadcast.\n\nOverall, it seems to be a public speaking event or presentation, with the speaker engaging with the audience. The blurred faces of the audience members indicate that this is likely a public event where privacy is being respected."}, {"start": 3240, "end": 3270, "narrative": "The video appears to be a Facebook Live stream featuring a man speaking at what seems to be a conference or event. The man is wearing a black jacket, glasses, and a black baseball cap. He's standing in front of a microphone, addressing an audience that's visible in the background. The audience consists of various individuals, some of whom are clapping or raising their hands.\n\nThe setting looks like a large indoor venue with a stage area where the speaker is positioned. There's a podium visible in the foreground, suggesting this might be a formal presentation or panel discussion.\n\nThe video quality is somewhat blurry, which is typical for live streams. The Facebook logo is visible in the bottom right corner of the screen, indicating this is an official Facebook Live broadcast.\n\nThe overall atmosphere seems energetic and engaged, with the speaker actively gesturing and interacting with the audience. The audience members appear attentive and responsive, with some clapping and others raising their hands, possibly indicating they're asking questions or participating in the discussion.\n\nThis appears to be a professional or educational event, given the formal attire of the speaker and the presence of a podium. The Facebook Live format suggests it's being broadcasted in real-time to a wider audience beyond those physically present at the event."}, {"start": 3270, "end": 3300, "narrative": "The video appears to be a Facebook Live stream featuring a panel discussion or presentation. The scene is set in what looks like a conference or event space with a black background. The main focus is on a man seated at a podium, wearing a red shirt and a lanyard with a name tag. He has short brown hair and a beard, and is looking slightly to his left.\n\nBehind him, there are several other people visible, some of whom are also wearing lanyards. They seem to be part of the same event or panel, though they're not the main focus of the video.\n\nThe quality of the video is somewhat grainy, which is typical for Facebook Live streams. There's a watermark in the top right corner that reads \"facebook,\" indicating this is a Facebook Live broadcast.\n\nThe overall atmosphere suggests a professional or academic setting, possibly a tech conference or similar event. The man at the podium seems to be speaking or presenting, though the audio isn't clear enough to make out what he's saying.\n\nThe video appears to be a live broadcast, capturing the moment as it happens. The presence of multiple people with lanyards suggests this is a formal event with multiple participants or speakers.\n\nThis description provides a comprehensive overview of the video's content and setting, allowing a text model to answer questions about the scene, the event, and the participants based on this information."}, {"start": 3300, "end": 3330, "narrative": "The video appears to be a series of screenshots from a presentation or conference. The main focus is on a man with a beard and mustache, wearing a red shirt and a white lanyard with a name tag. He's seated at a white podium with a microphone in front of him. The background is black, which makes the man and the podium stand out prominently.\n\nThe man seems to be speaking or presenting, as he's looking down at the podium. His facial expression suggests he's engaged in what he's saying.\n\nIn the top left corner of each screenshot, there's a Facebook logo, indicating that these images are likely from a Facebook Live stream or a Facebook video.\n\nThe screenshots are repeated multiple times, showing the same man in the same position at the podium. This repetition creates a sense of continuity and focus on the speaker.\n\nOverall, the video captures a professional setting, possibly a tech conference or similar event, with the speaker delivering a presentation or speech."}, {"start": 3330, "end": 3360, "narrative": "The video appears to be a recording of a presentation or lecture taking place in a large auditorium. The main focus is on a man standing at a podium, speaking into a microphone. He has short brown hair and a beard, and is wearing a red shirt with a white lanyard around his neck. The background is dark, which makes the speaker stand out prominently.\n\nThe audience is seated in rows of chairs, facing the speaker. Many audience members are wearing lanyards, suggesting this might be a conference or professional event. Some people in the audience are clapping, indicating the speaker has just finished a point or the presentation is concluding.\n\nIn the background, there's a table with a water bottle on it, and a large screen that's not currently displaying anything. The overall atmosphere seems formal and professional, typical of a business or academic conference.\n\nThe video quality is decent, with clear audio from the speaker. The Facebook logo is visible in the corner of the screen, suggesting this might be a live stream or recording from a Facebook event.\n\nThe audience appears engaged, with many people looking directly at the speaker. The lighting is focused on the speaker and the front rows of the audience, creating a spotlight effect.\n\nOverall, this video captures a moment from what seems to be a professional presentation or lecture, with an attentive audience and a speaker delivering content at a podium."}, {"start": 3360, "end": 3390, "narrative": "The video appears to be a Facebook Live stream from NeurIPS 2018, a major conference in the field of neural information processing systems. The stream is promoting the afternoon sessions of the conference, which are scheduled to start at 3:30 PM EST.\n\nThe video shows a darkened auditorium with a stage in the background. On the stage, there's a podium with a water bottle on top. The audience is seated in rows of chairs, facing the stage. The Facebook Live logo is prominently displayed in the bottom left corner of the screen.\n\nThe text overlay on the video reads: \"Join us back live at 3:30 pm EST for afternoon sessions of NeurIPS 2018.\" This message is repeated multiple times throughout the video, suggesting it's a looping promotional clip.\n\nThe overall atmosphere appears professional and academic, typical of a high-level scientific conference. The dark lighting and formal setting emphasize the importance of the event.\n\nThis video seems to be designed to encourage viewers to tune in to the live stream of the afternoon sessions, which likely feature presentations, discussions, and networking opportunities for attendees and online viewers."}, {"start": 3390, "end": 3420, "narrative": "The video displays a promotional graphic for the afternoon sessions of NeurIPS 2018. It features a gradient blue background that transitions from a darker shade at the top to a lighter one at the bottom. The main text in the center reads \"Join us back live at 3:30 pm EST for afternoon sessions of NeurIPS 2018.\"\n\nIn the bottom left corner, there's a Facebook Live logo, which consists of a white \"f\" on a blue background, followed by the word \"LIVE\" in red. This indicates that the event is being broadcasted live on Facebook.\n\nIn the bottom right corner, there's a white \"2018\" next to the NeurIPS logo, which is also white. The NeurIPS logo consists of the word \"NeurIPS\" in all capital letters.\n\nThe overall design is clean and professional, with a clear focus on the event details and the live streaming information. The use of blue throughout the graphic creates a cohesive and visually appealing look, while the white text stands out prominently against the background."}]