[{"start": 0, "end": 30, "narrative": "The video appears to be a presentation slide from the 29th ACM Conference on Computer and Communications Security, held in Toronto, Canada from October 15-19, 2018. The slide is titled \"Phishing Attacks on Modern Android\" and is presented by Simone Anzo.\n\nThe slide features a photo of Simone Anzo on the left side, with a laptop in front of him. On the right side, there's text detailing the presentation topic and collaborators. The background of the slide shows a cityscape with a prominent tower, likely representing Toronto's skyline.\n\nThe slide also includes logos for the University of Genoa and EURECOM, indicating their involvement in the research. There's a section titled \"What is this work about?\" which explains that the presentation will cover phishing attacks on Android OS and how modern Android features can be exploited to make phishing easier.\n\nThe overall design of the slide is professional and informative, typical of academic conference presentations. It effectively communicates the topic and key points of the research being presented at the conference."}, {"start": 30, "end": 60, "narrative": "The video appears to be a presentation or lecture about phishing attacks on Android OS. It features a young man speaking at a podium with a laptop open in front of him. The presentation is divided into two main sections:\n\n1. The first part, titled \"What is this work about?\" discusses phishing attacks on Android OS and how modern Android features can be abused to make it easier to mount these attacks.\n\n2. The second part, titled \"Which recent features?\" focuses on specific recent features that are being discussed, including \"Credential Autofill\" and \"Useful for Password Managers (PML).\"\n\nThe presentation is sponsored by the Association for Computing Machinery (ACM) and is part of their \"Using Computing & a & a\" series. The background is a light gray color, and the text is in black.\n\nThe speaker is wearing a gray shirt and appears to be explaining the topic in detail. The overall tone suggests this is an academic or professional presentation aimed at an audience interested in cybersecurity and Android security features."}, {"start": 60, "end": 90, "narrative": "The video appears to be a presentation slide from the Association for Computing Machinery (ACM). It features a man giving a talk, likely about recent features in mobile technology. The slide is divided into two main sections:\n\n1. On the left, there's a photo of the speaker, a young man with short dark hair, wearing a gray shirt and speaking into a microphone. He's standing behind a podium with a laptop on it.\n\n2. On the right side, there's a white background with text and images. The title at the top reads \"Which recent features?\" Below this, there are two bullet points:\n   - \"Credential Autofill\"\n   - \"Useful for Password Managers (PIM)\"\n\nBelow these bullet points, there are three smartphone images showing different apps or interfaces.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) with the text \"Association for Computing Machinery\" underneath it.\n\nThe slide seems to be discussing recent features in mobile technology, specifically focusing on credential autofill and its usefulness for password managers. The speaker appears to be explaining these concepts to an audience, likely at a conference or seminar related to computing and technology."}, {"start": 90, "end": 120, "narrative": "The video appears to be a presentation slide about mobile password managers. It features a man speaking at a podium on the left side of the screen. The main content is divided into two sections:\n\n1. On the left, there's a photo of a man giving a presentation. He's wearing a gray shirt and speaking into a microphone.\n\n2. On the right, there's a screenshot of a mobile device displaying a login page for Facebook. The screen shows a blue background with Facebook's logo and a login form.\n\nAt the bottom of the slide, there's a question in red text that reads: \"How can a Password Manager know this is the real Facebook app?\"\n\nThe slide also includes a logo for the \"Association for Computing Machinery\" in the bottom left corner.\n\nThe overall theme seems to be about the security and functionality of mobile password managers, specifically how they can verify the authenticity of login pages for popular apps like Facebook."}, {"start": 120, "end": 150, "narrative": "The video appears to be a presentation slide from a talk about mobile password managers and credential autofill technologies. The slide is divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\nOn the right side, there's a screenshot of a mobile device displaying a login page for Facebook. The Facebook logo is visible, and there's a text box for entering a password.\n\nThe slide includes some text:\n\n- \"Mobile Password Managers\" at the top right corner.\n- \"PMs on the Web help prevent phishing attacks\" in a yellow banner.\n- \"How can a Password Manager know this is the real Facebook app?\" in red text at the bottom right.\n\nThere's also a logo for the Association for Computing Machinery (ACM) in the bottom left corner.\n\nThe slide seems to be discussing how mobile password managers can help prevent phishing attacks, particularly when logging into web applications. It raises the question of how these managers can verify that they're interacting with the legitimate Facebook app rather than a phishing attempt.\n\nThe slide appears to be part of a larger presentation on credential autofill technologies, as suggested by the title \"Credential Autofill technologies\" visible in some of the frames."}, {"start": 150, "end": 180, "narrative": "The video shows a presentation slide about \"Credential Autofill technologies\" for Android apps. The slide is divided into two sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\nOn the right side, there's text that reads \"Credential Autofill technologies\" in bold black letters. Below that, there's a question in black text: \"Android app sandbox - how to inspect, identify and inject credentials?\"\n\nThe slide also includes a bullet point list with one item:\n\"1. Accessibility Service (a11y)\"\n\nThis list is accompanied by a yellow triangle with a black exclamation mark, indicating a warning or important note.\n\nAt the bottom of the slide, there's a logo for the \"Association for Computing Machinery\" with the text \"ACM\" in blue and \"Association for Computing Machinery\" in white.\n\nThe background of the slide is light gray, and the text is black. The overall layout is clean and professional, typical of a technical presentation slide."}, {"start": 180, "end": 210, "narrative": "The video shows a presentation slide about \"Credential Autofill technologies\" for Android apps. The slide is divided into two main sections:\n\n1. On the left side, there's a photo of a man sitting at a desk with a laptop. He appears to be giving a presentation, though his face is not clearly visible.\n\n2. On the right side, there's text detailing two technologies:\n\n   a. Accessibility Service (a11y)\n   b. OpenYolo protocol (by Google and Dashlane)\n\nThe slide is presented by the Association for Computing Machinery (ACM) and is part of a talk on \"Computing Machinery & Software Engineering.\"\n\nThe content focuses on how these technologies allow for the inspection, identification, and injection of credentials in Android apps. It mentions that Accessibility Service allows third-party apps to be accessible to users with disabilities, but also notes that it can be abused. The OpenYolo protocol is described as a client-side protocol with a login/server architecture, and it's mentioned that it's an open-source library that requires client-side modifications to be included.\n\nThe slide appears to be part of a larger discussion on security and privacy implications of these technologies in the context of Android app development and user authentication processes."}, {"start": 210, "end": 240, "narrative": "The video appears to be a presentation slide about Credential Autofill technologies. It's divided into two main sections:\n\n1. On the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\n2. On the right side, there's a white background with text and bullet points. The title at the top reads \"Credential Autofill technologies.\"\n\nThe content on the right side is divided into three main points:\n\n1. Accessibility Service (a11y)\n   - Allows third-party apps to be accessible to users with disabilities\n   - Can be abused by malicious apps\n\n2. OpenYOLO protocol (by Google and Dashlane)\n   - Client (app) login / server (PM) architecture\n   - Open-source library - client needs to be included\n\n3. Autofill framework introduced in Android 8.0 Oreo\n   - It was introduced with Android 8.0 Oreo\n   - It implements Password Manager core functionality\n\nThere's also a note at the bottom of the slide that says \"They all use the package name as the main abstraction to identify apps!\"\n\nThe slide is presented by the Association for Computing Machinery (ACM) and is part of a presentation on computing and security."}, {"start": 240, "end": 270, "narrative": "The video shows a presentation slide with a man giving a talk. The slide has a white background with a gray gradient and contains several elements:\n\n1. A photo of the speaker in the top left corner, showing him speaking into a microphone.\n\n2. The main content of the slide:\n   - \"Do not trust package names\" in bold text.\n   - \"TRUST\" written in large letters, with the \"U\" crossed out.\n   - \"Package name uniquely identifies an app\" in smaller text.\n   - \"On the device\" and \"In the Google Play Store\" listed below.\n\n3. A logo for the \"Association for Computing Machinery\" in the bottom left corner.\n\n4. A watermark that reads \"Association for Computing Machinery\" in the bottom right corner.\n\nThe slide appears to be discussing security concerns related to package names in mobile applications, particularly on Android devices. The crossed-out \"U\" in \"TRUST\" emphasizes the point that package names should not be trusted.\n\nThe speaker seems to be explaining that while package names are unique identifiers for apps, they can be manipulated or controlled by attackers, which is why they should not be relied upon for security purposes."}, {"start": 270, "end": 300, "narrative": "The video appears to be a presentation slide from a talk about mobile app security. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short dark hair. He's speaking into a microphone while looking at a laptop screen.\n\nOn the right side, there's a white background with text and graphics. The main title reads \"Do not trust package names\" in bold black letters. Below this, there's a list of bullet points:\n\n- \"Package name uniquely identifies an app\"\n- \"On the Google Play Store\"\n- \"But we cannot trust package names\"\n- \"Attack-controlled\"\n- \"No trust relationship between 'package' and 'subpackage'\"\n- \"Google Play Store does not enforce any restriction\"\n\nThere's also a graphic of a torn piece of paper with the word \"TRUST\" on it, emphasizing the theme of the presentation.\n\nAt the bottom of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM) and a subtitle that reads \"Advancing Computing as a Science & Profession.\"\n\nThe slide seems to be discussing the importance of package names in identifying apps and the potential risks associated with trusting these names. It highlights that package names can be controlled by attackers and that there's no guaranteed trust relationship between package names and their subpackages. The slide also mentions that the Google Play Store doesn't enforce any restrictions in this area.\n\nOverall, the presentation appears to be addressing security concerns related to mobile app identification and the potential vulnerabilities in the current system."}, {"start": 300, "end": 330, "narrative": "The video appears to be a presentation slide from a talk about password management. It's divided into two main sections:\n\n1. The mapping problem:\n   - This section explains how a password manager securely maps a package name to its associated domain name.\n   - It uses visual aids to illustrate the process, showing a smartphone icon, a globe, and a user icon with credentials.\n\n2. The leading password managers:\n   - This section lists five popular password management tools: KeePass, LastPass, Dashlane, 1Password, and Google Smart Lock.\n   - Each tool is represented by its logo.\n\nThe presentation is likely part of a lecture or seminar on cybersecurity, specifically focusing on password management solutions and the challenges they face in securely mapping package names to domain names."}, {"start": 330, "end": 360, "narrative": "The video displays a PowerPoint presentation slide about leading password managers. The slide is divided into two main sections:\n\nOn the left side, there's a photo of a man speaking into a microphone. He's wearing a gray shirt and has short brown hair. He's seated at a desk with a black laptop in front of him.\n\nOn the right side, the slide is titled \"The 5 leading Password Managers\" in bold black text. Below the title, there's a list of five password managers:\n\n1. Keeper (represented by a blue lock icon)\n2. LastPass (represented by a red lock icon)\n3. Dashlane (represented by a green lock icon)\n4. 1Password (represented by a yellow lock icon)\n5. Google Smart Lock (represented by the Google logo)\n\nThe slide also includes a statement at the bottom that reads \"Tens of Millions of Installations\" in blue text.\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" with the acronym \"ACM\" visible.\n\nThe overall design of the slide is clean and professional, with a white background and black text for easy readability. The use of lock icons and the Google logo effectively communicates the topic of password management and security."}, {"start": 360, "end": 390, "narrative": "The video appears to be a presentation slide from a talk about LastPass, a password management tool. The slide is divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\nOn the right side, there's a white background with the LastPass logo in red at the top. Below the logo, there's text explaining how LastPass works:\n\n1. It splits the package name in components separated by the dots.\n2. It builds a domain name by using the first two in reversed order.\n\nThe slide also includes a small logo for the Association for Computing Machinery (ACM) in the bottom left corner.\n\nThe presentation seems to be discussing how LastPass uses heuristics to map and suggest credentials for websites. The example given is \"com.facebook.fake.fake,\" which LastPass would suggest as the credentials for \"facebook.com.\"\n\nOverall, the slide appears to be part of a technical presentation, likely at a conference or seminar, explaining the inner workings of the LastPass password management system."}, {"start": 390, "end": 420, "narrative": "The video appears to be a presentation slide from a conference or seminar. It features a man speaking into a microphone, likely the presenter, with a laptop on a podium in front of him. The background is a light gray color.\n\nThe main content of the slide is divided into two sections:\n\n1. On the left side, there's a photo of the presenter with a laptop. The laptop has a black screen and a white logo on the back.\n\n2. On the right side, there's a white background with text and a logo. The logo is red and says \"LastPass\" at the top. Below the logo, there's a black box with white text that explains a process called \"Heuristic-based mapping.\" It describes how the system splits the package name by dots and then combines the first and third parts to form a domain name.\n\nAt the bottom of the slide, there's a blue box with white text that provides an example: \"For example, with 'com.facebook.fake' it will suggest the credentials of facebook.com.\"\n\nIn the bottom left corner, there's a logo for the \"Association for Computing Machinery\" with the text \"ACM\" and \"Computing Machinery & Science.\"\n\nThe slide seems to be discussing a feature or process related to password management or domain name mapping, possibly as part of a presentation about LastPass or similar software."}, {"start": 420, "end": 450, "narrative": "The video appears to be a presentation slide from a talk about password management tools. It features a man speaking at a podium, likely the presenter of the presentation. The slide is divided into two main sections:\n\nOn the left side, there's a photo of the presenter, a young man with short dark hair, wearing a gray shirt and black jacket. He's holding a black laptop with a silver logo on the lid.\n\nOn the right side, there's a white background with text and logos. The main focus is on \"Dashlane,\" a password manager, with a green shield logo above the name. Below this, there's a section titled \"Heuristic-based mapping\" with two bullet points explaining how Dashlane works.\n\nAt the bottom of the slide, there's a red box with text that reads: \"For example, with tag-fac Dashlane will suggest the credentials of facebook.com, instagram.com and uber.com\"\n\nIn the bottom left corner, there's a logo for \"Association for Computing Machinery & IEEE\" with the text \"Advancing Computing as a Science & a Profession.\"\n\nThe slide seems to be part of a larger presentation on password management tools, specifically highlighting Dashlane's features and capabilities."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation slide from the Association for Computing Machinery (ACM) on the topic of \"Heuristic-based mapping\" using the Google Play Store as an example. The slide is divided into two main sections:\n\n1. On the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\n2. On the right side, there's a white background with text and a logo. The logo is a yellow square with a black \"K\" inside it, and the word \"Keeper\" is written below it.\n\nThe main content of the slide is about how the Google Play Store uses heuristic-based mapping. It explains that the process involves:\n\n1. Downloading the Google Play Store webpage using the package name.\n2. Trusting the developer's website domain.\n\nThe slide also includes a screenshot of the Google Play Store webpage, with a red arrow pointing to the URL \"https://play.google.com/store/apps/details?id=com.facebook.katana\". This URL is highlighted to show how the process works.\n\nAt the bottom of the slide, there's a red box with text that reads: \"Keeper considers the domain as the rightful owner, but again, it's attack-collided.\" This suggests that while the heuristic-based mapping process is used to identify the rightful owner of an app, it can sometimes be exploited by attackers.\n\nThe slide seems to be part of a larger discussion on security and app verification processes in the Google Play Store ecosystem."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation slide from a talk about password management tools. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\nOn the right side, there are two main sections:\n\n1. The top section is titled \"Keeper\" and shows a screenshot of the Keeper app. It mentions \"Heuristic-based mapping\" and describes how Keeper works with domains.\n\n2. The bottom section is titled \"1Password\" and shows a screenshot of the 1Password app. It states that 1Password does not provide any mapping.\n\nThere's also a red box with text that reads \"Keeper considers the domain as the rightful owner, but again, it is attack-controlled.\"\n\nThe slide is presented by the Association for Computing Machinery and is part of a talk about password management tools."}, {"start": 510, "end": 540, "narrative": "The video appears to be a presentation slide from a conference or seminar. It features a man speaking into a microphone, likely the presenter, with a laptop in front of him. The background is a plain white wall, and the presenter is wearing a gray shirt.\n\nThe slide contains several elements:\n\n1. A logo for \"Association for Computing Machinery & IEEE\" in the bottom left corner.\n\n2. A large white space on the right side of the slide, which is the main focus of the presentation.\n\n3. A black laptop with a white sticker on the lid, positioned in front of the presenter.\n\n4. A series of slides with different content:\n   - One slide mentions \"1Password\" and states \"1Password does not provide any mapping.\"\n   - Another slide displays the Google Smart Lock logo and mentions \"Google Smart Lock mapping is securely implemented, but...\"\n   - The final slide shows the Google Smart Lock logo again and discusses the burden of mapping being delegated to developers.\n\nThe presenter seems to be discussing password management and authentication systems, specifically comparing 1Password and Google Smart Lock. The presentation appears to be technical in nature, likely aimed at an audience interested in computing and security.\n\nThe overall layout is clean and professional, with a clear focus on the content being presented. The presenter's presence adds a personal touch to the slide, making it more engaging for the audience."}, {"start": 540, "end": 570, "narrative": "The video appears to be a presentation slide about Google Smart Lock. It features a man speaking into a microphone, likely giving a talk or lecture. The slide has a white background with a gray gradient on the left side.\n\nThe main content of the slide includes:\n\n1. A Google Smart Lock logo in the top right corner.\n2. A title that reads \"Google Smart Lock\" in black text.\n3. Two bullet points:\n   - \"The burden of mapping is delegated to the developers\"\n   - \"The developers are requested to fill in a Google Form\"\n\nOn the left side of the slide, there's a small logo for the \"Association for Computing Machinery & IEEE\" with the tagline \"Advancing Computing as a Science & a Profession.\"\n\nThe man in the video is wearing a gray shirt and has short dark hair. He's speaking into a microphone while looking at a laptop screen in front of him.\n\nThe overall presentation seems to be discussing the implementation and responsibilities related to Google Smart Lock, a feature that allows users to securely unlock their devices with their Google account."}, {"start": 570, "end": 600, "narrative": "The video shows a presentation slide with a gray background. On the left side, there's a small photo of a man speaking into a microphone while using a laptop. He appears to be giving a talk or presentation.\n\nOn the right side of the slide, there's a larger image of a smartphone screen displaying a login page. The login page has a blue background with white text and icons. It includes fields for \"Email\" and \"Password,\" along with a \"Forgot Password?\" link.\n\nAbove the smartphone image, there's a text box that reads \"The situation can get worse.\" Below the smartphone image, there's a list of bullet points:\n\n- Hidden fields\n- Set visibility to \"gone\"\n- Foreground color + Background color\n- Make fields transparent\n- 1px transparent\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM).\n\nThe slide seems to be discussing potential security vulnerabilities or design issues in mobile login interfaces, particularly focusing on how these issues can be exploited or made worse."}, {"start": 600, "end": 630, "narrative": "The video appears to be a presentation slide from a talk about mobile app development or security. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray sweater and speaking into a microphone. In front of him is a black laptop with a white sticker on the lid.\n\nOn the right side, there's a screenshot of a mobile app interface. The app has a blue background with white text and icons. At the top, there's a Facebook logo, and below that, there's a search bar with \"Facebook\" written in it. The app also has a \"Sign Up\" button and a \"Log In\" button.\n\nThe slide has a gray background with white text. The main title reads \"The situation can get worse\" and there's a list of bullet points underneath. However, the specific content of these bullet points isn't visible in the image.\n\nIn the bottom left corner, there's a logo for the \"Association for Computing Machinery\" with the text \"ACM\" and \"Computing Machinery & Science\" underneath it.\n\nThe overall layout suggests this is part of a professional presentation, likely discussing mobile app security or development challenges."}, {"start": 630, "end": 660, "narrative": "The video appears to be a presentation slide about \"Instant Apps Flow.\" It features a man speaking at a podium, likely giving a lecture or presentation. The slide includes several elements:\n\n1. A title at the top: \"Instant Apps Flow\"\n\n2. A photo of the speaker at the podium, with a laptop open in front of him.\n\n3. A logo for the \"Association for Computing Machinery\" in the bottom left corner.\n\n4. A screenshot of a mobile app interface, showing a guitar and the text \"Ultimate Guitar Chords Tabs.\"\n\n5. A screenshot of the Google Play Store page for the same app.\n\n6. A screenshot of the app's home screen, displaying various categories like \"Being Famous,\" \"Weekend Songs,\" and \"Addiction.\"\n\nThe slide seems to be demonstrating the process of using Instant Apps, a feature that allows users to try out apps without downloading them. The speaker is likely explaining how this technology works and its benefits.\n\nThe overall layout is clean and professional, designed to clearly convey information about Instant Apps and their implementation in the context of the \"Ultimate Guitar\" app."}, {"start": 660, "end": 690, "narrative": "The video appears to be a presentation slide about \"Instant Apps\" for Android. It's divided into two main sections:\n\n1. Instant Apps Flow:\n   - This section shows a flowchart or sequence of steps related to instant apps.\n   - There's a red speech bubble with \"FULL CONTROL!!!\" written in yellow text, suggesting a key feature or benefit of instant apps.\n\n2. Instant Apps Key Takeaways:\n   - This section lists several key points about instant apps:\n     - Users can try Android apps\n     - Just URL-click apps\n     - Just URL activation\n     - From web phishing to mobile phishing\n     - Restricted functionalities with full UI control\n     - No full installation needed, but...\n     - They have a package name, so...\n\nThe slide also includes a logo for the \"Association for Computing Machinery\" in the bottom left corner, indicating this presentation might be part of a conference or seminar organized by this organization.\n\nThe overall design is clean and professional, with a white background and black text for easy readability. The content seems to focus on the benefits and features of instant apps, particularly highlighting their ease of use and control for users."}, {"start": 690, "end": 720, "narrative": "The video appears to be a presentation slide from a talk about instant apps. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and sitting at a desk with a black laptop. The laptop has a white sticker on it. Below the photo, there's a logo for the Association for Computing Machinery and a tagline that reads \"Advancing Computing as a Science & Profession.\"\n\nOn the right side, there's a white background with text and a red banner. The banner contains the text \"Key Takeaways\" in white letters. Below this, there are several bullet points:\n\n1. \"Users can try Android apps\"\n2. \"Just URL-click apps\"\n3. \"Just URL activation\"\n4. \"From web phishing to mobile phishing\"\n5. \"Restricted functionalities with full UI control\"\n6. \"No full installation needed, but...\"\n7. \"They have a package name, so...\"\n\nAt the bottom of the slide, there's a red button with white text that says \"Let's put them together!\"\n\nThe slide seems to be discussing the concept of instant apps, which allow users to try Android apps without full installation. It mentions that these apps can be accessed by simply clicking on a URL, but there are some limitations in terms of functionality and control. The slide also highlights that these apps have package names, which is an interesting point to note.\n\nOverall, the slide appears to be part of a larger presentation on the topic of instant apps, likely discussing their benefits, limitations, and how they differ from traditional app installations."}, {"start": 720, "end": 750, "narrative": "The video appears to be a presentation or lecture on cybersecurity, specifically focusing on phishing attacks. It's divided into two main sections:\n\n1. The left side shows a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen. The laptop is open on a black stand, and there's a white wall behind him.\n\n2. The right side of the screen displays slides from the presentation. The first slide reads \"Let's put them together!\" and shows a screenshot of a smartphone screen with various app icons.\n\nThe second slide is titled \"End-to-end attack: phishing with few clicks\" and explains that phishing attacks start with a URL. It includes a visual of a URL with a blue circle and a white arrow pointing to it.\n\nThe presentation seems to be part of a series, as there's a logo for the \"Association for Computing Machinery & IEEE\" in the bottom left corner of each slide.\n\nThe content appears to be educational, likely aimed at teaching viewers about the dangers of phishing and how to identify and prevent these types of cyber attacks."}, {"start": 750, "end": 780, "narrative": "The video shows a presentation slide about an end-to-end attack involving phishing with few clicks. The slide is divided into two main sections:\n\n1. On the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen.\n\n2. On the right side, there are three screenshots of a mobile device screen. These screenshots appear to be demonstrating the phishing attack process.\n\nThe title of the slide reads \"End-to-end attack: phishing with few clicks.\"\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery & IEEE.\"\n\nThe slide seems to be part of a presentation on cybersecurity, specifically focusing on a phishing attack that can be carried out with minimal user interaction. The screenshots likely show the steps involved in this type of attack, though the specific details of the attack process aren't visible in the description.\n\nThis presentation appears to be educational in nature, likely aimed at teaching viewers about the dangers of phishing attacks and how they can be executed with just a few clicks."}, {"start": 780, "end": 810, "narrative": "The video appears to be a presentation or lecture on cybersecurity, specifically focusing on phishing attacks. The presenter is a young man with short brown hair, wearing a gray shirt, and speaking into a microphone. He's seated at a desk with a black laptop in front of him.\n\nThe presentation is divided into two main sections:\n\n1. End-to-end attack: phishing with few clicks\n\nThis section likely demonstrates a step-by-step process of a phishing attack, showing how attackers can gain access to sensitive information with minimal user interaction.\n\n2. There is a solution (in theory)\n\nThis part of the presentation seems to discuss potential countermeasures or solutions to prevent phishing attacks. It mentions Digital Asset Links, which are a way for websites to make public and verifiable statements about their association with specific Android apps.\n\nThe presentation is sponsored by the Association for Computing Machinery (ACM), as indicated by their logo in the bottom left corner of the screen.\n\nOverall, the video appears to be an educational resource aimed at raising awareness about phishing threats and discussing potential solutions in the field of cybersecurity."}, {"start": 810, "end": 840, "narrative": "The video shows a presentation slide with a man giving a talk. The slide has a light blue background and contains several elements:\n\n1. A photo of the speaker, a young man with short brown hair, wearing a gray sweater and black pants. He's seated at a desk with a black laptop.\n\n2. The title \"There is a solution (in theory)\" is prominently displayed.\n\n3. A list of three bullet points:\n   - \"Digital Asset Links enable website to make public and verifiable statements\"\n   - \"An Android app can declare that it is associated with a specific website\"\n   - \"Statement in the app's AndroidManifest.xml file\"\n   - \"Hosting DAL JSON file on the website\"\n\n4. A small logo in the bottom left corner that reads \"Association for Computing Machinery & IEEE\"\n\n5. A smartphone icon with a green checkmark next to it, indicating a successful connection or verification.\n\n6. A code snippet with the word \"relation\" highlighted, showing a JSON file with a URL and some code.\n\nThe presentation appears to be about Digital Asset Links, a technology that allows Android apps to declare their association with specific websites. This enables public and verifiable statements to be made between apps and websites, enhancing security and user experience.\n\nThe speaker seems to be explaining how this technology works, likely in the context of mobile app development or cybersecurity. The presence of the ACM & IEEE logo suggests this might be part of a professional conference or seminar on computing and technology."}, {"start": 840, "end": 870, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen in front of him.\n\nOn the right side, there's text and a diagram. The title at the top reads \"Digital Asset Links adoption.\" Below that, there's a bullet point that says \"We did an empirical study.\"\n\nThe main content of the slide discusses a study conducted on domain names extracted while reversing PMLs (likely referring to \"Page Management Links\" or a similar term). It mentions that this list consists of 821 domain names, which were extracted from PMLs hosted at least on one page with a login form.\n\nThe slide also includes a diagram showing a phone with a green checkmark next to it, indicating some form of verification or approval process.\n\nAt the bottom of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM), suggesting this presentation is part of an ACM event or conference.\n\nOverall, the slide seems to be discussing the adoption and implementation of Digital Asset Links, a technology related to mobile app authentication and verification."}, {"start": 870, "end": 900, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while looking at a laptop screen in front of him.\n\nOn the right side, there's text and a logo. The text reads \"Our secure-by-design API\" and \"We have proposed a new API getLiftedDomainName(package_name)\". Below this, there's a bullet point that says \"Based on Digital Asset Links\".\n\nAt the bottom of the slide, there's a logo for the \"Association for Computing Machinery & IEEE\". This suggests the presentation is likely part of a professional computing or technology conference.\n\nThe slide seems to be discussing a new API proposal related to secure domain name handling, possibly for mobile applications. The mention of \"Digital Asset Links\" indicates this might be related to Android app security or linking features.\n\nOverall, this appears to be a technical presentation slide from a computing conference, focusing on a new API proposal for secure domain name management."}, {"start": 900, "end": 930, "narrative": "The video shows a presentation slide with a man giving a talk. The slide is titled \"Our secure-by-design API\" and contains text explaining a new API proposal. The presenter is seated at a desk with a laptop in front of him, and he appears to be speaking into a microphone.\n\nThe slide includes the following key points:\n\n1. A new API called \"getVerifiedDomainName(package_name)\"\n2. Based on Digital Asset Links\n3. No package names\n4. Queries for domain names only\n5. The developer is forced to use only validated domain names\n6. Integrity verified\n\nThere's also a logo for the \"Association for Computing Machinery\" in the bottom left corner of the slide.\n\nThe presenter seems to be explaining the benefits and features of this new API proposal, emphasizing its security and design principles. The overall tone suggests this is a technical presentation, likely at a conference or seminar focused on computer science or cybersecurity.\n\nThe slide appears to be part of a larger discussion about secure API design and implementation, particularly in the context of digital asset management and verification."}, {"start": 930, "end": 960, "narrative": "The video shows a presentation slide with a man giving a talk. The slide is titled \"Our secure-by-design API\" and contains information about a proposed new API called \"getVerifiedDomainName(package, name)\".\n\nThe slide lists several features of this API:\n1. Based on Digital Asset Links\n2. No package names\n3. Query for domain names\n4. The developer is forced to use only validated domain names\n5. Integrity verified\n6. Client/Server paradigm\n7. Client Broadcast intent\n8. But no Broadcast intent\n\nThere's also a note about the current OpenYOLO clientcast implementation sending a broadcast intent, which opens apps to side channel attacks.\n\nIn the bottom left corner, there's a logo for the Association for Computing Machinery (ACM) and a note about responsible disclosure. It mentions reaching out to PINS on August 8th, 2018, and going public on September 6th, 2018, with a 110-day disclosure period.\n\nThe presenter is shown in the bottom left corner of the slide, speaking into a microphone. He appears to be explaining the content of the slide.\n\nThe overall presentation seems to be discussing security features and potential vulnerabilities in a mobile application framework, specifically focusing on the OpenYOLO clientcast implementation and its implications for side channel attacks."}, {"start": 960, "end": 990, "narrative": "The video appears to be a presentation slide from a conference or seminar. It's divided into two main sections:\n\nOn the left side, there's a photo of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while gesturing with his hands, suggesting he's in the middle of explaining something.\n\nOn the right side, there's text and a logo. The logo is for \"Association for Computing Machinery & IEEE\" and features a blue and white color scheme.\n\nThe main content on the right side is titled \"Responsible disclosure\" and includes two bullet points:\n\n1. \"We reached out to PINS on 2018-08-08\"\n2. \"We went public on 2018-09-06\"\n\nBelow this, there's a section labeled \"Reactions\" with three bullet points:\n\n1. \"1Password: 'no suggestions because they would be unreliable'\"\n2. \"Google: 'it's a 3rd-party app, problem'\"\n3. \"Dashlane & Lastpass: reward\"\n\nAt the bottom of the slide, there's a section labeled \"Conclusions,\" but it's currently empty.\n\nThe slide seems to be discussing a security incident involving a third-party app called PINS, which was disclosed responsibly to the company on August 8, 2018, and then made public on September 6, 2018. The reactions from different password management services are also mentioned, with 1Password not offering suggestions, Google stating it's a third-party app issue, and Dashlane and Lastpass offering a reward."}, {"start": 990, "end": 1020, "narrative": "The video shows a presentation slide with a white background and black text. The main title at the top reads \"Conclusions\" in bold black letters. Below this, there are two bullet points:\n\n1. \"Two features added in the name of convenience = ease phishing\"\n2. \"There is a need for a push from the entire community into supporting DAL\"\n\nOn the left side of the slide, there's a small photo of a man speaking into a microphone. He's wearing a gray shirt and has short dark hair. The man appears to be giving a presentation, likely related to the content of the slide.\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM). The logo is blue and white, featuring the acronym \"ACM\" in blue letters on a white background.\n\nThe slide seems to be part of a professional presentation, possibly discussing cybersecurity or phishing prevention strategies. The mention of \"DAL\" likely refers to a specific technology or protocol related to the topic being discussed."}, {"start": 1020, "end": 1050, "narrative": "The video shows a presentation slide with a man giving a talk. The slide is titled \"Conclusions\" and contains three bullet points:\n\n1. Two features added in the name of convenience = ease phishing\n2. There is a need for a push from the entire community into supporting DAL\n3. We hope that Google will release their manually created mapping...\n\nThe presenter is a young man with short brown hair, wearing a gray shirt. He's seated at a desk with a black laptop in front of him. The background is a plain white wall.\n\nIn the bottom left corner of the slide, there's a logo for the Association for Computing Machinery (ACM) and the European Association for Theoretical Computer Science (EATCS).\n\nThe presenter appears to be speaking into a microphone, though his exact words are not visible in the image. The overall setting suggests this is likely a professional or academic presentation, possibly related to computer science or cybersecurity given the content of the bullet points.\n\nThe slide design is simple and professional, with a white background and black text. The presenter's image is positioned to the left of the text, creating a balanced layout."}, {"start": 1050, "end": 1080, "narrative": "The video shows a presentation slide with a light blue background. On the left side, there's a small inset image of a man giving a presentation. He's wearing a gray shirt and has short brown hair. He's speaking into a microphone while gesturing with his hands.\n\nOn the right side of the slide, there's a white box containing text. The title \"Conclusions\" is prominently displayed in black text. Below the title, there's a bullet point that reads \"Two features added in the name of convenience = ease phishing\" in black text.\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM). The logo is a blue square with a white \"A\" and \"C\" inside it, along with the text \"Association for Computing Machinery\" in white.\n\nThe slide appears to be part of a professional presentation, likely related to cybersecurity or computer science, given the ACM logo and the content about phishing."}, {"start": 1080, "end": 1110, "narrative": "The video shows a presentation slide with a light blue background. On the left side, there's a photo of a man standing at a podium with a laptop in front of him. He's wearing a gray shirt and appears to be speaking into a microphone.\n\nOn the right side of the slide, there's a white box containing text. The title \"Conclusions\" is prominently displayed in black text. Below the title, there's a bullet point that reads \"Two features added in the name of convenience = ease phishing.\"\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM). The logo is a blue square with a white \"A\" and \"C\" inside it, along with the text \"Association for Computing Machinery\" in white.\n\nThe slide appears to be part of a professional presentation, likely discussing cybersecurity or phishing prevention. The man at the podium seems to be the presenter, giving a talk on this topic."}, {"start": 1110, "end": 1140, "narrative": "The video shows a presentation slide with a man giving a talk. The slide has a white background with black text. The main title at the top reads \"Conclusions\" in bold black letters. Below the title, there are two bullet points:\n\n1. \"Two features added in the name of convenience = ease phishing\"\n2. \"There is a need for a push from the entire community into supporting DAL\"\n\nOn the left side of the slide, there's a photo of the speaker, a man with short dark hair wearing a gray shirt. He's standing behind a podium with a laptop on it.\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM) with the tagline \"Advancing Computing as a Science & Profession.\"\n\nThe speaker appears to be discussing cybersecurity issues, specifically highlighting how certain features added for convenience can lead to phishing vulnerabilities. He also mentions the need for community support for a particular technology or standard called DAL (which likely stands for Domain Awareness Layer, a security framework).\n\nThe overall tone of the presentation seems to be focused on cybersecurity best practices and the importance of community involvement in addressing security challenges."}, {"start": 1140, "end": 1170, "narrative": "The video shows a man giving a presentation. He's standing at a podium with a laptop in front of him. The man appears to be speaking into a microphone, likely delivering a speech or lecture.\n\nThe background is a plain light gray color, which helps keep the focus on the presenter. There's a logo visible in the bottom left corner of the screen, but it's not clear enough to make out specific details.\n\nThe presentation seems to be about cybersecurity, as evidenced by the text visible on the screen. It mentions \"phishing\" and \"DAL,\" which are terms related to cyber threats and data protection.\n\nThe man looks to be in his late 20s or early 30s, with short dark hair. He's wearing a gray shirt and appears to be speaking with confidence.\n\nOverall, it looks like a professional presentation, possibly at a conference or seminar focused on computer science or cybersecurity."}, {"start": 1170, "end": 1200, "narrative": "The video shows a presentation slide with a white background. On the left side of the slide, there's a photo of a man giving a presentation. He's wearing a black shirt with a white logo on the left chest and has short brown hair. He's speaking into a microphone while looking to his right.\n\nOn the right side of the slide, there's text titled \"Conclusions\" in bold black letters. Below the title, there are three bullet points:\n\n1. \"Two features added in the name of convenience - ease phishing\"\n2. \"There is a need for a push from the entire community into supporting DAL\"\n3. \"We hope that Google will release their manually created mapping...\"\n\nIn the bottom left corner of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM) with the text \"ACM\" and \"Association for Computing Machinery\" underneath it.\n\nThe slide appears to be part of a professional presentation, likely related to computer science or cybersecurity, given the mention of phishing and DAL (which could stand for Domain Awareness Layer). The speaker seems to be discussing issues related to security and community support in the field of computing."}]