[{"start": 0, "end": 30, "narrative": "The video appears to be a promotional or informational piece for the KDD2021 conference. It features a series of slides with the KDD2021 logo prominently displayed, along with the text \"On the Nature of Data Science\" and the name \"Jeffrey D. Ullman.\"\n\nThe video includes several scenes:\n\n1. A woman speaking in a virtual conference setting.\n2. A man in a plaid shirt working at a desk.\n3. A woman in a red shirt sitting at a desk.\n4. A man in a black shirt working at a desk.\n5. A woman in a black shirt sitting at a desk."}, {"start": 30, "end": 60, "narrative": "The video appears to be a promotional or informational piece for the KDD2021 conference. It features a series of slides with different backgrounds and text, likely showcasing various aspects of the event.\n\nThe slides have a consistent design with a blue and green color scheme, and the KDD2021 logo is prominently displayed. Each slide seems to focus on a different aspect of the conference, possibly highlighting key features, speakers, or themes.\n\nThere are also some blurred images of people, which could be attendees or speakers at the conference. These images are likely used to convey the atmosphere and diversity of the event.\n\nThe text on the slides includes phrases like \"truly valued here and that,\" \"something really important to me,\" and \"there's so many cool,\" which suggest the video is emphasizing the value and excitement of attending KDD2021.\n\nOverall, the video seems to be designed to attract potential attendees by showcasing the conference's key features and creating a sense of excitement and importance around the event."}, {"start": 60, "end": 90, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard speaking into a microphone. He's wearing a light blue button-down shirt and glasses. The background shows a bookshelf and a framed picture.\n\nThe presentation is titled \"Data Science: Is It Just Machine Learning? Is It Just Statistics? Two of My Favorite Algorithms That Are Neither.\" The speaker is identified as Jeffrey D. Ullman from Stanford University.\n\nThe video has a professional, academic feel to it, likely discussing advanced topics in data science and machine learning. The KDD2021 logo is visible in the top left corner, indicating this is part of the Knowledge Discovery and Data Mining conference.\n\nThe overall presentation seems to be focused on exploring the boundaries of data science, challenging common perceptions about what it encompasses, and possibly introducing some lesser-known algorithms that the speaker finds particularly interesting or effective."}, {"start": 90, "end": 120, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe presentation is divided into two sections:\n\n1. The left side shows the speaker, who seems to be discussing data science and machine learning.\n\n2. The right side displays a slide with text, which appears to be a list of documents to read. The slide includes a URL and mentions the National Academies of Sciences, Engineering, and Medicine.\n\nThe background of the video has a blue and green gradient, with the KDD2021 logo visible in the bottom left corner. The overall setting suggests this is a professional academic or industry conference presentation.\n\nThe speaker seems to be Jeffrey D. Ullman, as indicated by the text on the slide. He's associated with Stanford University's Infolab.\n\nThe video appears to be part of a larger discussion on data science, machine learning, and potentially the National Academies' work in these fields."}, {"start": 120, "end": 150, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his hands as he talks.\n\nThe background shows a bookshelf with various books and a framed picture. There's also a window visible, suggesting the setting is likely an office or study.\n\nThe presentation includes a slide with the title \"Some Documents to Read\" and a URL for a National Academies of Sciences, Engineering, and Medicine report on data science education. The slide also mentions the National Research Council study.\n\nThe video seems to be part of a larger discussion on data science education and research, as evidenced by the slide and the man's attire and demeanor."}, {"start": 150, "end": 180, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf visible in the background.\n\nThe presentation is titled \"The Words Keep Changing\" and discusses the evolution of terminology in the field of data science and knowledge discovery. It mentions terms like \"Data Mining\" and \"Knowledge Discovery from Databases\" from 2000, \"Big Data\" from 2010, and \"Data Science\" from 2020.\n\nThe video is part of the Association for Computing Machinery's KDD (Knowledge Discovery and Data Mining) conference, as indicated by the logo in the bottom left corner.\n\nThe man seems to be explaining the changing nature of terminology in the data science field, highlighting how concepts and terms have evolved over the past two decades."}, {"start": 180, "end": 210, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and seems to be discussing the evolution of data science terminology.\n\nThe presentation is titled \"The Words Keep Changing\" and includes a slide with bullet points outlining how the terminology in the field has evolved over time:\n\n- 2000: \"Data Mining\" \"Knowledge Discovery from Databases\"\n- 2010: \"Big Data\"\n- 2020: \"Data Science\"\n\nThe slide emphasizes that despite these changes in terminology, the core idea remains the same: combining fast algorithms, large hardware, and programming systems to solve problems in both commercial and scientific worlds.\n\nIn the background, there's a bookshelf with various books, suggesting this might be taking place in an office or study setting.\n\nThe video is part of the Association for Computing Machinery's KDD2021 conference, as indicated by the logo and branding visible in the bottom left corner of the screen."}, {"start": 210, "end": 240, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe presentation is titled \"Who Owns 'Data Science'\" and discusses the evolving nature of data science terminology. The slide includes bullet points that outline different perspectives on what \"data science\" means to various groups, including statisticians and machine learning practitioners.\n\nThe background of the video has a blue and green gradient, with the KDD2021 logo visible in the bottom left corner. The Association for Computing Machinery (ACM) logo is also present, indicating their involvement in the conference.\n\nThe man appears to be explaining the concept of data science and its various interpretations, suggesting that the video is likely part of a larger discussion on the field's development and its interdisciplinary nature."}, {"start": 240, "end": 270, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe presentation is titled \"Who Owns 'Data Science'\" and includes a slide with bullet points. The main points on the slide are:\n\n1. There are many to whom \"data science\" means statistics, machine learning, and data mining.\n2. My view: data science is a natural evolution of database systems research.\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) and the KDD2021 conference.\n\nThe background shows a bookshelf with various books and a framed picture. The setting appears to be a home office or study.\n\nThe man's expression is serious as he discusses the topic, suggesting this is an important subject in the field of data science and computer science education."}, {"start": 270, "end": 300, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe presentation is divided into two main sections:\n\n1. \"Who Owns 'Data Science'\"\n   - The speaker discusses the concept of data science and its relationship to statistics and machine learning.\n   - He emphasizes that data science is a natural evolution of statistics and the best preparation for success in computer science education.\n\n2. \"Some Positive Points\"\n   - This section highlights the benefits of machine learning.\n   - It mentions that machine learning has created powerful approaches to algorithm development and often outperforms conventional algorithms.\n\nThe background shows a bookshelf with various books and a framed picture. The presentation is branded with the KDD2021 logo and the ACM logo, indicating it's part of the Association for Computing Machinery's Knowledge Discovery and Data Mining conference.\n\nThe overall tone of the presentation seems to be informative and educational, focusing on the intersection of statistics, machine learning, and data science in the context of computer science education."}, {"start": 300, "end": 330, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his hands as he talks.\n\nThe background shows a bookshelf with various books and framed pictures, suggesting an academic or professional setting. The presentation is titled \"KDD2021\" at the top, with a blue and green gradient background.\n\nOn the right side of the screen, there's a section titled \"Some Positive Points\" with bullet points. The visible point mentions that machine learning has created very powerful approaches to algorithm development.\n\nAt the bottom of the screen, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo, indicating this is an official ACM KDD conference presentation.\n\nThe man seems to be discussing the benefits of machine learning in algorithm development, highlighting its power and effectiveness compared to conventional methods."}, {"start": 330, "end": 360, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe presentation is titled \"KDD2021\" at the top of the screen. On the right side, there's a section titled \"Some Positive Points\" with bullet points discussing machine learning and statistics.\n\nThe man seems to be making a point about the relationship between machine learning and statistics, suggesting that statistics are often smarter than conventional algorithms.\n\nThe video quality is clear, with the presenter's face and the presentation content visible. The overall tone appears to be informative and academic, typical of a conference presentation in the field of data science or machine learning."}, {"start": 360, "end": 390, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and a black tie. The background shows a bookshelf with various books and a framed picture.\n\nThe presentation is titled \"KDD2021\" at the top of the screen. On the right side, there's a section titled \"Some Positive Points\" with bullet points discussing machine learning and statistics.\n\nAt the bottom of the screen, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe man seems to be discussing the intersection of statistics and data science, as evidenced by a Venn diagram visible in the presentation. The diagram shows overlapping circles representing \"Math & Statistics,\" \"Machine Learning,\" and \"Data Science,\" with the center labeled \"Substantive Expertise.\"\n\nThe overall tone of the presentation appears to be informative and educational, likely aimed at an audience interested in data science and related fields."}, {"start": 390, "end": 420, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and glasses, likely Drew Conway, giving a talk about his Venn diagram that illustrates how a statistician sees data science.\n\nThe presentation is divided into two main sections:\n\n1. On the left side, there's a video feed of Drew Conway speaking. He's wearing a light blue button-down shirt and glasses, and he seems to be in a home office setting with a bookshelf and framed pictures in the background.\n\n2. On the right side, there's a slide showing Drew Conway's Venn diagram. The diagram is titled \"Statistical Science, Machine Learning, and Substantive Expertise\" and is divided into three overlapping circles:\n   - Statistical Science\n   - Machine Learning\n   - Substantive Expertise\n\nThe diagram is meant to illustrate the intersection of these three areas in data science.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD2021 conference.\n\nThe overall presentation seems to be discussing the different components and perspectives involved in data science, as seen through the lens of a statistician."}, {"start": 420, "end": 450, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf and framed pictures visible in the background.\n\nThe presentation is titled \"Drew Conway's Venn Diagram: How a Statistician Sees Data Science.\" The slide on the right side of the screen displays a Venn diagram with three overlapping circles:\n\n1. \"Statistical Science\" (purple)\n2. \"Machine Learning & Data Science\" (green)\n3. \"Substantive Expertise\" (blue)\n\nThe diagram illustrates the intersection of these three areas, highlighting the importance of statistical knowledge, machine learning/data science skills, and domain expertise in data science.\n\nThe presenter seems to be explaining the diagram, though the specific content of his speech isn't clear from the video alone. The overall presentation appears to be focused on the interdisciplinary nature of data science and the importance of combining statistical expertise with machine learning and domain knowledge.\n\nThe video quality is clear, with the presenter and the slide content easily visible. The background is slightly blurred, which helps keep the focus on the presenter and the slide."}, {"start": 450, "end": 480, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man named Drew Conway, who is presenting a Venn diagram titled \"How a Statistician Sees Data Science.\"\n\nThe presentation is divided into two main sections:\n\n1. On the left side, there's a video feed of Drew Conway. He's wearing a light blue button-down shirt, glasses, and has a white beard. He's speaking into a microphone and gesturing with his hands as he explains the diagram.\n\n2. On the right side, there's a slide showing the Venn diagram. The diagram has three overlapping circles:\n   - Computer Science (CS)\n   - Machine Learning (ML)\n   - Substantive Expertise\n\nThe diagram illustrates the intersection of these three areas in data science. Drew Conway is explaining that data science is more than just coding, and that substantive expertise is crucial.\n\nThe slide also includes a note that says \"Danger: Most data science happens here,\" highlighting the importance of the intersection between computer science, machine learning, and substantive expertise.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD2021 conference.\n\nThe overall presentation seems to be discussing the multidisciplinary nature of data science and emphasizing the importance of combining technical skills with domain knowledge in this field."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and is positioned in front of a bookshelf with framed pictures.\n\nThe presentation is titled \"Drew Conway's Venn Diagram: How a Statistician Sees Data Science.\" The slide includes a Venn diagram illustrating the intersection of Computer Science, Mathematics & Statistics, and Domain Expertise in data science.\n\nThe diagram shows three overlapping circles:\n1. Computer Science (Machine Learning/Data Science)\n2. Mathematics & Statistics\n3. Domain Expertise\n\nThe areas where these circles intersect are labeled:\n- \"True Applying\" (where all three intersect)\n- \"Dangerous\" (where Computer Science and Mathematics & Statistics intersect)\n- \"Most data science\" (where Computer Science and Domain Expertise intersect)\n- \"Subtractive Expertise\" (where Mathematics & Statistics and Domain Expertise intersect)\n- \"Normal domain knowledge\" (where only Domain Expertise is present)\n\nThe presenter is explaining this diagram, likely discussing the importance of each area in data science and how they interact.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD2021 conference.\n\nThe overall presentation seems to be about the interdisciplinary nature of data science and the different skill sets required for effective data analysis and application."}, {"start": 510, "end": 540, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe presentation is titled \"Drew Conway's Venn Diagram: How a Statistician Sees Data Science.\" The slide behind him includes a Venn diagram with three overlapping circles labeled:\n\n1. Computer Science\n2. Statistics & Machine Learning\n3. Domain Knowledge\n\nThe diagram illustrates the intersection of these fields in data science. There's also text on the slide that reads \"Most data science? Operates here.\"\n\nThe background shows a bookshelf with various books and a framed picture. The overall setting appears to be a home office or study.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD2021 conference.\n\nThe presenter seems to be explaining the concept of data science and its relationship to computer science, statistics, and domain knowledge, as depicted in the Venn diagram."}, {"start": 540, "end": 570, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe presentation is titled \"Drew Conway's Venn Diagram: How a Statistician Sees Data Science\" and includes a Venn diagram illustrating the intersection of Computer Science, Data Science, and Domain Science.\n\nThe video is divided into several segments, each showing different parts of the presentation:\n\n1. The title slide with the speaker's image and the Venn diagram.\n2. A close-up of the speaker's face.\n3. The Venn diagram with labels for Computer Science, Data Science, and Domain Science.\n4. The Venn diagram with additional text explaining the different areas.\n\nThe video seems to be discussing the relationship between these three fields and how they intersect in the realm of data science. The speaker appears to be explaining the concept of the Venn diagram and its relevance to data science.\n\nThe KDD2021 logo is visible in the bottom left corner, indicating that this is part of the Knowledge Discovery and Data Mining conference held in 2021."}, {"start": 570, "end": 600, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt, speaking into a microphone. The background shows a room with bookshelves and a wooden ceiling.\n\nThe main focus of the slide is a Venn diagram titled \"My Data-Science Venn Diagram.\" This diagram illustrates the intersection of three key areas:\n\n1. Computer Science\n2. Machine Learning\n3. Data Science\n\nThe diagram is color-coded, with Computer Science in green, Machine Learning in blue, and Data Science in purple. The overlapping areas represent the intersections between these fields.\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) and the KDD2021 conference logo.\n\nThe overall presentation seems to be discussing the relationship and overlap between these three important areas in the field of data science and machine learning."}, {"start": 600, "end": 630, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and is positioned in front of a bookshelf with framed pictures.\n\nThe presentation is titled \"My Data-Science Venn Diagram\" and includes a visual representation of the intersection between Computer Science, Machine Learning, and Data Science. There's also a mention of \"Domain Science\" in the diagram.\n\nThe background of the video has a blue and green gradient, with the KDD2021 logo prominently displayed. The Association for Computing Machinery (ACM) logo is also visible, indicating their involvement in the conference.\n\nThe presenter seems to be discussing the relationship between these different fields in data science, possibly explaining how they overlap and interact with each other.\n\nOverall, it looks like an informative presentation on the interdisciplinary nature of data science, combining elements from computer science, machine learning, and domain-specific knowledge."}, {"start": 630, "end": 660, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt with a black tie. He's speaking into a microphone, likely giving a talk or presentation.\n\nThe slide has a blue and green background with \"KDD2021\" prominently displayed at the top. On the right side, there's a Venn diagram titled \"My Data-Science Venn Diagram.\" This diagram illustrates the intersection of three key areas in data science:\n\n1. Computer Science: Represented by a green circle labeled \"Math\" and \"Bubbles\" (which likely refers to data visualization).\n\n2. Machine Learning: Shown as a yellow circle.\n\n3. Data Science: Depicted as a pink circle.\n\nThe diagram also includes a purple circle labeled \"Domain Science,\" which is separate from the other three areas, indicating its distinct importance in data science.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the text \"International Conference on Knowledge Discovery and Data Mining.\"\n\nThe overall presentation seems to be discussing the various components and disciplines that make up data science, emphasizing the importance of domain-specific knowledge in addition to technical skills."}, {"start": 660, "end": 690, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe presentation is titled \"The Statistics Claim to Fame\" and includes a slide with a Venn diagram. The diagram shows three overlapping circles labeled \"Computer Science,\" \"Mathematics,\" and \"Domain Science,\" with \"Data Science\" in the center where all three circles intersect.\n\nThe slide also contains a bullet point that reads: \"Concede: Stat is useful when designing randomized algorithms and when analyzing the expected behavior of algorithms on random data.\"\n\nThe video is branded with the KDD2021 logo and the ACM logo, indicating it's part of the Association for Computing Machinery's Knowledge Discovery and Data Mining conference.\n\nThe overall presentation seems to be discussing the role of statistics in data science, particularly in the context of algorithm design and analysis."}, {"start": 690, "end": 720, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt, speaking into a microphone. The background shows a bookshelf and a window.\n\nThe presentation is titled \"The Statistics Claim to Fame\" and includes a slide with text that explains the usefulness of statistics in designing randomized algorithms and analyzing expected behavior on random data. It also mentions the critical issue of validity and provides an example related to census data.\n\nThe video has a professional, academic feel to it, likely aimed at an audience interested in data science, statistics, or computer science topics. The KDD2021 logo is visible, indicating this is part of the Knowledge Discovery and Data Mining conference.\n\nThe man appears to be explaining the importance of statistics in various applications, particularly in the context of randomized algorithms and data analysis."}, {"start": 720, "end": 750, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a white shirt with a black tie and is seated in front of a bookshelf.\n\nThe presentation is divided into two main sections:\n\n1. \"The Statistics Claim to Fame\" - This section discusses the importance of statistics in various applications, particularly in randomized algorithms and analyzing expected behavior of applications on random data. It emphasizes the critical issue of validity and mentions political consequences related to census data reporting.\n\n2. \"A Problem with the Stats Approach\" - This section critiques the traditional statistical approach, suggesting that it often focuses too much on analyzing data rather than using data to solve problems.\n\nThe video is part of the Association for Computing Machinery's KDD2021 conference, as indicated by the logo and text in the bottom left corner of the screen."}, {"start": 750, "end": 780, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or event focused on data science and knowledge discovery. The slide is titled \"A Problem with the Stats Approach\" and features a man speaking in the foreground.\n\nThe man has white hair and is wearing glasses, a white shirt, and a black tie. He's holding a microphone and seems to be giving a lecture or presentation. The background shows a bookshelf and a picture on the wall.\n\nThe slide contains text that discusses a criticism of the statistical approach in data analysis. It states that statisticians often focus too much on analyzing data rather than using it to solve problems. The slide also mentions an example of a \"hackathon\" where participants are given data and asked to find something interesting in it.\n\nThe KDD2021 logo is visible in the bottom left corner, along with the logo for the Association for Computing Machinery (ACM).\n\nThe slide has a blue and green color scheme, with the title \"KDD2021\" prominently displayed at the top."}, {"start": 780, "end": 810, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or event focused on data mining and knowledge discovery. The slide is titled \"A Problem with the Stats Approach\" and is presented by a man with white hair and glasses.\n\nThe slide contains several key points:\n\n1. Statistics put too much value on \"analyzing\" data rather than using the data to solve problems.\n2. Statistics version of a \"hackathon\" that provides data and simply asks contestants to \"find something interesting\" in the data.\n\nThe slide also includes a logo for the Association for Computing Machinery (ACM) and mentions \"KDD\" which stands for Knowledge Discovery in Databases.\n\nThe presenter seems to be discussing the limitations of traditional statistical approaches in data analysis, suggesting that these methods often focus too much on analyzing data for its own sake rather than using it to solve real-world problems. He also mentions a hackathon-style approach where participants are given data and asked to find interesting insights, which he implies may not always lead to useful or actionable results.\n\nThe slide appears to be part of a larger discussion about the challenges and potential improvements in data analysis and knowledge discovery methods."}, {"start": 810, "end": 840, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt, speaking into a microphone. The background shows a room with bookshelves and a wooden ceiling.\n\nThe presentation is divided into two main sections:\n\n1. \"A Problem with the Stats Approach\":\n   - This section discusses issues with traditional statistical methods.\n   - It mentions that statistics often focus too much on analyzing data rather than using it to solve problems.\n   - The speaker suggests that statistics can be seen as a \"hackathon\" where participants are given data and asked to find something interesting or useful.\n\n2. \"Another Stats Problem\":\n   - This section addresses the experimental nature of data science.\n   - It highlights that data science is largely experimental, and the behavior of algorithms in the real world may differ from their performance in controlled environments.\n\nThe presentation is sponsored by the Association for Computing Machinery (ACM) and Computing Machinery (CM).\n\nThe overall tone of the presentation seems to be critical of traditional statistical approaches and emphasizes the experimental nature of data science."}, {"start": 840, "end": 870, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt with a black tie. He's speaking into a microphone, likely delivering a lecture or presentation.\n\nThe slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top. There's a section titled \"Another Stats Problem\" with bullet points discussing data science and algorithm behavior.\n\nThe man is positioned on the left side of the slide, while the title and bullet points are on the right. The slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe overall layout suggests this is part of a professional academic or industry conference presentation, focusing on data science and statistical problems in the field."}, {"start": 870, "end": 900, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a white shirt with a black tie. He's speaking into a microphone and gesturing with his hands as he talks.\n\nThe presentation is divided into two main sections:\n\n1. \"The Mistake to Avoid\" - This part seems to be discussing common pitfalls in data science, emphasizing the importance of practical performance over theoretical perfection.\n\n2. \"Example: Phishing Attacks\" - This section appears to be using Google's phishing detection capabilities as a real-world example to illustrate a point about data science applications.\n\nThe background shows a bookshelf and a framed picture, suggesting the presentation is being given in a home office or similar setting. The video quality is clear, allowing for easy reading of the text on the screen.\n\nThe overall tone of the presentation seems to be informative and educational, aimed at an audience interested in data science and its practical applications."}, {"start": 900, "end": 930, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or event focused on knowledge discovery and data mining. The slide is titled \"Example: Phishing Attacks\" and features a man speaking into a microphone.\n\nThe man has white hair and a beard, wearing glasses and a light blue shirt. He's seated in what looks like a home office setting, with a bookshelf visible in the background.\n\nThe slide contains text that discusses Google's ability to detect phishing emails. It mentions that Google is \"pretty good\" at detecting phishing attacks, but poses the question \"How good?\" It also includes bullet points about how phishing attacks evolve over time.\n\nThe slide has a blue and green color scheme, with the KDD2021 logo in the bottom left corner. The overall presentation style suggests this is part of a professional or academic talk on cybersecurity or data analysis.\n\nThe content seems to be exploring the effectiveness of Google's phishing detection capabilities and how they might need to adapt to evolving threats."}, {"start": 930, "end": 960, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Example: Phishing Attacks\" and features a man speaking into a microphone.\n\nThe man has white hair and is wearing glasses, a light blue shirt, and a black tie. He's standing in front of a bookshelf and a framed picture on the wall. The background is a light brown color.\n\nThe slide contains text that discusses Google's ability to detect phishing emails and mentions how phishing attacks evolve over time. It also includes a statement about the real danger of people sending their life savings to someone claiming to be a Nigerian prince.\n\nThe slide has a blue and green color scheme, with the title \"KDD2021\" prominently displayed at the top. There's also a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nOverall, the video seems to be part of a presentation on cybersecurity, specifically focusing on phishing attacks and their evolution."}, {"start": 960, "end": 990, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and a black tie. The background shows a bookshelf and a framed picture.\n\nThe presentation is divided into two main sections:\n\n1. \"Example: Phishing Attacks\"\n   - Google is described as good at detecting phishing emails.\n   - The speaker discusses how phishing attacks evolve and how precise statistical analysis of failure rates can be misleading.\n   - There's a mention of a \"danger zone\" where people are sending their life savings to someone claiming to be a Nigerian prince.\n\n2. \"Many Other Examples\"\n   - This section lists various other examples, including:\n     - Relating individual genomics to proper medical treatment\n     - Predicting paths of hurricanes, typhoons, etc.\n     - Predicting paths of storms, typhoons, etc."}, {"start": 990, "end": 1020, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green background with the title \"KDD2021\" prominently displayed at the top. Below the title, there's a section titled \"Many Other Examples\" which lists several topics:\n\n1. Relating individual genotypes to proper medical treatment\n2. Predicting paths of hurricanes, typhoons, etc.\n3. Predicting paths of storms, typhoons, etc."}, {"start": 1020, "end": 1050, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black microphone clipped to his shirt. The background shows a bookshelf with various books and a framed picture.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. Below that, there's a section titled \"Many Other Examples\" with bullet points:\n\n- Relating individual genotypes to proper medical treatment\n- Predicting paths of hurricanes, typhoons, etc.\n- Predicting paths of storms, typhoons, etc."}, {"start": 1050, "end": 1080, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on Knowledge Discovery and Data Mining. The slide is titled \"The Machine-Learning Claim\" and contains a bullet point that reads:\n\n\"Conde: Many important problems in data science are asking for a model of some phenomenon. Machine learning often provides more accurate models than other approaches.\"\n\nThe slide has a blue and green background with the KDD2021 logo in the bottom left corner. There's also a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nIn the background, there's a man with white hair and glasses giving a presentation. He's wearing a light blue shirt and has a microphone clipped to his shirt. The setting appears to be a home office or study, with bookshelves visible behind him.\n\nThe slide seems to be discussing the advantages of machine learning in data science, particularly its ability to create more accurate models for various phenomena."}, {"start": 1080, "end": 1110, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe presentation is divided into two main sections:\n\n1. The Machine-Learning Claim:\n   - This section discusses how machine learning often provides more accurate models than other approaches in certain application areas.\n\n2. Figure 1: Cycle for Emerging Technologies:\n   - This part of the presentation shows a graph illustrating the lifecycle of emerging technologies.\n\nThe video is branded with the KDD2021 logo and the Association for Computing Machinery (ACM) logo, indicating it's part of a professional conference on data mining and knowledge discovery.\n\nThe overall setting appears to be a home office or study, with a wooden ceiling and a window visible in the background. The presentation seems to be focused on the topic of machine learning and its applications in various fields."}, {"start": 1110, "end": 1140, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a room with bookshelves and a wooden ceiling.\n\nThe slide has a blue and green abstract design at the top, with \"KDD2021\" prominently displayed in white text. On the right side of the slide, there's a graph titled \"Figure 1: Cycle for Emerging Technologies, 2015.\" This graph shows a timeline with various stages of technology development, including \"Invention,\" \"Development,\" \"Adoption,\" and \"Maturity.\"\n\nAt the bottom of the slide, there's a logo for the \"Association for Computing Machinery\" (ACM) and the KDD2021 conference.\n\nThe overall presentation seems to be discussing the lifecycle of emerging technologies, likely focusing on data mining and knowledge discovery in databases, which are key topics at the KDD conference."}, {"start": 1140, "end": 1170, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe background shows a room with a bookshelf and a framed picture on the wall. The presentation is titled \"KDD2021\" and includes a slide with a graph titled \"Figure 1: Hype Cycle for Emerging Technologies, 2018.\"\n\nThe graph displays various technologies plotted along a timeline, with some marked as \"OPPS\" (Overhyped Promises of Progress). The x-axis represents years, while the y-axis shows the level of hype.\n\nThe slide also includes a legend with different colors representing various stages of the hype cycle, such as \"Technology Trigger,\" \"Peak of Inflated Expectations,\" \"Trough of Disillusionment,\" \"Slope of Enlightenment,\" and \"Plateau of Productivity.\"\n\nThe presenter seems to be discussing the concept of the hype cycle and its application to emerging technologies, likely explaining how different technologies progress through various stages of adoption and maturity.\n\nThe video is part of the Association for Computing Machinery's KDD2021 conference, which focuses on data mining and knowledge discovery in databases."}, {"start": 1170, "end": 1200, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a room with bookshelves and a wooden ceiling.\n\nThe main content of the slide is a graph titled \"Hype Cycle for Emerging Technologies, 2017.\" This graph illustrates the typical progression of new technologies through various stages of development and adoption. The x-axis represents time, while the y-axis shows the level of hype or interest.\n\nThe graph includes several key points:\n1. \"Peak of Inflated Expectations\" - This is where new technologies often start, with high initial excitement and optimism.\n2. \"Trough of Disillusionment\" - As reality sets in and initial enthusiasm fades, many technologies reach this stage.\n3. \"Slope of Enlightenment\" - Here, the technology begins to mature and its true potential starts to be understood.\n4. \"Plateau of Productivity\" - This is where the technology becomes mainstream and reaches its full potential.\n\nThe graph also includes a red line indicating the \"Hype Cycle\" and a blue line representing the \"Realistic Cycle.\" The red line shows the peaks and troughs of hype, while the blue line represents a more realistic trajectory of development.\n\nThe slide is branded with the KDD2021 logo and the logo for the Association for Computing Machinery (ACM). The overall presentation appears to be discussing the lifecycle of emerging technologies and how they progress through different stages of development and adoption."}, {"start": 1200, "end": 1230, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue collared shirt. He's speaking into a microphone and gesturing with his hands as he discusses various topics.\n\nThe presentation includes several slides:\n\n1. A slide titled \"Hype Cycle for Emerging Technologies, 2018\" with a graph showing the progression of technology adoption over time.\n\n2. A slide titled \"Objections to 'ML = Data Science'\" which seems to be addressing common criticisms or misconceptions about machine learning and data science.\n\nThe video is branded with the KDD2021 logo and the Association for Computing Machinery (ACM) logo, indicating it's part of a professional conference on data mining and knowledge discovery.\n\nThe setting appears to be a home office or study, with bookshelves and framed pictures visible in the background. The overall tone suggests an academic or professional discussion on emerging technologies and their applications in data science and machine learning."}, {"start": 1230, "end": 1260, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe presentation is titled \"Objections to 'ML = Data Science'\" and includes a bullet point that reads: \"Objection #1: The ML community claims its own ideas that really came from elsewhere. E.g., clustering, gradient descent, association rules.\"\n\nThe video is divided into two sections. On the left side, we see the presenter, while on the right side, there's a white screen displaying the title and bullet point.\n\nThe KDD2021 logo is visible in the bottom left corner, along with the ACM logo and the text \"Association for Computing Machinery\" in the bottom right corner.\n\nThe overall presentation seems to be discussing the relationship between machine learning (ML) and data science, specifically addressing some objections to the idea that ML is equivalent to data science."}, {"start": 1260, "end": 1290, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his hands as he discusses the topic.\n\nThe presentation is titled \"Objections to 'ML = Data Science'\" and includes two main points:\n\n1. The ML community claims its own ideas that really came from elsewhere.\n2. Not every data science problem is the search for a model.\n\nThe background shows a bookshelf with various books and a framed picture, suggesting an academic or professional setting.\n\nThe video is part of the Association for Computing Machinery's KDD2021 conference, as indicated by the logo and text at the bottom of the screen.\n\nThe man seems to be explaining the differences and potential misconceptions between machine learning (ML) and data science, highlighting that ML is often seen as a subset of data science but has its own unique approaches and challenges."}, {"start": 1290, "end": 1320, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue collared shirt. He's speaking into a microphone, with a bookshelf visible in the background.\n\nThe slide has a blue and green gradient background with the title \"KDD2021\" prominently displayed at the top. Below the title, there's a section titled \"Objections to 'ML = Data Science'\" which lists three objections:\n\n1. The ML community claims its own ideas that really came from elsewhere.\n2. Not every data science problem is the search for a model.\n3. Understandability (sometimes counts)\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) and the acronym \"KDD\" in the bottom left corner.\n\nThe overall presentation style is professional and academic, typical of a conference presentation in the field of data science or machine learning."}, {"start": 1320, "end": 1350, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue collared shirt and is seated in front of a bookshelf. The slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top.\n\nThe main content of the slide is about \"Association Rules,\" which are explained as rules that identify items that cause effects. It mentions that these rules are discovered by counting co-occurrences of sets of items in baskets.\n\nIn the bottom left corner, there's a logo for the Association for Computing Machinery (ACM), which is likely the organization hosting the KDD2021 conference.\n\nThe man seems to be giving a lecture or presentation on this topic, possibly discussing the concept of association rules in data mining or machine learning."}, {"start": 1350, "end": 1380, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black microphone clipped to his shirt. The background shows a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"Association Rules\" with bullet points explaining the concept. The slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe man seems to be giving a lecture or presentation on association rules, which are a type of data mining technique used to discover interesting relationships between variables in large databases."}, {"start": 1380, "end": 1410, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe slide has a blue and green gradient background with the title \"KDD2021\" prominently displayed at the top. Below the title, there's a section titled \"Association Rules\" with a bullet point explaining that association rules are used to identify items that cause effects.\n\nIn the bottom left corner, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe man seems to be giving a lecture or presentation on association rules, likely discussing their development and application in the 1990s as mentioned in the bullet point."}, {"start": 1410, "end": 1440, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on Knowledge Discovery and Data Mining. The slide is titled \"KDD2021\" and features a man giving a presentation.\n\nThe man has white hair and a beard, wearing glasses and a light blue shirt. He's seated in front of a bookshelf, with a framed picture visible on the wall behind him. The presentation is focused on \"Association Rules\" and \"Phishing Attacks.\"\n\nThe slide contains text explaining association rules and providing an example related to phishing attacks. It mentions that items are words in phishing emails, and discovered rules indicate certain combinations of words that suggest phishing attacks.\n\nThe background of the slide has a blue and green gradient, with the KDD logo and the ACM logo visible in the bottom left corner.\n\nThe overall presentation seems to be discussing data mining techniques, specifically association rules, and how they can be applied to identify phishing emails."}, {"start": 1440, "end": 1470, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone, likely giving a talk or presentation.\n\nThe slide has a blue and green background with the KDD2021 logo in the bottom left corner. The main content of the slide is titled \"Example: Phishing Attacks\" and contains text explaining how phishing emails are identified.\n\nThe text on the slide provides an example of how certain word combinations in phishing emails can indicate phishing attacks. It mentions \"Nigerian\" and \"Prince\" as words that, when combined, suggest a phishing attempt.\n\nThe slide also includes a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nThe man in the video seems to be explaining the concept of phishing attacks and how certain words can be used to identify them in emails."}, {"start": 1470, "end": 1500, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue collared shirt and is seated in what looks like a home office setting with a bookshelf and framed pictures visible in the background.\n\nThe presentation is divided into two main sections:\n\n1. \"Example: Phishing Attacks\"\n   - This section discusses phishing emails, referring to them as \"the baskets.\"\n   - It mentions that certain word combinations in these emails can indicate phishing attempts.\n   - The speaker notes that performance is inferior to simple ML models, but the rules are understandable.\n\n2. \"Understandability\"\n   - This section emphasizes the clarity of association rules.\n   - It uses the example of Nigerian prince emails to illustrate how these rules can be easily understood.\n\nThe video is branded with the KDD2021 logo and the ACM logo, indicating it's part of the Association for Computing Machinery's Knowledge Discovery and Data Mining conference.\n\nThe overall tone of the presentation seems to be focused on the advantages of association rules in detecting phishing attacks, particularly highlighting their understandability compared to more complex machine learning models."}, {"start": 1500, "end": 1530, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue collared shirt and has a black tie clip. The background shows a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. Below that, there's a section titled \"Understandability\" with bullet points discussing association rules and their application in spam filtering.\n\nThe man seems to be explaining the concept of understandability in the context of association rules, particularly how they can be used to identify spam emails. He mentions keeping up with Nigerian princes and the importance of understanding why certain emails are flagged as spam.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD), indicating the professional nature of the presentation.\n\nOverall, the video captures a moment from a technical conference presentation, focusing on the topic of understandability in association rules for spam detection."}, {"start": 1530, "end": 1560, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Understandability\" and features a man speaking in the top left corner.\n\nThe man has white hair and a beard, wearing glasses and a light blue collared shirt. He's holding a black object in his right hand, which could be a remote or microphone.\n\nThe slide contains text discussing the concept of understandability in association rules. It mentions:\n- Association rules are understandable.\n- Keeping up with Nigerian princes and their emails.\n- Comparing spam emails to usual emails.\n- Matching whatever model is being used today.\n\nThere's also a bullet point about the problem being more severe if you want to know why your insurance premiums went up for no apparent reason.\n\nThe background of the slide is a gradient of blue and green, with a white border. The KDD2021 logo is visible in the bottom left corner.\n\nOverall, the slide seems to be discussing the importance of explainability in machine learning models, particularly in the context of spam detection and insurance pricing."}, {"start": 1560, "end": 1590, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue collared shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe presentation is titled \"KDD2021\" at the top of the screen. The main topic seems to be about \"Understandability\" in machine learning, as indicated by the text on the screen. The presenter is discussing the challenges of making machine learning models more understandable, using examples like spam emails and insurance premiums.\n\nThe background shows a bookshelf with various books and a framed picture. There's also a logo for \"ACM Computing Machinery\" visible in the bottom right corner.\n\nThe video quality is clear, with the presenter's face and the presentation screen both visible. The overall setting appears to be a professional conference or seminar environment.\n\nThe presenter seems to be explaining complex concepts in a way that's accessible to the audience, likely addressing issues related to transparency and explainability in machine learning models."}, {"start": 1590, "end": 1620, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue collared shirt. He's speaking into a microphone and gesturing with his hands as he explains his theory of when to use machine learning (ML).\n\nThe presentation is divided into two main sections:\n\n1. On the left side, there's a video feed of the speaker. He's standing in front of a bookshelf and a framed picture, with a wooden ceiling visible above.\n\n2. On the right side, there's a slide titled \"My Theory of When to Use ML.\" The slide contains three bullet points:\n   1. \"The problem needs to require a model of something.\"\n   2. \"There is no need to explain to anyone what the model is doing.\"\n   3. \"The problem has to be something you don't understand well.\"\n\nThe slide also includes an example: \"Example: early ML needs to beat natural intelligence in identifying resumes on the Web.\"\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe overall presentation seems to be discussing the appropriate use cases for machine learning, emphasizing that ML is particularly useful for problems that require modeling complex relationships and where human understanding of the model's workings isn't necessary."}, {"start": 1620, "end": 1650, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or event focused on data mining and knowledge discovery. The slide is titled \"My Theory of When to Use ML\" and features a man with white hair and glasses speaking into a microphone.\n\nThe slide contains three key points:\n1. The problem needs to require a model of something.\n2. The model need not explain to anyone what it is doing.\n3. The problem has to be something you don't understand well.\n\nThere's also an example provided: \"Early ML needs: Whizlabs, a company that was trying to beat natural intelligence in identifying resumes on the Web.\"\n\nThe background of the slide is a blue and green gradient, with the KDD2021 logo in the bottom left corner. The man speaking is wearing a light blue shirt with a black tie and is positioned in front of a bookshelf.\n\nThe overall tone of the presentation seems to be discussing the appropriate use cases for machine learning (ML) techniques, emphasizing that ML is particularly useful for problems that are complex or difficult to understand, and where the model doesn't need to be fully explainable to humans."}, {"start": 1650, "end": 1680, "narrative": "The video shows a presentation slide from KDD2021, which is likely a conference or seminar on data science and machine learning. The slide is titled \"My Theory of When to Use ML\" and features three bullet points:\n\n1. The problem needs to require a model of something.\n2. There is no need to explain to anyone what the model is doing.\n3. The problem has to be something you don't understand well.\n\nThe slide also includes an example: \"Example: early ML company 'Whizlabs' went bankrupt trying to beat natural intelligence in identifying resumes on the Web.\"\n\nIn the bottom left corner, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe background of the slide is a gradient of blue and green, with a photo of a man in a white shirt and glasses visible in the bottom left corner. The man appears to be the presenter of the talk.\n\nThis slide seems to be discussing the appropriate use cases for machine learning, emphasizing that ML should be applied to problems that require modeling something, don't need constant explanation, and involve tasks that are difficult to understand or solve without ML."}, {"start": 1680, "end": 1710, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe presentation is titled \"My Theory of When to Use ML\" and includes three bullet points:\n\n1. The problem needs to require a model of something.\n2. The model is something you need to explain to anyone who doesn't understand what you do.\n3. The problem has to be something you don't understand well.\n\nThere's also a section titled \"Not All Big-Data Problems Require Models\" with two examples:\n\n1. Locality-sensitive hashing (Jaccard-Martin)\n2. Approximate counting (Flajolet-Martin)\n\nThe video is branded with the KDD2021 logo and the Association for Computing Machinery (ACM) logo.\n\nThe man seems to be explaining his theories and examples related to machine learning and big data problems. The presentation appears to be part of a larger discussion on when and how to apply machine learning techniques to various data-related challenges."}, {"start": 1710, "end": 1740, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone, likely discussing big data problems and their solutions.\n\nThe presentation slide behind him has a blue and green background with the KDD2021 logo. The main title reads \"Not All Big-Data Problems Require Models.\" Below this, there are two bullet points:\n\n1. Locality-sensitive hashing (LSH)\n2. Approximate counting (Flajolet-Martin algorithm)\n\nThe slide also mentions \"My two favorite examples\" and provides a link to a book called \"Mining of Massive Datasets\" by Leskovec, Rajaraman, and Ullman.\n\nThe setting appears to be a home office, with bookshelves visible in the background. The overall presentation seems to be focused on data science and big data solutions, specifically highlighting techniques that don't necessarily require complex models."}, {"start": 1740, "end": 1770, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black microphone clipped to his shirt. The background shows a bookshelf with various books and a framed picture.\n\nThe slide has a blue and green gradient background with the KDD2021 logo in the bottom left corner. The main title of the slide reads \"Not All Big-Data Problems Require Models.\"\n\nBelow the title, there's a list of two favorite examples:\n1. Locally-sensitive hashing (J. Fiala, J. Leskovec, A. Rajaraman, and J. M. M. D. S.)\n2. Plug for book \"Mining of Massive Datasets\" by J. Leskovec, A. Rajaraman, and J. M. M. D. S.\n\nThe slide also mentions that the book is free, downloadable, and covers these topics and others in data science.\n\nIn the bottom right corner, there's a logo for the Association for Computing Machinery (ACM) and a website link: www.acm.org/kdd and www.mmds.org.\n\nThe overall presentation seems to be discussing data science topics, specifically focusing on big data problems that don't necessarily require complex models."}, {"start": 1770, "end": 1800, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, giving a talk. The presentation is titled \"KDD2021\" and focuses on \"Locality-Sensitive Hashing.\"\n\nThe man is speaking into a microphone and gesturing with his hands as he explains the concept. The background shows a bookshelf and a framed picture, suggesting he's presenting from a home office or similar setting.\n\nThe presentation includes a slide with text that explains the use of locality-sensitive hashing. It mentions that this technique is used when we need to compare each pair of items from a large set and find similar pairs. The slide also provides an example of using this method for entity resolution, where we're given a set of records with fields like name and phone number, and we need to find records that likely refer to the same person.\n\nThe video quality is clear, allowing for easy viewing of the presenter and the slide content. The overall presentation appears professional and informative, aimed at an audience interested in data science and machine learning topics."}, {"start": 1800, "end": 1830, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue collared shirt and is seated in front of a bookshelf. The slide has a blue and green background with the KDD2021 logo in the top left corner.\n\nThe main content of the slide is about \"Locality-Sensitive Hashing.\" It includes a brief explanation of the concept, mentioning its use for comparing items in large sets and finding similar pairs. The slide also notes that it's tricky due to issues like misspelled names and phone changes.\n\nIn the bottom right corner, there's a logo for \"IBM Computing Machinery.\"\n\nThe presentation seems to be focused on data science or machine learning topics, specifically addressing techniques for handling large datasets and identifying similar records."}, {"start": 1830, "end": 1860, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue collared shirt and has a black microphone clipped to his shirt. The background shows a bookshelf and a framed picture.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"Locality-Sensitive Hashing\" with bullet points explaining its use cases.\n\nThe man seems to be giving a presentation on this topic, likely discussing the challenges and applications of locality-sensitive hashing in data analysis and machine learning.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD), indicating the professional and academic nature of the event."}, {"start": 1860, "end": 1890, "narrative": "The video appears to be a presentation slide from KDD2021, featuring a speaker named Dr. David L. Donoho. The slide is titled \"Locality-Sensitive Hashing\" and includes a brief explanation of the concept. \n\nDr. Donoho is shown in a video feed on the left side of the slide. He has white hair and is wearing glasses, a white shirt, and a black tie. The background behind him shows a bookshelf and a framed picture.\n\nThe slide itself has a blue and green color scheme. It contains text explaining the use of locality-sensitive hashing, which is a technique used to find similar items in large datasets. The text mentions that it's particularly useful for finding similar records in a large set, such as identifying records that likely refer to the same person.\n\nThe slide also includes a note about the challenges of using this technique, such as dealing with misspelled names or phone numbers. It mentions that comparing two records with similar values can be computationally expensive, requiring billions of comparisons.\n\nIn the bottom right corner of the slide, there's a logo for the Association for Computing Machinery (ACM).\n\nOverall, the slide provides a concise overview of locality-sensitive hashing, its applications, and some of the challenges associated with its use in large-scale data analysis."}, {"start": 1890, "end": 1920, "narrative": "The video appears to be a presentation slide from KDD2021, featuring a man giving a talk. The slide has a blue and green background with the title \"KDD2021\" prominently displayed at the top. The main content of the slide is about \"Locality-Sensitive Hashing,\" which is a technique used for comparing items in large datasets to find similar pairs.\n\nThe slide includes a list of bullet points explaining the concept, mentioning its use for entity resolution and finding similar records. It also notes the challenges of name misspellings and phone number changes, and the computational complexity involved.\n\nIn the bottom left corner, there's a logo for the Association for Computing Machinery (ACM) and the Computing Machinery logo. The man in the video is wearing glasses and a light blue shirt, and he seems to be gesturing with his hands as he speaks.\n\nThe presentation appears to be focused on data science and machine learning techniques, specifically addressing the challenges of comparing large datasets and finding similar records."}, {"start": 1920, "end": 1950, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a white shirt with a black tie. He's seated in what looks like a home office setting, with a bookshelf visible in the background.\n\nThe slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"LSH - 2\" with bullet points explaining the concept of Locality-Sensitive Hashing (LSH). The text mentions that LSH is used for comparing pairs of items from a large set to find similar pairs, and that it can achieve better than O(n) performance if a few false negatives are accepted.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD), indicating that this is part of a professional conference presentation.\n\nThe man in the video seems to be the presenter, likely discussing the topic of LSH in more detail during the conference."}, {"start": 1950, "end": 1980, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a white shirt and a black tie, and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a white box containing text about LSH (Locality Sensitive Hashing) and its performance.\n\nThe man seems to be discussing the topic of LSH, which is a technique used in data mining and machine learning for approximate nearest neighbor search. He mentions that by accepting a few false negatives, one can achieve better than O(n) performance.\n\nThe overall presentation appears to be focused on data science and machine learning concepts, specifically related to efficient data processing and search algorithms."}, {"start": 1980, "end": 2010, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone, likely giving a lecture or presentation.\n\nThe slide has a blue and green background with the KDD2021 logo in the bottom left corner. The main content of the slide is about LSH (Locality Sensitive Hashing), specifically LSH-2.\n\nThe text on the slide explains that by using LSH-2, you can achieve better than O(n) performance if you're willing to accept a few false negatives. It mentions that by inventing suitable hash functions, similar items have a good chance of winding up in the same bucket, while dissimilar items rarely do.\n\nThe slide also includes a bullet point that says \"Hash many times, only compare items that wind up in the same bucket at least once.\"\n\nIn the bottom right corner, there's a logo for the Association for Computing Machinery (ACM).\n\nThe man in the video seems to be explaining these concepts, likely providing more details and context about LSH-2 and its applications in data mining and machine learning."}, {"start": 2010, "end": 2040, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and a black tie. The background shows a bookshelf with various books and a framed picture.\n\nThe slide has a blue and green color scheme with the title \"KDD2021\" prominently displayed at the top. There's a section labeled \"LSH Example\" which contains text explaining how Locality Sensitive Hashing (LSH) works. The text mentions that LSH can be used to group similar items into the same bucket, even if they don't have identical values.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe man seems to be giving a lecture or presentation on the topic of LSH, likely discussing its applications and benefits in data mining and machine learning."}, {"start": 2040, "end": 2070, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his hands as he explains a concept related to data science or machine learning.\n\nThe presentation is titled \"LSH Example\" and seems to be discussing Locality Sensitive Hashing (LSH), a technique used in data mining and machine learning for approximate nearest neighbor search. The slide includes bullet points that explain how LSH works, particularly for records about people.\n\nThe background shows a bookshelf with various books and a framed picture, suggesting this is taking place in a home office or study. The video quality is clear, allowing for easy reading of the text on the slide.\n\nThe overall tone of the presentation is professional and educational, aimed at an audience interested in data science or related fields."}, {"start": 2070, "end": 2100, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"LSH Example - 2\" and contains text discussing the concept of Locality Sensitive Hashing (LSH).\n\nThe main content of the slide is:\n\n\"Hope that if two records represent the same person, they will be identical in at least one field; different people won't agree in any field.\"\n\nThis statement seems to be explaining the principle behind LSH, which is a technique used in data mining to identify similar items in large datasets.\n\nThe slide also includes a logo for \"ACM Computing Machinery\" and \"KDD\" (Knowledge Discovery and Data Mining), indicating the professional organizations associated with this event.\n\nIn the background, there's a man with white hair and glasses, likely the presenter or speaker for this session. He's wearing a light blue shirt and appears to be giving a presentation.\n\nThe overall layout of the slide is clean and professional, with a blue and green color scheme. The text is clear and easy to read, making it suitable for a technical presentation on data mining concepts."}, {"start": 2100, "end": 2130, "narrative": "The video shows a man giving a presentation at the KDD2021 conference. He appears to be an older gentleman with white hair and a beard, wearing glasses and a light blue button-down shirt. The man is speaking into a microphone, likely discussing a topic related to data science or machine learning.\n\nThe presentation is titled \"LSH Example - 2\" and includes bullet points on the screen. The content seems to be about record matching and data analysis techniques.\n\nThe background shows a bookshelf with various books and a framed picture, suggesting the setting is a home office or study. The video has a professional quality, with a blue and green gradient background and the KDD2021 logo visible.\n\nThe man's expression is serious as he speaks, indicating he's focused on delivering his presentation. The video appears to be a recorded session from the conference, capturing the speaker's presentation in detail."}, {"start": 2130, "end": 2160, "narrative": "The video shows a man giving a presentation at the KDD2021 conference. He appears to be an older gentleman with white hair and a beard, wearing glasses and a light blue button-down shirt. The man is speaking into a microphone, likely discussing a topic related to data science or machine learning.\n\nThe presentation is titled \"LSH Example - 2\" and includes bullet points on the screen. The content seems to be about record matching and data analysis techniques.\n\nThe background of the video shows a room with a bookshelf and a framed picture on the wall. The setting appears to be a professional conference environment.\n\nThe video is a series of still images, likely captured during a live presentation or recorded for later viewing."}, {"start": 2160, "end": 2190, "narrative": "The video appears to be a presentation from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and a black tie. The background shows a bookshelf with various books and framed pictures.\n\nThe presentation is titled \"LSH for Entity Resolution - Summary\" and includes a slide with bullet points. The main points mentioned are:\n\n1. Use fields like name and phone to hash all the records several times.\n2. Compare only the records that appear small number of times in the bucket at least once.\n\nThe slide also includes the KDD logo and the ACM logo, indicating this is an Association for Computing Machinery event.\n\nThe setting appears to be a home office or study, with a wooden ceiling and a window visible in the background. The overall atmosphere suggests a professional yet casual presentation environment.\n\nThis video seems to be discussing techniques for entity resolution, specifically using Locality-Sensitive Hashing (LSH) to improve the efficiency and accuracy of matching records in large datasets."}, {"start": 2190, "end": 2220, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"LSH for Entity Resolution - Summary\" and contains text explaining a technique for entity resolution using Locality Sensitive Hashing (LSH).\n\nThe slide includes a photo of a man with white hair and glasses, who seems to be the presenter. He's wearing a light blue shirt and is positioned in front of a bookshelf.\n\nThe text on the slide provides a summary of the LSH technique for entity resolution, which involves:\n1. Using fields like name and phone to hash all records several times.\n2. Comparing only records that appear together in a bucket at least once.\n\nThe slide also mentions that this approach may miss pairs that don't represent the same person but happen to match exactly in any of the fields used for hashing.\n\nIn the bottom right corner, there's a logo for the Association for Computing Machinery (ACM) and the Computing Machinery logo.\n\nThe background of the slide has a blue and green gradient, with the KDD2021 logo in the bottom left corner.\n\nOverall, this appears to be a technical presentation slide discussing a specific method for entity resolution in data mining, likely aimed at an audience of data scientists or researchers in the field."}, {"start": 2220, "end": 2250, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Approximate Counting\" and contains a brief explanation of the concept.\n\nThe main content of the slide is:\n\n\"Given a stream of elements (approximately)\nhow many different elements are there there.\nExample: users logging on to Facebook; how many distinct users in a month.\"\n\nThe slide is presented by an older man with white hair and glasses, who seems to be explaining the concept. He's wearing a light blue shirt and is positioned in front of a bookshelf.\n\nThe background of the slide has a blue and green gradient, with the KDD2021 logo in the bottom left corner. There's also a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nThe slide appears to be part of a larger presentation on data analysis techniques, specifically focusing on approximate counting methods. This is a technique used to estimate the number of unique elements in a data stream, which is particularly useful for large datasets where exact counting would be computationally expensive or impractical.\n\nThe example given (users logging onto Facebook) illustrates how this concept could be applied in real-world scenarios, such as tracking user activity on social media platforms."}, {"start": 2250, "end": 2280, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Approximate Counting\" and features a man giving a presentation.\n\nThe presenter is an older gentleman with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone and gesturing with his right hand, which is holding a black object that could be a remote or pointer.\n\nThe slide contains text explaining the concept of approximate counting, which is a method for estimating the number of distinct elements in a data stream. It mentions examples like counting users logging into Facebook or book readers on Amazon.\n\nThe slide also includes a bullet point about a naive solution that involves keeping a hash table for every user and counting them if they're new each month. However, it notes that this approach uses a lot of space.\n\nIn the background, there's a bookshelf with various books and a framed picture, suggesting this might be taking place in an office or study setting.\n\nThe slide has a blue and green gradient background with the KDD2021 logo in the bottom left corner. The Association for Computing Machinery (ACM) logo is also visible, indicating their involvement in the event.\n\nOverall, this appears to be a technical presentation on data analysis techniques, specifically focusing on efficient ways to count unique elements in large data sets."}, {"start": 2280, "end": 2310, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt with a black tie. The background shows a bookshelf and a framed picture.\n\nThe slide has a blue and green gradient background with the KDD2021 logo in the bottom left corner. The main content of the slide is titled \"Approximate Counting\" and discusses a problem related to counting distinct elements in a stream.\n\nThe presenter seems to be explaining a naive solution to the problem, which involves keeping a hash table for every user and counting if a user is new each month. He mentions that this solution uses a lot of space.\n\nThe slide also includes a bullet point that says \"Problem: uses a lot of space\" and another that says \"In next example, a case where there are many tables. Don't get too large, but there are tables.\"\n\nOverall, the video appears to be a technical presentation on data stream processing and approximate counting algorithms, likely aimed at an audience of computer scientists or data analysts."}, {"start": 2310, "end": 2340, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black microphone clipped to his shirt. The background shows a bookshelf and a framed picture.\n\nThe presentation is divided into two main sections:\n\n1. Approximate Counting:\n   - This section discusses a problem related to counting elements in a stream.\n   - It mentions a naive solution involving hash tables.\n   - The problem is described as using a lot of space.\n\n2. Example: Approximate Counting:\n   - This part provides a specific example related to web crawling.\n   - It explains that web crawlers can't visit every reachable page.\n   - A common strategy is to prefer visiting high-ranking pages.\n   - However, PageRank can't be computed while crawling.\n\nThe video is presented by the Association for Computing Machinery (ACM) and Computing Machinery (CM). The overall setting suggests a professional academic or technical conference presentation."}, {"start": 2340, "end": 2370, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a blue shirt, giving a presentation. The slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top.\n\nThe main content of the slide is titled \"Example: Approximate Counting\" and includes the following points:\n\n1. \"Web crawlers cannot visit every reachable page.\"\n2. \"A common strategy is to prefer to visit high-PageRank pages.\"\n3. \"PageRank is a measure of the importance of a webpage.\"\n4. \"But you can't compute PageRank while crawling.\"\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe man in the video seems to be explaining the concept of approximate counting in the context of web crawling and PageRank. He appears to be speaking, though the audio isn't described in the image.\n\nThe overall presentation style is professional, with a clear focus on the topic of web crawling and the challenges associated with computing PageRank during the crawling process."}, {"start": 2370, "end": 2400, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's speaking into a microphone, likely giving a talk or lecture.\n\nThe slide has a blue and green background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"Example: Approximate Counting\" with bullet points explaining:\n\n1. Web crawlers can't visit every reachable page.\n2. A common strategy is to prefer to visit high-PageRank pages.\n3. PageRank is a measure of a page's importance.\n4. But you can't compute PageRank while crawling.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe setting appears to be a home office or study, with bookshelves visible in the background. The man seems to be giving a virtual presentation, possibly due to the ongoing COVID-19 pandemic.\n\nOverall, this video captures a moment from a professional conference presentation, focusing on web crawling strategies and the concept of PageRank in the context of data mining and knowledge discovery."}, {"start": 2400, "end": 2430, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf visible in the background.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"Example: Approximate Counting\" with bullet points explaining:\n\n1. Web crawlers cannot visit every reachable page.\n2. A common strategy is to prefer to visit high-PageRank pages.\n3. PageRank cannot be computed while crawling.\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) at the bottom.\n\nThe man in the video seems to be discussing the topic of approximate counting in the context of web crawling and PageRank algorithms."}, {"start": 2430, "end": 2460, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Example: Approximate Counting\" and features a man giving a presentation.\n\nThe man has white hair and is wearing glasses. He's dressed in a light blue shirt and is speaking into a microphone. The background shows a bookshelf and a framed picture, suggesting this is taking place in an office or study setting.\n\nThe slide contains text explaining the concept of approximate counting in web crawling. It mentions that web crawlers can't visit every reachable page and that a common strategy is to prefer visiting high-ranking pages. It also discusses PageRank and how it can't be computed without crawling.\n\nThe slide includes a bullet point that explains an approximation is the number of times a page has been reached. It also mentions counting the number of distinct predecessor pages.\n\nIn the bottom right corner, there's a logo for the Association for Computing Machinery (ACM).\n\nThe overall presentation seems to be discussing techniques for efficiently crawling and indexing web pages, focusing on approximate counting methods to manage the vast amount of data on the internet."}, {"start": 2460, "end": 2490, "narrative": "The video appears to be a presentation slide from KDD2021, which is likely a conference or seminar on data mining and knowledge discovery. The slide is titled \"Example: Approximate Counting\" and features a man speaking in the top left corner.\n\nThe man has white hair and is wearing glasses, a light blue shirt, and a black tie. He seems to be explaining the concept of approximate counting in web crawling.\n\nThe slide contains text that provides an example of approximate counting in web crawling. It mentions that web crawlers can't visit every reachable page and that a common strategy is to prefer to visit high-pagerank pages. It also explains that PageRank is an approximation of the number of times a page has been reached but not crawled, and that this is just fine, as we're guessing the best pages to crawl anyway.\n\nThe background of the slide is a gradient of blue and green, with a wooden ceiling visible. There's also a bookshelf with books and a framed picture on the wall.\n\nIn the bottom right corner, there's a logo for the Association for Computing Machinery (ACM) and the Computing Machinery logo.\n\nOverall, this appears to be a technical presentation slide discussing web crawling strategies and the concept of approximate counting in the context of PageRank."}, {"start": 2490, "end": 2520, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and a black tie. The background shows a bookshelf with various books and a framed picture.\n\nThe presentation is divided into two main sections:\n\n1. Approximate Counting:\n   - The presenter explains that web crawlers can't visit every reachable page.\n   - He mentions a common strategy to prefer visiting high-pagerank pages.\n   - The presenter introduces PageRank as a crawling strategy.\n   - He discusses an approximation method for counting the number of times a page has been reached, but not crawled.\n   - The presenter mentions counting the number of distinct predecessor pages.\n   - He concludes that this is just a fine approximation.\n\n2. Flajolet-Martin Algorithm:\n   - The presenter introduces the Flajolet-Martin Algorithm.\n   - He explains that it gives an approximate count using less space than a table of elements.\n\nThe video is part of the Association for Computing Machinery (ACM) KDD2021 conference, as indicated by the logo and text in the bottom left corner of the screen."}, {"start": 2520, "end": 2550, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black microphone clipped to his shirt. The background shows a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's a section titled \"Flajolet-Martin Algorithm\" with bullet points explaining its function. The text mentions that the algorithm gives an approximate count using less space than a table of elements.\n\nAt the bottom of the slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe man seems to be giving a presentation about the Flajolet-Martin Algorithm, likely discussing its applications and benefits in data analysis or computer science."}, {"start": 2550, "end": 2580, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and has a black tie clip. The background shows a bookshelf with various books and framed pictures.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's information about the Flajolet-Martin Algorithm. This algorithm is used for approximate counting, using less space than keeping a table of elements. It involves keeping several variables, each of which is a small integer (e.g., 100 variables).\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe man seems to be explaining the Flajolet-Martin Algorithm, likely as part of a presentation or lecture at the KDD2021 conference."}, {"start": 2580, "end": 2610, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a bookshelf with various books and a framed picture.\n\nThe slide has a blue and green gradient background with the text \"KDD2021\" prominently displayed at the top. On the right side of the slide, there's information about the Flajolet-Martin Algorithm. This algorithm is described as giving an approximate count using less space than a table of elements. It keeps several small integer variables, each of which is a small integer (e.g., 100 variables). For each variable V there is a hash function h_V.\n\nThe slide also includes the logo for the Association for Computing Machinery (ACM) and the acronym \"ICDM\" at the bottom.\n\nThe man in the video seems to be explaining or presenting this algorithm, likely as part of a lecture or presentation at the KDD2021 conference."}, {"start": 2610, "end": 2640, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a light blue shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe slide is titled \"KDD2021\" at the top and includes information about the Flajolet-Martin Algorithm. This algorithm is used for approximate counting, which is particularly useful for large datasets.\n\nThe slide provides key points about the algorithm:\n1. It gives an approximate count using much less space than a table of elements.\n2. It keeps several small variables, each of which is a small integer (V).\n3. For each variable, it uses a hash function to hash each input user name, e.g., to a bit string.\n4. The tail length of a bit string is the number of consecutive 0's at its end.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe overall presentation seems to be focused on data analysis techniques, specifically the Flajolet-Martin Algorithm, which is a probabilistic data structure used for estimating the number of distinct elements in a stream of data."}, {"start": 2640, "end": 2670, "narrative": "The video appears to be a presentation slide from KDD2021, featuring a man giving a lecture. The slide is titled \"Flajolet-Martin Algorithm\" and provides information about this algorithm. The man is wearing a white shirt with a black tie and glasses, and he has white hair and a beard. He's speaking into a microphone.\n\nThe slide contains text explaining the Flajolet-Martin Algorithm, which is used for approximate counting. It mentions that the algorithm gives an approximate count using less space than a table of elements, and that it keeps several small integer variables, each of which is a small integer.\n\nThe background of the slide shows a room with bookshelves and a picture on the wall. There's also a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nThe overall presentation seems to be focused on computer science or data analysis topics, specifically discussing efficient counting algorithms."}, {"start": 2670, "end": 2700, "narrative": "The video shows a presentation slide from KDD2021, featuring a man giving a lecture. The slide is titled \"Flajolet-Martin Algorithm\" and provides an explanation of this algorithm. The man appears to be an older gentleman with white hair and glasses, speaking into a microphone.\n\nThe slide contains text that explains the Flajolet-Martin Algorithm, which is used for approximate counting. It mentions that the algorithm gives an approximate count using less space than a table of elements. The slide also includes bullet points that provide more details about the algorithm's operation.\n\nIn the background, there's a bookshelf with various books and a framed picture. The setting appears to be a home office or study room.\n\nThe slide includes logos for KDD (Knowledge Discovery and Data Mining) and ACM (Association for Computing Machinery), indicating that this is part of a professional conference presentation.\n\nThe man in the video seems to be explaining the Flajolet-Martin Algorithm in detail, likely discussing its applications and benefits in data mining and approximate counting techniques."}, {"start": 2700, "end": 2730, "narrative": "The video shows a presentation slide from KDD2021, featuring a man speaking in the top left corner. The slide is titled \"KDD2021\" and contains information about the Flajolet-Martin Algorithm.\n\nThe main content of the slide is a description of the Flajolet-Martin Algorithm, which is used for approximate counting. It mentions that the algorithm gives an approximate count using less space than a table of elements. The algorithm works by keeping several variables, each of which is a small integer. For each input, it uses a hash function to determine the tail length of a bit string. The algorithm records the largest tail length seen so far using its hash function. It also notes that duplicates cannot affect the value of V.\n\nThe slide has a blue and green background with a white text box containing the algorithm's description. There's also a logo for the Association for Computing Machinery (ACM) in the bottom right corner.\n\nThe man in the video appears to be explaining the content of the slide, likely providing additional context or details about the Flajolet-Martin Algorithm."}, {"start": 2730, "end": 2760, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and is seated in what looks like a home office setting with a bookshelf and framed pictures in the background.\n\nThe presentation is titled \"Flajolet-Martin Algorithm\" and seems to be discussing a specific algorithm used in data analysis or computer science. The slide on the right side of the screen provides some details about the algorithm, mentioning that it gives an approximate count using less space than a table of elements.\n\nThe video quality is clear, with the presenter's face and the slide content visible. The overall atmosphere suggests a professional academic or technical presentation, likely aimed at an audience interested in data science or related fields."}, {"start": 2760, "end": 2790, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue button-down shirt and is seated in what looks like a home office setting with a bookshelf and framed pictures in the background.\n\nThe slide has a blue and green gradient background with \"KDD2021\" prominently displayed at the top. On the right side, there's text explaining the Flajolet-Martin Algorithm, which is a probabilistic algorithm used for estimating the number of distinct elements in a large dataset.\n\nThe man seems to be explaining the algorithm, gesturing with his hands as he speaks. The overall presentation style suggests this is a recorded talk or webinar from the conference.\n\nThe slide also includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD), indicating the professional and academic nature of the event."}, {"start": 2790, "end": 2820, "narrative": "The video appears to be a presentation slide from the KDD2021 conference. It features a man with white hair and a beard, wearing glasses and a blue shirt, speaking into a microphone. The background shows a bookshelf and a framed picture.\n\nThe slide has a blue and green gradient background with \"KDD2021\" prominently displayed at the top. On the right side, there's text explaining the Flajolet-Martin Algorithm, which is used to estimate the number of distinct elements in a dataset.\n\nThe presenter seems to be discussing how the algorithm works, mentioning that if a variable V holds the largest tail length, then V estimates you have seen 2^P different elements. He also explains that this gives a rough estimate of how many different values you need to get R0s at the end.\n\nThe slide includes logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD), indicating the professional and academic nature of the presentation.\n\nOverall, the video captures a moment from a technical presentation at a major data mining and knowledge discovery conference, focusing on an advanced algorithm used in data analysis."}, {"start": 2820, "end": 2850, "narrative": "The video appears to be a presentation slide from KDD2021, featuring a man with white hair and a beard. He's wearing glasses and a light blue button-down shirt. The slide has a blue and green background with the KDD2021 logo in the bottom left corner.\n\nThe main content of the slide is about the Flajolet-Martin Algorithm, which is a probabilistic algorithm used for estimating the number of distinct elements in a large dataset. The text on the slide explains that if a variable V holds the largest tail length, then V estimates you have seen 2^V different elements. It also mentions that to get an accurate estimate, you need to get the R0s at different values and combine the estimates from different variables (a bit of a trick) to get an accurate estimate of the number of different values seen.\n\nThe slide seems to be part of a larger presentation on data analysis or computer science topics, given the reference to the Association for Computing Machinery (ACM) in the bottom right corner."}, {"start": 2850, "end": 2880, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue collared shirt. He's speaking into a microphone and gesturing with his right hand.\n\nThe presentation is divided into two main sections:\n\n1. The Flajolet-Martin Algorithm:\n   - This section explains how to estimate the number of different values seen in a dataset.\n   - It mentions that if a variable V holds the largest tail length, then V estimates you have seen 2^P different elements.\n   - The presenter suggests combining estimates from different variables to get a more accurate estimate.\n\n2. Conclusions:\n   - The conclusion section states that data science is a natural evolution of work in many branches of computer science.\n   - It emphasizes the importance of data science for managing large datasets and its impact on science and industry.\n\nThe background shows a bookshelf with various books and framed pictures, suggesting a home office or study setting. The video has a professional, academic feel to it, likely aimed at an audience interested in data science and computer science topics.\n\nThe KDD2021 logo is visible in the bottom left corner, indicating this is part of the Knowledge Discovery and Data Mining conference held in 2021."}, {"start": 2880, "end": 2910, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features an older man with white hair and a beard, wearing glasses and a light blue button-down shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe presentation is titled \"KDD2021 Conclusions\" and includes a slide with bullet points discussing data science and its evolution from computer science. The slide mentions that data science is a natural evolution of work in many branches of computer science, particularly in managing large datasets.\n\nThe man seems to be speaking about the impact of data science on science and industry, though the exact content of his speech isn't clear from the video alone.\n\nThe video has a professional, academic feel to it, likely aimed at an audience interested in data science, computer science, or related fields."}, {"start": 2910, "end": 2940, "narrative": "The video appears to be a presentation or lecture from the KDD2021 conference. It features a man with white hair and glasses speaking into a microphone. He's wearing a light blue shirt and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe presentation is divided into two main sections:\n\n1. A slide with the title \"Conclusions\" and three bullet points discussing data science, statistics, and machine learning.\n\n2. A virtual conference screen showing the KDD2021 logo and the speaker's name.\n\nThe background of the presentation slide is a gradient of blue and green, with the KDD2021 logo and the Association for Computing Machinery (ACM) logo visible at the bottom.\n\nThe virtual conference screen displays the KDD2021 logo, the speaker's name, and the date \"18th\" in a purple and blue color scheme.\n\nThe overall presentation seems to be discussing the evolution of data science and its relationship to other fields like statistics and machine learning."}, {"start": 2940, "end": 2970, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and prominently display \"KDD2021\" and \"VIRTUAL CONFERENCE\" text.\n\nThe slides show a man in a white shirt with a black tie, likely a speaker or presenter at the conference. He has short black hair and is looking directly at the camera. The background behind him is blurred, suggesting he's in a home or office setting.\n\nEach slide has a similar layout, with the KDD 2021 logo and text in the top right corner, and the ACM logo in the bottom right corner. The ACM logo is accompanied by the text \"Association for Computing Machinery.\"\n\nThe slides are arranged in a sequence, with the man appearing on each one. The background behind him remains consistent across all slides, maintaining the same blurred effect.\n\nThis video seems to be a recording of a presentation or lecture from the KDD 2021 conference, showcasing the speaker and the conference branding."}, {"start": 2970, "end": 3000, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and prominently display \"KDD 2021\" in white text.\n\nEach slide shows a man with white hair and glasses, likely a speaker or presenter at the conference. He's wearing a dark green shirt and is seated in front of a bookshelf. The background is a white wall with a wooden ceiling.\n\nThe slides also include logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe video seems to be a recording of a presentation or lecture from the KDD 2021 conference, showcasing the speaker and the conference branding."}, {"start": 3000, "end": 3030, "narrative": "The video appears to be a recording from the KDD 2021 virtual conference. It shows an older man with white hair and a beard, wearing glasses and a dark green shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe video has a professional, conference-style layout. In the top left corner, there's a blue banner with \"KDD2021\" written in white text. The top right corner features a blue background with a white wave-like design, also displaying \"KDD2021\" in white text.\n\nAt the bottom of the screen, there's a blue banner with the KDD logo and the ACM logo, along with the text \"Association for Computing Machinery\" in white.\n\nThe man in the video seems to be speaking, though the audio isn't described. The overall presentation gives the impression of a formal, academic conference presentation or lecture."}, {"start": 3030, "end": 3060, "narrative": "The video appears to be a recording of a virtual conference presentation. It shows a man with white hair and a beard, wearing glasses and a dark green shirt, seated in what looks like a home office setting. Behind him is a bookshelf filled with various books and framed pictures.\n\nThe video is branded with \"KDD2021\" prominently displayed at the top, indicating it's part of the Knowledge Discovery and Data Mining (KDD) conference held in 2021. There's also a logo for the Association for Computing Machinery (ACM) visible.\n\nThe background of the video features a blue and green abstract design, which is likely part of the conference's virtual interface. The overall presentation has a professional and organized appearance, typical of academic or industry conferences.\n\nThe man seems to be speaking or presenting, though the specific content of his talk isn't visible in the video. The setting suggests this is a remote presentation, likely due to the circumstances of the pandemic.\n\nThis video captures a moment from a significant event in the field of data mining and knowledge discovery, showcasing how such conferences have adapted to virtual formats."}, {"start": 3060, "end": 3090, "narrative": "The video appears to be a recording of a virtual conference presentation. It features a man with white hair and a beard, wearing glasses and a dark green shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe video is divided into two sections:\n\n1. On the left side, we see the presenter. He's speaking, though the audio isn't provided in the description.\n\n2. On the right side, there's a presentation slide. It has a blue background with green and yellow wavy lines. The slide displays \"VIRTUAL CONFERENCE\" at the top and \"KDD2021\" below it. There are also logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe overall layout suggests this is a professional presentation, likely related to data mining or knowledge discovery in databases, given the KDD2021 reference. The virtual conference format indicates this was likely recorded during the COVID-19 pandemic when in-person conferences were not feasible."}, {"start": 3090, "end": 3120, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and the KDD logo prominently displayed.\n\nThe main content of the slides includes:\n\n1. A title slide with \"KDD2021\" at the top.\n2. A virtual conference banner with \"KDD2021\" and the dates \"14th - 18th\".\n3. A speaker's image on the left side of the slide.\n4. The KDD logo and \"ACM\" logo on the right side.\n\nThe slides seem to be part of a presentation or lecture from the conference. The speaker's image is consistent across the slides, suggesting it's the same person presenting throughout.\n\nThe overall design is professional and modern, with a clean layout that focuses on the conference branding and the speaker's image. The use of blue and green creates a visually appealing and cohesive look for the presentation."}, {"start": 3120, "end": 3150, "narrative": "The video appears to be a recording from the KDD 2021 virtual conference. It features a man with white hair and glasses speaking into a webcam. He's wearing a dark green shirt and is seated in what looks like a home office setting with a bookshelf and framed pictures in the background.\n\nThe video is split into two sections. On the left side, we see the speaker's face and upper body. On the right side, there's a promotional graphic for the conference. This graphic has a blue background with wavy green and yellow lines, and it prominently displays \"KDD 2021\" along with the dates \"14th - 18th\" and the text \"VIRTUAL CONFERENCE.\"\n\nAt the bottom of the screen, there are logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD). The ACM logo is a blue shield with a gear and the letters \"ACM\" inside it, while the KDD logo is a blue shield with a gear and the letters \"KDD\" inside it.\n\nThe overall layout suggests this is a professional presentation or lecture from the KDD 2021 conference, likely discussing topics related to knowledge discovery and data mining."}, {"start": 3150, "end": 3180, "narrative": "The video displays a virtual conference presentation for KDD2021, which stands for the 2021 ACM SIGKDD Conference on Knowledge Discovery and Data Mining. The screen is divided into two main sections:\n\nOn the left side, we see a man with white hair and glasses. He's wearing a dark green shirt and appears to be seated in a home office setting. The background shows a bookshelf with various books and framed pictures.\n\nOn the right side, there's a promotional graphic for the virtual conference. It features a blue and green wave-like design with the text \"VIRTUAL CONFERENCE\" and \"KDD2021\" prominently displayed. Below this, there are logos for the Association for Computing Machinery (ACM) and the KDD conference.\n\nAt the bottom of the screen, there's a blue banner with the KDD logo and the text \"Association for Computing Machinery\" and \"KDD\" visible.\n\nThe overall layout suggests this is a live presentation or recording from the KDD2021 virtual conference, showcasing a speaker and providing information about the event."}, {"start": 3180, "end": 3210, "narrative": "The video displays a virtual conference presentation for KDD2021, which stands for the 2021 ACM SIGKDD Conference on Knowledge Discovery and Data Mining. The screen is divided into two main sections:\n\nOn the left side, we see a man with white hair and a beard, wearing glasses and a dark green shirt. He appears to be seated in a home office setting, with a bookshelf visible behind him. The man is speaking, likely delivering a presentation or lecture.\n\nOn the right side, there's a blue and green abstract background with the text \"VIRTUAL CONFERENCE\" and \"KDD2021\" prominently displayed. Below this, there's a white rectangle containing the KDD logo and the ACM logo, along with the text \"Association for Computing Machinery.\"\n\nThe overall layout suggests this is a professional academic conference presentation, with the speaker on the left and conference branding on the right. The design is clean and modern, typical of virtual conference setups."}, {"start": 3210, "end": 3240, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and prominently display \"KDD2021\" in white text.\n\nThe slides show a man with gray hair and glasses, likely a speaker or presenter at the conference. He's wearing a dark green shirt and is seated in front of a bookshelf. The background is a white wall with a wooden ceiling.\n\nEach slide includes the conference logo and the text \"VIRTUAL CONFERENCE\" in white. There's also a blue banner at the bottom with the KDD logo and the text \"Association for Computing Machinery\" in white.\n\nThe slides are arranged in a sequence, with the man appearing in different poses and expressions across the frames. Some slides show him speaking, while others capture him in a more relaxed posture.\n\nThe overall presentation style is professional and organized, typical of a virtual academic conference. The consistent design elements and the man's presence across multiple slides suggest this is likely a recorded presentation or lecture from the KDD 2021 event."}, {"start": 3240, "end": 3270, "narrative": "The video appears to be a promotional or informational clip for the KDD 2021 conference. It features a man speaking in front of a vibrant, colorful background with abstract shapes in shades of purple, blue, green, and yellow. The man is wearing a white shirt and has short black hair.\n\nThe video prominently displays the text \"KDD2021\" in large white letters, along with \"VIRTUAL CONFERENCE\" and the dates \"14th - 18th\" in smaller text. There's also a logo for the Association for Computing Machinery (ACM) visible in the bottom right corner.\n\nThe background design is quite eye-catching, with a mix of geometric shapes and wavy patterns that create a dynamic and modern aesthetic. This visual style likely aims to convey the innovative and cutting-edge nature of the conference.\n\nOverall, the video seems to be designed to attract attention and provide key information about the KDD 2021 virtual conference, including its name, virtual format, and dates."}, {"start": 3270, "end": 3300, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. Each slide features a different speaker, all of whom are older men with white or gray hair. The background of each slide is a vibrant, abstract design with wavy lines in various colors including blue, green, purple, and pink.\n\nThe main text on each slide reads \"KDD 2021\" and \"VIRTUAL CONFERENCE,\" with \"KDD 2021\" prominently displayed in white letters on a blue background. Below this, there's a smaller text that says \"4th - 18th.\"\n\nIn the bottom left corner of each slide, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo, which consists of a gear-like symbol.\n\nThe speakers are shown in a video call format, with each slide featuring a different man. They all appear to be engaged in conversation, with some gesturing with their hands as they speak.\n\nThe overall design of the slides is modern and visually appealing, with a consistent color scheme and layout across all slides. The use of vibrant colors and abstract shapes creates an energetic and dynamic feel, which is fitting for a virtual conference presentation."}, {"start": 3300, "end": 3330, "narrative": "The video displays a virtual conference presentation for KDD2021, which stands for the 2021 ACM SIGKDD Conference on Knowledge Discovery and Data Mining. The screen is divided into two main sections:\n\nOn the left side, we see a man with white hair and glasses speaking. He's wearing a dark green shirt and appears to be in a home office setting with a bookshelf and framed pictures in the background.\n\nThe right side of the screen features the conference branding. It has a blue and green abstract background with the text \"VIRTUAL CONFERENCE\" and \"KDD2021\" prominently displayed. Below this, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nAt the bottom of the screen, there's a blue banner with the KDD logo and the ACM logo, along with the text \"Association for Computing Machinery\" and \"KDD.\"\n\nThe overall layout suggests this is a professional presentation or keynote address being delivered at the virtual KDD2021 conference."}, {"start": 3330, "end": 3360, "narrative": "The video appears to be a recording from the KDD 2021 virtual conference. It features an older man with white hair and a beard, wearing glasses and a green shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe video is split into two sections. On the left side, we see the man speaking, likely giving a presentation or lecture. On the right side, there's a promotional graphic for the KDD 2021 conference. This graphic includes the conference logo, the text \"VIRTUAL CONFERENCE KDD 2021,\" and the logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe background of the video has a blue and green gradient, with a wave-like pattern that adds a dynamic visual element to the presentation.\n\nOverall, this video seems to be a recorded session from a professional conference, showcasing a speaker and promoting the event itself."}, {"start": 3360, "end": 3390, "narrative": "The video displays a series of slides from the KDD 2021 virtual conference. The slides feature a man speaking, likely a presenter or keynote speaker, with a background of colorful abstract shapes in purple, blue, and green.\n\nThe main elements of the slides include:\n\n1. \"KDD2021\" prominently displayed at the top.\n2. \"VIRTUAL CONFERENCE\" text.\n3. \"KDD2021\" repeated on the right side.\n4. Dates \"14th - 18th\" indicating the conference dates.\n5. Logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe man in the video appears to be giving a presentation, with his face visible in the center of the slide. He's wearing a white shirt and has short black hair.\n\nThe slides are designed to be visually appealing and professional, with a modern, tech-focused aesthetic that aligns with the conference's theme of knowledge discovery and data mining.\n\nThis video seems to be a recording or live stream of a presentation at the KDD 2021 virtual conference, showcasing the event's branding and the speaker's content."}, {"start": 3390, "end": 3420, "narrative": "The video appears to be a recording of a virtual conference session from KDD 2021, which stands for the 2021 ACM SIGKDD Conference on Knowledge Discovery and Data Mining. The conference took place from August 14th to 18th, 2021.\n\nThe video features a man with white hair and glasses, who is likely a speaker or presenter at the conference. He's seated in what looks like a home office setting, with a bookshelf visible in the background. The man is wearing a dark green shirt and appears to be speaking into a microphone.\n\nThe video has a professional, organized layout. On the left side, there's a blue banner with \"KDD2021\" written in white text. Below that, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nOn the right side of the screen, there's a larger banner with \"VIRTUAL CONFERENCE\" written in white text, followed by \"KDD2021\" in a larger font. This banner has a blue background with green and yellow wavy lines, giving it a modern, dynamic look.\n\nThe overall presentation is clean and professional, designed to convey the importance and formality of the conference while also adapting to the virtual format."}, {"start": 3420, "end": 3450, "narrative": "The video appears to be a recording of a virtual conference presentation. It features an older man with white hair and a beard, wearing glasses and a dark green shirt. He's seated in what looks like a home office setting, with a bookshelf visible behind him.\n\nThe video is divided into two sections:\n\n1. On the left side, we see the presenter. He's speaking, though the audio isn't clear enough to make out what he's saying.\n\n2. On the right side, there's a virtual conference screen displaying the event's branding. It shows \"KDD2021\" prominently, along with \"VIRTUAL CONFERENCE\" and \"KDD2021\" again. The background of this screen has a blue and green wave-like pattern.\n\nAt the bottom of the screen, there are logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD).\n\nThe overall layout suggests this is a professional presentation or lecture being delivered remotely for the KDD2021 conference."}, {"start": 3450, "end": 3480, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and the KDD logo prominently displayed.\n\nThe main content of the slides includes:\n\n1. A large \"KDD2021\" text at the top.\n2. A \"VIRTUAL CONFERENCE\" banner.\n3. The dates \"14th - 18th\" indicating the conference dates.\n4. The KDD logo and the ACM logo (Association for Computing Machinery).\n\nThe slides also show a man's face in the center, likely a speaker or presenter at the conference. The background behind the man's face is a gradient of blue and green, with a wavy pattern.\n\nAt the bottom of the slides, there's a blue banner with the KDD logo and the ACM logo, along with the text \"Association for Computing Machinery\" and \"KDD\".\n\nThe video seems to be a montage of these slides, possibly used as a background or introduction for the virtual conference sessions."}, {"start": 3480, "end": 3510, "narrative": "The video appears to be a recording of a virtual conference presentation. It features a man with white hair and glasses seated in what looks like a home office setting. He's wearing a dark green shirt and is positioned in front of a bookshelf with various books and framed pictures.\n\nThe video is divided into two sections. On the left side, we see the presenter, while on the right side, there's a slide with the conference details. The slide has a blue background with green and yellow wavy lines, and it displays \"VIRTUAL CONFERENCE\" at the top, followed by \"KDD2021\" in large white letters.\n\nAt the bottom of the slide, there are logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD). The conference dates are also visible, showing it took place from August 14th to 18th.\n\nThe overall layout suggests this is a professional presentation, likely related to data mining or knowledge discovery in databases, given the KDD acronym. The setting appears to be a typical virtual conference setup, with the presenter visible on one side and the presentation slide on the other.\n\nThis video seems to be part of a larger series of presentations from the KDD2021 conference, showcasing various experts in the field of data science and related topics."}, {"start": 3510, "end": 3540, "narrative": "The video appears to be a recording from the KDD 2021 virtual conference. It features a man with white hair and glasses speaking into a webcam. He's wearing a green shirt and is seated in what looks like a home office setting with a bookshelf and framed pictures visible in the background.\n\nThe video is split into two sections. On the left side, we see the speaker's face and upper body. On the right side, there's a promotional graphic for the conference. This graphic has a blue and green color scheme with the text \"VIRTUAL CONFERENCE\" and \"KDD 2021\" prominently displayed.\n\nAt the bottom of the screen, there are logos for the Association for Computing Machinery (ACM) and the International Conference on Knowledge Discovery and Data Mining (KDD). The KDD logo is particularly noticeable, featuring a gear-like design.\n\nThe overall layout suggests this is a professional presentation or lecture from the KDD 2021 conference, likely discussing topics related to data mining, machine learning, or other areas of computer science and artificial intelligence."}, {"start": 3540, "end": 3570, "narrative": "The video appears to be a recording of a virtual conference presentation. It shows a man with white hair and a beard speaking into a microphone. He's wearing glasses and a dark green shirt, and is seated in front of a bookshelf with various books and framed pictures.\n\nThe background is a simple white wall with a wooden ceiling, giving it a home office or study-like appearance. The man seems to be engaged in a discussion or lecture, possibly about a topic related to data science or machine learning, given the context of the KDD2021 conference.\n\nOn the right side of the screen, there's a blue banner with the text \"VIRTUAL CONFERENCE\" and \"KDD2021\" in white. Below that, there's a logo for the Association for Computing Machinery (ACM) and the KDD logo.\n\nThe video has a professional, organized look typical of academic or industry conferences. It's likely part of a larger series of presentations or panels from the KDD2021 event, which focuses on knowledge discovery and data mining."}, {"start": 3570, "end": 3600, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides feature a consistent design with a blue and green color scheme, and prominently display \"KDD2021\" and \"VIRTUAL CONFERENCE\" text.\n\nThe slides show a man with white hair and glasses, likely a speaker or presenter at the conference. He's wearing a dark green shirt and is seated in front of a bookshelf. The background is a white wall with a picture frame.\n\nThe slides are arranged in a grid-like pattern, with each slide showing the same man in different poses or expressions. This creates a sense of continuity and professionalism throughout the presentation.\n\nIn the bottom left corner of each slide, there's a logo for the Association for Computing Machinery (ACM), which is the organization hosting the KDD conference. The bottom right corner features the KDD logo.\n\nThe overall design is clean and modern, with a professional look that's typical of academic or industry conferences. The consistent use of the same man across multiple slides suggests this might be a keynote presentation or a series of related talks by the same speaker.\n\nThe video seems to be a recording of the virtual conference, likely used for on-demand viewing or as a reference for attendees."}, {"start": 3600, "end": 3630, "narrative": "The video appears to be a series of slides from the KDD 2021 virtual conference. The slides have a consistent design with a blue and green color scheme, featuring the KDD logo and the conference title \"KDD 2021\" prominently displayed.\n\nEach slide shows a different speaker, all of whom are men with short black hair. They are wearing white shirts and appear to be giving presentations or speeches. The background of each slide is a gradient of blue and green, with the KDD logo and conference title in white text.\n\nThe slides also include the text \"VIRTUAL CONFERENCE\" and \"KDD 2021\" in white, along with the dates \"4th - 18th\" in a smaller font. There's also a logo for the Association for Computing Machinery (ACM) and the KDD logo at the bottom of each slide.\n\nThe overall design is professional and consistent, suggesting this is part of a formal academic or industry conference presentation."}]