[{"start": 0, "end": 30, "narrative": "The video displays a presentation slide from the Cornell Future of Learning Lab. The slide has a clean, professional design with a white background and a red header. The title of the presentation is \"LARGE SCALE STUDENT DATA REVEAL SOCIODEMOGRAPHIC GAPS IN PROCRASTINATION BEHAVIOR.\"\n\nBelow the title, there are three names listed:\n- SUNIL SABNIS, CORNELL UNIVERSITY\n- RENZHE YU, UNIVERSITY OF CALIFORNIA, IRVINE\n- RENE KIZILC, CORNELL UNIVERSITY\n\nIn the bottom left corner of the slide, there's a logo for the Cornell Future of Learning Lab, which consists of a red square with a white \"C\" inside it.\n\nThe slide appears to be part of a larger presentation, as there's a webcam feed visible in the top right corner of the screen, showing a person seated at a desk with a computer monitor. This suggests the presentation is being delivered remotely, possibly during a virtual conference or seminar.\n\nThe overall layout is simple and professional, focusing on delivering the key information about the research topic. The use of red and white creates a strong visual contrast, making the text easy to read against the white background."}, {"start": 30, "end": 60, "narrative": "The video displays a presentation slide titled \"LARGE SCALE STUDENT DATA REVEAL SOCIOGRAPHIC GAPS IN PROcrastination BEHAVIOR\". The slide is part of a presentation by the Cornell Future of Learning Lab. The slide is divided into two main sections:\n\n1. The top section contains the title and the names of the presenters:\n   - Sunil Sabnis, Cornell University\n   - Renzhe Li, University of California, Irvine\n   - Renee Kizilcec, Cornell University\n\n2. The bottom section is titled \"OVERVIEW\" and includes three bullet points:\n   - Large scale behavioral analytics\n   - Examine procrastination across sociodemographic groups\n   - Understand how procrastination relates to educational inequalities\n\nThe slide also features a logo for the Cornell Future of Learning Lab in the bottom left corner. The background of the slide is a light beige color with a red banner at the top.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a laptop and a clock, which visually represents the topic of procrastination.\n\nThe slide appears to be part of a larger presentation discussing the relationship between procrastination behavior and sociodemographic factors, particularly in the context of educational outcomes."}, {"start": 60, "end": 90, "narrative": "The video displays a PowerPoint presentation slide about procrastination. The slide has a clean, professional design with a red header and a beige background. The main title \"PROcrastination\" is prominently featured in bold red letters.\n\nThe slide contains several key elements:\n\n1. A large \"LATER\" sign with a speech bubble, indicating the concept of delaying tasks.\n\n2. A stack of books with a person sitting in front of them, symbolizing the accumulation of work or tasks.\n\n3. A computer monitor with a graph and an exclamation mark, representing the consequences of procrastination, such as increased stress or poor performance.\n\n4. Two icons labeled \"Intrinsic\" and \"External,\" likely referring to internal and external factors that contribute to procrastination.\n\n5. A small icon of a person sitting at a desk with a computer, possibly representing the individual experiencing procrastination.\n\nAt the bottom of the slide, there's a reference to a study: \"Self-regulated learning strategies and higher education achievement in online higher education. A systematic review. The Int. J. of Self-Directed Learning. 2015.\"\n\nThe slide appears to be part of a larger presentation, as there's a webcam feed visible in the top right corner, showing a person who seems to be the presenter.\n\nOverall, the slide effectively communicates the concept of procrastination and its potential consequences, using visual elements and a clear layout to convey the information."}, {"start": 90, "end": 120, "narrative": "The video displays a PowerPoint presentation slide about procrastination. The slide has a clean, professional design with a red header and a beige background. The main title \"PROcrastination\" is prominently featured in bold red letters.\n\nThe slide is divided into three main sections:\n\n1. On the left, there's a section labeled \"Intrinsic\" with a brain icon and arrows pointing to a stack of books. This likely represents internal motivations or factors contributing to procrastination.\n\n2. In the center, there's a figure of a person sitting at a desk with a speech bubble saying \"LATER.\" This central image seems to be the focal point of the slide, illustrating the concept of procrastination.\n\n3. On the right, there's a section labeled \"External\" with a computer monitor icon and a graph with an exclamation mark. This likely represents external factors or consequences of procrastination.\n\nAt the bottom of the slide, there's a reference to a study: \"The self-regulated learning of academically high-achieving students in online higher education environments. Self-regulated learning strategies and higher achievement online. Higher Education, 2015.\"\n\nThe slide appears to be part of a larger presentation, as there's a webcam feed visible in the top right corner showing a person giving the presentation. The presenter is wearing a black shirt and glasses, and there's a podium visible behind them.\n\nOverall, the slide effectively uses visual elements and labels to convey the concept of procrastination and its potential causes and consequences."}, {"start": 120, "end": 150, "narrative": "The video appears to be a presentation slide about procrastination. The slide has a red header with the word \"PROcrastination\" in white text. Below this, there's a diagram showing a person sitting at a desk with a stack of books labeled \"LATER\" next to them. To the right of the person, there's a computer monitor with a graph and an exclamation mark, suggesting potential consequences of procrastination.\n\nThe slide includes two labels: \"Intrinsic\" and \"External,\" likely referring to different types of procrastination. There's also a small icon of a brain with arrows pointing towards the stack of books.\n\nAt the bottom of the slide, there's a key question: \"How is procrastination related to educational inequality?\" This suggests the presentation is exploring the connection between procrastination and broader educational issues.\n\nThe slide has a clean, minimalist design with a white background and black text. It's presented in a professional format, likely part of a larger lecture or seminar on the topic of procrastination and its impacts on education."}, {"start": 150, "end": 180, "narrative": "The video displays a presentation slide with a key question about the relationship between procrastination and educational inequality. The slide has a clean, professional design with a red header that reads \"KEY QUESTION\" in white text. Below this, there's a question in a white circle with a red outline that asks, \"How is procrastination related to educational inequality?\"\n\nThe slide features two main visual elements:\n\n1. On the left side, there's an illustration of a person sitting at a desk with a stack of books in front of them. The person is holding a speech bubble that says \"LATER\" in white text.\n\n2. On the right side, there's a row of hands in various shades of gray, representing different skin tones. These hands are raised, possibly symbolizing a diverse group of people or students.\n\nThe background of the slide is a light beige color, and there's a pink horizontal line at the top of the slide. In the top right corner, there's a small image of a person sitting at a desk, likely representing the presenter.\n\nThe slide appears to be part of a larger presentation, possibly discussing the impact of procrastination on educational outcomes and how it might contribute to or exacerbate educational inequality. The use of diverse hand imagery suggests a focus on inclusivity and the varied experiences of different student populations.\n\nOverall, the slide is well-organized and visually appealing, effectively conveying the central question of the presentation."}, {"start": 180, "end": 210, "narrative": "The video displays a PowerPoint presentation slide with a red header that reads \"RESEARCH QUESTIONS\". Below this header, there are three main research questions presented in a list format:\n\n1. \"How does procrastination behavior vary across sociodemographic student groups?\"\n2. \"To what extent can procrastination behavior explain achievement gaps?\"\n3. \"How does the association between procrastination and achievement vary across sociodemographic student groups and courses of different sizes?\"\n\nThe slide appears to be part of a presentation on the topic of procrastination and its relationship to educational inequality. The background of the slide is white, and the text is in black.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor. This image is likely a placeholder for the presenter.\n\nThe slide seems to be part of a larger presentation, as there are navigation buttons visible at the bottom of the screen, including \"Previous\" and \"Next\" options.\n\nThe overall layout is clean and professional, with a clear focus on the research questions being presented. The use of a red header helps to draw attention to the main topic of the slide."}, {"start": 210, "end": 240, "narrative": "The video displays a PowerPoint presentation slide with a red header that reads \"RESEARCH QUESTIONS\" in white text. Below this header are three research questions related to procrastination behavior and its impact on student achievement:\n\n1. How does procrastination behavior vary across sociodemographic student groups?\n2. To what extent can procrastination behavior explain achievement gaps?\n3. How does the association between procrastination and achievement vary across sociodemographic student groups and courses of different sizes?\n\nThe slide appears to be part of a presentation on the topic of procrastination in academic settings, specifically focusing on its relationship with student demographics and achievement outcomes.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This suggests the presentation is being delivered in a virtual or online format.\n\nThe slide is well-organized and clearly presents the key research questions being addressed in the study. The use of a red header and white text makes the information easy to read and visually appealing."}, {"start": 240, "end": 270, "narrative": "The video displays a presentation slide titled \"RESEARCH CONTEXT\" with a red header. The slide appears to be part of a larger presentation, as there's a speaker visible in the top right corner of the screen.\n\nThe main content of the slide is divided into two sections:\n\n1. A bulleted list on the left side:\n   - Procrastination in online assignment\n   - Campus-wide learning management system\n   - LMS data as user submission records\n\n2. A table on the right side with the following columns:\n   - Sex\n   - First-generation college student\n   - URM (Underrepresented Minority) student\n   - Race/Ethnicity\n\nThe table contains data for 2,463,893 submissions, 26,567 students, and 2,153 courses. The data is presented in percentages and includes categories such as:\n- Sex: 52.8% female, 47.2% male\n- First-generation college student: 21.9%\n- URM student: 21.9%\n- Race/Ethnicity: Various categories including White, Black, Hispanic, Asian, Native American, and Unknown\n\nThe slide seems to be discussing research related to online learning, specifically focusing on procrastination and demographic data of students using a learning management system."}, {"start": 270, "end": 300, "narrative": "The video displays a PowerPoint presentation slide titled \"RESEARCH CONTEXT\" in bold red text. The slide appears to be part of a larger presentation, as evidenced by the \"7\" visible in the bottom right corner, indicating it's the seventh slide in the sequence.\n\nThe slide contains several key points:\n\n1. Procrastination in online assignment submissions\n2. Campus-wide learning management system (LMS) data\n3. Individual assignment submission records\n\nBelow these points, there's a section titled \"Sex\" with percentages for male and female students:\n- 52.5% female\n- 47.5% male\n\nAnother section titled \"First-generation college student\" shows:\n- 21.9% first-generation college students\n\nThe slide also includes a section on \"Race/Ethnicity\" with the following percentages:\n- 21.9% White\n- 18.7% International\n- 16.3% Asian\n- 10.6% Hispanic\n- 6.4% Black\n- 0.6% Native American\n- 3.6% Unknown\n\nThe slide has a clean, professional design with a white background and red accents. The text is clear and easy to read, making it suitable for a formal presentation setting.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, likely representing the presenter or the context of the presentation.\n\nOverall, this slide appears to be part of a research presentation focused on procrastination in online assignments, using data from a campus-wide learning management system to analyze student demographics and procrastination patterns."}, {"start": 300, "end": 330, "narrative": "The video displays a PowerPoint presentation slide titled \"Procrastination Score.\" The slide has a clean, professional design with a red header and a white background. The main content of the slide is divided into two sections:\n\n1. Procrastination Score: Defined as the within-assignment percentile rank in terms of lateness of submission.\n\n2. Assignment-level procrastination score: This section is partially visible, but the full content is not shown.\n\n3. Student-level procrastination score: This section is also partially visible, but the full content is not shown.\n\nThe slide appears to be part of a larger presentation, as there's a small video thumbnail in the top right corner showing a person giving a presentation. The presenter is wearing a black shirt and appears to be speaking into a microphone.\n\nThe slide number \"7\" is visible in the bottom right corner, indicating this is likely part of a longer presentation.\n\nOverall, the slide seems to be discussing methods for measuring procrastination in academic settings, specifically focusing on how late students submit their assignments."}, {"start": 330, "end": 360, "narrative": "The video displays a slide presentation focused on procrastination scores. The slide has a red header with \"PROcrastination Score\" in white text. Below the header, there are two bullet points explaining the concept:\n\n1. Procrastination Score: within-assignment percentile rank in terms of lateness of submission\n2. Assignment-level procrastination score: rank/(# of submissions)\n\nThe slide also includes a graph on the right side, which appears to be a scatter plot. The x-axis is labeled \"Assignment\" and the y-axis is labeled \"Procrastination Score.\" There are three data points on the graph, each representing a different student (student 1, student 2, and student 3).\n\nThe slide is presented by a person who is visible in the top right corner of the screen. They are wearing a black shirt and appear to be standing behind a podium or desk.\n\nThe slide is part of a larger presentation, as indicated by the \"7\" in the bottom right corner, suggesting this is the seventh slide in the sequence.\n\nOverall, the slide provides a clear and concise explanation of how procrastination scores are calculated and visualized, using both text and a simple graph to illustrate the concept."}, {"start": 360, "end": 390, "narrative": "The video displays a presentation slide titled \"PROcrastination Score\" with a red header. The slide is divided into two main sections:\n\n1. On the left side, there's a list of bullet points explaining the concept of procrastination scores:\n   - Procrastination Score: within-assignment percentile rank in terms of lateness of submission\n   - Assignment-level procrastination score: rank(τ_jc) / |S_jc|\n   - Student-level procrastination score: P_jc = 1 / |S_jc|\n\n2. On the right side, there's a graph titled \"Procrastination Score\" with a y-axis ranging from 0 to 0.8 and an x-axis labeled \"Assignment.\" The graph shows three lines representing different students (student 1, student 2, and student 3) over time, with data points marked by different colored dots.\n\nThe slide appears to be part of a larger presentation, as there's a webcam feed visible in the top right corner showing a person giving the presentation. The slide number \"7\" is visible in the bottom right corner, indicating this is likely part of a series of slides.\n\nThe graph seems to illustrate how different students' procrastination scores vary across assignments over time, providing a visual representation of their submission patterns."}, {"start": 390, "end": 420, "narrative": "The video displays a presentation slide titled \"Procrastination Score\" with a red header. The slide is divided into two main sections:\n\n1. On the left side, there's a list of bullet points explaining the concept of procrastination scores:\n   - Procrastination Score: within-assignment percentile rank in terms of lateness of submission\n   - Assignment-level procrastination score: rank(PE_jc) / |S_jc|\n   - Student-level procrastination score: PE_jc = 1 / |S_jc|\n\n2. On the right side, there's a graph titled \"Procrastination Score\" showing data for three students (student 1, student 2, and student 3). The x-axis represents time, while the y-axis shows the procrastination score. Each student's data is represented by a different colored line.\n\nThe slide appears to be part of a larger presentation, as there's a small video feed in the top right corner showing a person giving the presentation. The presenter is wearing a black shirt and is seated at a desk with a computer monitor and keyboard.\n\nThe slide seems to be discussing how procrastination behavior varies across different student groups, as suggested by the title \"How does procrastination behavior vary across sociodemographic student groups?\" visible at the bottom of the slide.\n\nOverall, the slide provides a clear and concise overview of how procrastination scores are calculated and visualized for different students, likely as part of a research study or educational analysis."}, {"start": 420, "end": 450, "narrative": "The video displays a PowerPoint presentation slide titled \"How does procrastination behavior vary across sociodemographic student groups?\" The slide has a clean, professional design with a white background and a red banner at the top. The title is written in black text, and there's a subtitle in red text that reads \"Inequality in Procrastination.\"\n\nThe main content of the slide is a scatter plot graph. The x-axis is labeled \"Mean Procrastination Score (1-5)\" and ranges from 0 to 1. The y-axis is labeled \"Student Subgroup\" and lists various categories such as \"Male,\" \"Female,\" \"First-Gen,\" \"IRFM,\" \"URM,\" \"Race/Ethnicity,\" and \"College Student.\"\n\nEach data point on the graph is represented by a colored dot, with different colors likely indicating different student subgroups. The dots are scattered across the graph, showing the distribution of procrastination scores among the various student groups.\n\nIn the top right corner of the slide, there's a small image of a person, possibly the presenter, along with a computer monitor and a keyboard. This suggests the slide is being presented in a virtual or online setting.\n\nThe slide appears to be part of a larger presentation on the topic of procrastination among students, specifically looking at how it varies based on different sociodemographic factors. The scatter plot provides a visual representation of the data, allowing for easy comparison of procrastination scores across different student groups."}, {"start": 450, "end": 480, "narrative": "The video displays a PowerPoint presentation slide titled \"INEQUALITY IN PROCRASTINATION.\" The slide is divided into two main sections:\n\n1. A scatter plot graph:\n   - The x-axis is labeled \"Mean Procrastination Score (1-5)\"\n   - The y-axis is labeled \"Student Subgroup\"\n   - The student subgroups listed on the y-axis include:\n     - Male\n     - Female\n     - First-Gen\n     - URM\n     - College Student\n     - Status\n     - Ethnicity\n   - The graph shows various colored dots representing different student subgroups, with each dot positioned at a specific point on the graph based on their mean procrastination score.\n\n2. A table labeled \"Table 2: Linear regression model predicting procrastination scores\":\n   - The table has two columns: \"Coefficient\" and \"Estimate (95% CI)\"\n   - The coefficients listed in the table include:\n     - Intercept\n     - SexMale\n     - First-Gen\n     - URM\n     - College Student\n     - Status\n     - Ethnicity\n   - Each coefficient has an associated estimate and 95% confidence interval.\n\nThe slide appears to be part of a presentation discussing the relationship between student demographics and procrastination behavior, using both a scatter plot and a regression model to analyze the data.\n\nIn the background, there's a blurred image of a person standing at a podium, suggesting this is likely a presentation being given at a conference or seminar."}, {"start": 480, "end": 510, "narrative": "The video appears to be a presentation slide deck discussing the topic of procrastination and its impact on achievement gaps. The slides are divided into two main sections:\n\n1. \"INEQUALITY IN PROCRASITNATION\" - This section presents a table showing a linear regression model predicting procrastination scores. The table includes coefficients and estimates for various factors such as sex, first-generation status, and different ethnic groups.\n\n2. \"TO WHAT EXTENT CAN PROCRASITNATION BEHAVIOR EXPLAIN ACHIEVEMENT GAPS?\" - This section seems to be exploring the relationship between procrastination and academic performance.\n\nThe slides are presented in a professional format with a red and white color scheme. The content appears to be part of a research presentation, likely discussing the role of procrastination in educational outcomes and how it contributes to achievement disparities among different demographic groups.\n\nThe video seems to be a recorded presentation, possibly from a conference or academic seminar. The presenter is visible in the top right corner of the screen, though their identity is not clear."}, {"start": 510, "end": 540, "narrative": "The video displays a PowerPoint presentation slide titled \"Procrastination's Explanatory Power on Performance.\" The slide has a clean, professional design with a white background and a red header. The title is prominently displayed in bold red text at the top of the slide.\n\nBelow the title, there's a table with two columns and multiple rows. The first column is labeled \"Hypothesis\" and contains various terms such as \"Intro,\" \"Pisces,\" \"Sec,\" \"SecFirst,\" \"SecSecond,\" \"Ethnic,\""}, {"start": 540, "end": 570, "narrative": "The video displays a PowerPoint presentation slide titled \"Procrastination's Explanatory Power on Performance.\" The slide has a clean, professional design with a white background and a red header. The main content of the slide is a table that appears to be discussing the relationship between procrastination and performance across different ethnic groups.\n\nThe table is organized into several columns, including:\n\n1. A column labeled \"Ethnicity\" listing various ethnic groups.\n2. A column labeled \"Procrastination\" with numerical values.\n3. A column labeled \"Performance\" with numerical values.\n\nThe ethnic groups listed in the table include:\n- Hispanic\n- Asian\n- Black\n- White\n- Native American\n- Pacific Islander\n- Other\n\nEach ethnic group has corresponding values in the \"Procrastination\" and \"Performance\" columns, though the specific numbers are not clearly visible in the image.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, likely representing the presenter or the context of the presentation.\n\nThe slide appears to be part of a larger discussion on how procrastination affects performance differently across various ethnic groups. This could be relevant in fields such as psychology, education, or workplace studies, where understanding the impact of procrastination on different populations is important.\n\nThe overall presentation style is professional and academic, suggesting that this slide is part of a formal research or educational presentation."}, {"start": 570, "end": 600, "narrative": "The video appears to be a presentation slide deck discussing the relationship between procrastination and performance. The slides are divided into two main sections:\n\n1. A table titled \"Procrastination's Explanatory Power on Performance\" which seems to be analyzing data across different ethnic groups. The table includes columns for \"Ethnicity,\" \"Procrastination,\" and \"Performance,\" with various numerical values and percentages.\n\n2. A visual diagram showing three circles representing \"Procrastination,\" \"Sociodemographic characteristics,\" and \"Performance.\" These circles are interconnected, suggesting a relationship between these factors.\n\nThe presentation seems to be exploring how procrastination affects performance, potentially across different ethnic groups, and how sociodemographic characteristics might play a role in this relationship. The slide deck appears to be part of a larger discussion on the impact of procrastination on academic or professional performance."}, {"start": 600, "end": 630, "narrative": "The video displays a PowerPoint presentation slide with a clean, professional design. The slide has a light beige background with a red horizontal line at the top, which serves as a header. Below this line, there are three large red circles arranged in a triangular formation.\n\nThe left circle is labeled \"Sociodemographic characteristics,\" the right circle is labeled \"Performance,\" and the top circle is labeled \"Procrastination.\" These circles are connected by red lines, indicating relationships between the concepts.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This appears to be a presenter or speaker for the presentation.\n\nAt the bottom of the slide, there's a question in black text that reads: \"HOW DOES THE ASSOCIATION BETWEEN PROcrastination AND ACHIEVEMENT VARY ACROSS SOCIODEMOGRAPHIC STUDENT GROUPS AND COURSES OF DIFFERENT SIZES?\"\n\nThe slide is numbered \"1\" in the bottom right corner, suggesting it's the first slide in a series.\n\nThe overall layout is simple and easy to understand, with a clear focus on the relationship between procrastination, sociodemographic characteristics, and performance. The use of red for the circles and lines creates a strong visual contrast against the light background, making the information stand out clearly."}, {"start": 630, "end": 660, "narrative": "The video displays a PowerPoint presentation slide with a red banner at the top containing the text \"Achievement Gaps Persist Regardless of Procrastination.\" Below this banner, there's a graph titled \"Mean Grade Performance\" with a y-axis labeled \"Mean Grade Performance\" and an x-axis labeled \"Procrastination Score.\"\n\nThe graph shows three lines representing different groups:\n1. A blue line labeled \"Cont. - Non-URM\"\n2. A green line labeled \"First-Gen - URM\"\n3. A yellow line labeled \"First-Gen - Non-URM\"\n\nAll three lines exhibit a consistent downward trend, indicating a negative relationship between procrastination and performance across all groups. This suggests that as procrastination scores increase, mean grade performance decreases for all represented groups.\n\nThe slide also includes bullet points summarizing the key findings:\n- \"Consistent negative relationship between procrastination and performance\"\n- \"Significant achievement gaps after controlling for procrastination\"\n\nThe background of the slide is white, and the text is black. The presenter's image is visible in the top right corner of the slide, but no other details about the presenter are provided.\n\nThis slide appears to be part of a presentation discussing the impact of procrastination on academic performance, particularly highlighting persistent achievement gaps across different demographic groups even when controlling for procrastination levels."}, {"start": 660, "end": 690, "narrative": "The video displays a slide presentation with a red banner at the top that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION\". Below this banner is a graph titled \"Mean Grade Performance\" with a y-axis labeled \"Mean Grade Performance\" and an x-axis labeled \"Procrastination Score\". The graph shows three lines representing different data sets: \"Cont. - Non-RM\", \"First - Non-RM\", and \"First - RM\". These lines appear to show a negative correlation between procrastination and performance.\n\nTo the left of the graph, there are two bullet points:\n1. \"Consistent negative relationship between procrastination and performance\"\n2. \"Significant achievement gaps after controlling for procrastination\"\n\nThe slide is presented by a person who is visible in the top right corner of the video. They are seated at a desk with a computer monitor and a keyboard in front of them. The presenter appears to be a man with short dark hair, wearing a dark shirt.\n\nThe slide seems to be part of a larger presentation on the impact of procrastination on academic performance, highlighting that even when controlling for procrastination, there are still significant achievement gaps."}, {"start": 690, "end": 720, "narrative": "The video appears to be a presentation slide from a lecture or conference. It's divided into two main sections:\n\nThe upper section has a red header with white text that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION.\" Below this, there are two bullet points:\n1. \"Consistent negative relationship between procrastination and performance\"\n2. \"Significant achievement gaps after controlling for procrastination\"\n\nThe lower section is titled \"PROCRASTINATION - PERFORMANCE VARIATION ACROSS COURSES\" in red text. It contains a scatter plot graph with the following axes:\n- X-axis: Procrastination Score (0 to 1)\n- Y-axis: Course Enrollment (0 to 1000)\n\nThe graph shows a dense cluster of data points, with a red line indicating the average procrastination score. There's also a caption that reads \"Figure 9: Course enrollment-grade correlation (r = 0.27) and procrastination score (r = 0.27) shown in red line.\"\n\nThe slide is presented by a person whose face is visible in the top right corner of the screen. The background is white, and the overall presentation style is professional and academic.\n\nThis slide seems to be discussing the relationship between procrastination and academic performance, highlighting that achievement gaps persist even when controlling for procrastination behavior. The scatter plot likely illustrates how procrastination scores vary across different courses and their enrollment numbers."}, {"start": 720, "end": 750, "narrative": "The video appears to be a presentation slide about procrastination and its impact on academic performance across different courses. The slide is titled \"PROcrastination - Performance Variation Across Courses\" and features a scatter plot graph.\n\nThe graph shows a correlation between course enrollment and procrastination scores, with a red line indicating a correlation coefficient of 0.25. The x-axis represents procrastination scores, while the y-axis shows course enrollment.\n\nBelow the graph, there's a caption that reads: \"Figure: Procrastination (Grade Score) (Paran) and course enrollment grade score correlation (0.25) and in red line.\"\n\nThe slide seems to be part of a larger presentation, as there's a webcam view of the presenter in the top right corner. The presenter is wearing a black shirt and appears to be seated at a desk with a computer monitor.\n\nThe slide is numbered 14, indicating it's part of a longer presentation. The overall design is professional, with a red header and a beige background for the main content area.\n\nThis slide appears to be discussing how procrastination behavior varies across different courses and its impact on student performance. The scatter plot suggests there's a positive correlation between procrastination scores and course enrollment, though the correlation coefficient is relatively low at 0.25."}, {"start": 750, "end": 780, "narrative": "The video displays a PowerPoint presentation slide with a red header that reads \"SUMMARY OF FINDINGS\". Below this header are three bullet points:\n\n1. \"Low-SES students exhibit more procrastination behavior than their counterparts.\"\n2. \"Procrastination behavior explains 20% of variation in achievement gaps.\"\n3. \"Constant negative relationship across sociodemographic groups and at different levels of procrastination\"\n\nThe slide appears to be discussing the relationship between socioeconomic status (SES), procrastination behavior, and academic achievement gaps.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This suggests the presentation is being given by someone in a virtual or remote setting.\n\nThe slide is numbered \"17\" in the bottom right corner, indicating it's part of a larger presentation.\n\nThe overall design is simple and professional, with a clean layout and easy-to-read text. The red header stands out against the white background, drawing attention to the key findings being presented."}, {"start": 780, "end": 810, "narrative": "The video displays a PowerPoint presentation slide titled \"Procrastination and Performance.\" The slide has a clean, professional design with a red header and a light beige background. The main content of the slide consists of two bullet points:\n\n1. \"One of the largest scale behavioral analysis of procrastination\"\n2. \"Negative association consistent across sociodemographic groups and performance levels\"\n\nThe slide appears to be part of a larger presentation, as there's a small video thumbnail in the top left corner showing a person giving the presentation. The presenter is wearing a black shirt and appears to be speaking into a microphone.\n\nThe slide number \"19\" is visible in the bottom right corner, indicating this is part of a longer presentation. The overall layout is simple and easy to read, focusing on delivering key information about the relationship between procrastination and performance.\n\nThis slide seems to be summarizing the findings of a significant study on procrastination, highlighting that the negative impact of procrastination on performance is consistent across different demographic groups and performance levels."}, {"start": 810, "end": 840, "narrative": "The video displays a PowerPoint presentation slide with a red header that reads \"UNEQUAL EDUCATIONAL EXPERIENCES.\" Below the header, there are two bullet points:\n\n1. \"Procrastination as a system issue\"\n2. \"Procrastination as a behavioral antecedent of educational inequality\"\n\nThe slide appears to be part of a larger presentation, as there's a small video thumbnail in the top right corner showing a person giving the presentation. The presenter is wearing a black shirt and appears to be seated at a desk.\n\nThe slide has a clean, professional design with a white background and black text. The red header stands out prominently against the white background, drawing attention to the topic of unequal educational experiences.\n\nThe content of the slide suggests that the presentation is likely discussing the impact of procrastination on educational outcomes, particularly how it contributes to educational inequality. The bullet points indicate that the presenter will be addressing procrastination both as a systemic issue within the education system and as a behavioral factor that leads to unequal educational experiences for different students."}, {"start": 840, "end": 870, "narrative": "The video appears to be a presentation slide from a lecture or conference. The slide is titled \"UNEQUAL EDUCATIONAL EXPERIENCES\" in bold red text at the top. Below the title, there are two bullet points:\n\n1. Procrastination as a system issue\n2. Procrastination as a behavioral antecedent of educational inequality\n\nThe slide has a clean, professional design with a white background and a red header. There's a small image of a person in the top right corner, likely the presenter.\n\nThe slide number \"20\" is visible in the bottom right corner, indicating this is part of a larger presentation.\n\nThe content suggests the presentation is discussing the impact of procrastination on educational outcomes, particularly how it contributes to educational inequality. The presenter seems to be exploring procrastination from both systemic and behavioral perspectives.\n\nOverall, the slide is well-organized and visually appealing, with a clear focus on the topic of unequal educational experiences and the role of procrastination in this context."}, {"start": 870, "end": 900, "narrative": "The video appears to be a presentation slide deck. The slides have a clean, professional design with a white background and a red header. The main content is presented in black text on a light beige background.\n\nThe first slide is titled \"PRACTICAL IMPLICATIONS\" in bold red letters. Below the title, there are two bullet points:\n\n1. \"Simple measure task submission timestamps\"\n2. \"Minimal assumptions about courses\"\n\nThe second slide is titled \"QUESTIONS\" in red letters. It has a blank space below the title, likely for the presenter to write or type in questions during the presentation.\n\nIn the top right corner of each slide, there's a small image of a person, which is likely the presenter. This image is repeated on each slide, suggesting it's part of the presentation template.\n\nThe slides seem to be part of a professional presentation, possibly for a business or academic setting. The content suggests the presentation is discussing practical implications of some kind of task or course management system, focusing on simple timestamp measurements and minimal assumptions about courses."}, {"start": 900, "end": 930, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. Below this bar, the word \"QUESTIONS\" is prominently displayed in bold, red text.\n\nThe slide appears to be part of a virtual meeting or webinar, as evidenced by the small video feed in the top left corner showing a person's face. In the top right corner, there's a small icon of a person sitting at a desk with a computer monitor, likely representing the presenter or host of the session.\n\nThe overall layout is simple and professional, designed to focus attention on the \"QUESTIONS\" prompt. This suggests that the slide is being used to invite participants to ask questions or engage in discussion during the presentation.\n\nThe slide's design is consistent across multiple frames, indicating it's being used as a transition or prompt slide during the virtual meeting."}, {"start": 930, "end": 960, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. Below this bar, the word \"QUESTIONS\" is prominently displayed in bold, red text.\n\nThe slide appears to be part of a virtual meeting or webinar, as evidenced by the small video feed in the top left corner showing a person's face. In the top right corner, there's a small icon of a person sitting at a desk with a computer monitor, likely representing the presenter or host of the meeting.\n\nThe overall layout is simple and professional, designed to focus attention on the \"QUESTIONS\" prompt. This suggests that the slide is being used to invite participants to ask questions or engage in discussion during the presentation.\n\nThe slide's design is consistent across multiple frames, indicating it's being used as a transition or prompt slide during the virtual meeting."}, {"start": 960, "end": 990, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three distinct colors: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the colored bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this red rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small icon of a person sitting at a desk with a computer. This icon is likely representing the presenter or speaker.\n\nThe slide appears to be part of a virtual presentation, as evidenced by the black background surrounding the slide. This suggests the presentation is being viewed on a computer screen or projected onto a larger display.\n\nOverall, the slide is simple and straightforward, likely used to prompt questions or discussion during a presentation. The use of bold colors and clear text makes it easy to read and understand at a glance."}, {"start": 990, "end": 1020, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small icon of a person sitting at a desk with a computer. This icon is likely a placeholder for the presenter or speaker.\n\nThe slide appears to be part of a larger presentation, possibly for a business or educational setting. The simple design and clear focus on the word \"QUESTIONS\" suggest it's being used to prompt audience interaction or discussion.\n\nOverall, the slide is visually uncluttered and easy to read, with a clear emphasis on the word \"QUESTIONS\" to encourage engagement from the audience."}, {"start": 1020, "end": 1050, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small icon of a person sitting at a desk with a computer. This icon is likely a placeholder for the presenter or speaker.\n\nThe slide appears to be part of a larger presentation, possibly for a business or educational setting. The simple design and clear focus on the word \"QUESTIONS\" suggest it's being used to prompt audience interaction or discussion.\n\nOverall, the slide is visually uncluttered and easy to read, with a clear emphasis on the word \"QUESTIONS\" to encourage engagement from the audience."}, {"start": 1050, "end": 1080, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three distinct colors: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the colored bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this red rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small image of a person's face, likely the presenter or speaker. Next to this image, there are two icons: a computer monitor and a keyboard, which could represent a virtual or remote presentation setup.\n\nThe slide appears to be part of a professional presentation, possibly for a business or educational setting. The use of a single word \"QUESTIONS\" suggests that this slide is likely used to prompt audience interaction or to indicate the start of a Q&A session.\n\nThe overall design is simple and uncluttered, focusing attention on the key message of \"QUESTIONS\" and the presenter's image."}, {"start": 1080, "end": 1110, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. Below this bar, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nThe bottom section of the slide contains a large red rectangle, which appears to be a placeholder for additional content or a question box. This red rectangle is the most eye-catching element on the slide.\n\nIn the top right corner of the slide, there's a small image of a person's face, likely the presenter or speaker. Next to this image are three icons: a computer monitor, a keyboard, and a mouse, which are probably representing the presenter's computer setup.\n\nThe slide has a professional and organized appearance, suggesting it's part of a formal presentation or lecture. The use of a red rectangle in the bottom section could indicate that this slide is specifically designed for a Q&A session or to prompt questions from the audience.\n\nOverall, the slide is simple yet effective in its design, with a clear focus on the \"QUESTIONS\" text and the red rectangle, which likely serves as a visual cue for the audience to ask questions or engage with the presenter."}, {"start": 1110, "end": 1140, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. Below this bar, the word \"QUESTIONS\" is prominently displayed in bold, red text.\n\nThe slide appears to be part of a virtual meeting or webinar, as evidenced by the small video window in the top left corner showing a person's face. This suggests the presentation is being delivered remotely.\n\nIn the top right corner of the slide, there's a small icon that looks like a computer monitor with a person's face, likely representing the presenter or speaker.\n\nThe overall layout is simple and professional, designed to focus attention on the \"QUESTIONS\" text, which is presumably the topic or section of the presentation. The slide seems to be used to prompt discussion or gather input from the audience during the virtual meeting."}, {"start": 1140, "end": 1170, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. Below this bar, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nThe bottom section of the slide contains a large red rectangle that spans the width of the slide. This rectangle appears to be a placeholder for additional content, possibly where questions or discussion points would be written during a presentation.\n\nIn the top right corner of the slide, there's a small image of a person, likely the presenter. This image is accompanied by a text box that reads \"Video Guest: [Name]\" (the name is not visible in the image).\n\nThe slide has a professional and organized appearance, suggesting it's part of a formal presentation or lecture. The use of color in the horizontal bar at the top adds a touch of visual interest without distracting from the main content.\n\nOverall, this slide seems to be designed for a presentation where questions or discussion points are a key part of the content, possibly for a Q&A session or interactive lecture."}, {"start": 1170, "end": 1200, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small icon of a person sitting at a desk with a computer. This icon is likely representing the presenter or speaker.\n\nThe slide appears to be part of a larger presentation, possibly for a business or educational setting. The simple design and clear focus on the word \"QUESTIONS\" suggest this slide is used to prompt audience participation or to indicate the start of a Q&A session.\n\nThe overall layout is professional and easy to read, with a clear hierarchy of information. The use of color in the bar at the top adds a subtle visual interest without distracting from the main message of the slide."}, {"start": 1200, "end": 1230, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three colored segments: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This appears to be a presenter or speaker for the presentation.\n\nThe slide has a professional and organized appearance, likely used in a business or academic setting. The use of color in the horizontal bar at the top adds a touch of visual interest to an otherwise simple design."}, {"start": 1230, "end": 1260, "narrative": "The video displays a PowerPoint presentation slide with a clean, minimalist design. The background is a light beige color, and the slide is divided into two main sections. The top section features a horizontal bar with three distinct colors: red, gray, and pink. This bar spans the width of the slide.\n\nBelow the colored bar, there's a large red rectangle that occupies the bottom half of the slide. Inside this red rectangle, the word \"QUESTIONS\" is prominently displayed in bold, black text.\n\nIn the top right corner of the slide, there's a small image of a person. This appears to be a presenter or speaker, likely the individual who created or is presenting this slide.\n\nThe slide has a professional and organized appearance, suggesting it's part of a formal presentation or lecture. The use of a single word \"QUESTIONS\" indicates that this slide is likely used to prompt audience participation or to signal the end of a presentation segment.\n\nOverall, the slide is simple yet effective in its design, focusing on clarity and ease of understanding."}, {"start": 1260, "end": 1290, "narrative": "The video appears to be a presentation slide from a virtual conference. The slide has a clean, professional design with a white background and a red header that reads \"QUESTIONS\" in bold black text. Below this, there's a red horizontal bar that spans the width of the slide.\n\nThe slide is divided into two sections:\n\n1. The top section contains a red header with the word \"QUESTIONS\" in black text. Below this, there's a red horizontal bar that spans the width of the slide.\n\n2. The bottom section is divided into two parts:\n   - On the left, there's a red header with the text \"SUMMARY OF FINDINGS\" in black text. Below this, there are three bullet points:\n     1. \"Low-SES students exhibit more procrastination behavior than their counterparts.\"\n     2. \"Procrastination behavior explains 20% of variation in achievement gaps.\"\n     3. \"Constant negative relationship across sociodemographic groups and at different levels of procrastination.\"\n   - On the right, there's a graph titled \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROcrastination.\" The graph shows a consistent negative relationship between procrastination and performance, with significant achievement gaps remaining even after controlling for procrastination.\n\nThe slide is presented by a speaker named \"Vivian Guest\" as indicated by the text in the top right corner of the slide. The slide number is 17, suggesting this is part of a larger presentation.\n\nThe overall design is simple and effective, using a limited color palette of red, black, and white to highlight key information. The slide appears to be discussing the impact of procrastination on academic achievement, particularly among students from lower socioeconomic status (SES) backgrounds."}, {"start": 1290, "end": 1320, "narrative": "The video displays a slide presentation focused on the topic of procrastination and its impact on achievement gaps. The slide has a clean, professional design with a white background and a red header that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION.\"\n\nThe main content of the slide is divided into two sections:\n\n1. A bulleted list on the left side:\n   - \"Consistent negative relationship between procrastination and performance\"\n   - \"Significant achievement gaps after controlling for procrastination\"\n\n2. A graph on the right side, which appears to be a line chart. The x-axis is labeled \"Procrastination Score,\" ranging from 0 to 1. The y-axis is labeled \"Mean Grade,\" with values from 0 to 4. The graph shows three lines representing different data sets:\n   - A blue line labeled \"Cont. - Non-RM\"\n   - A green line labeled \"First - Non-RM\"\n   - A red line labeled \"First - URM\"\n\nThe slide is presented by a person whose upper body is visible in the top right corner of the screen. They are wearing a dark shirt and appear to be seated at a desk with a computer monitor in front of them.\n\nThe slide seems to be part of a larger presentation, possibly discussing the effects of procrastination on academic performance and how it contributes to achievement gaps, even when other factors are controlled for."}, {"start": 1320, "end": 1350, "narrative": "The video displays a slide presentation focused on the topic of procrastination and its impact on achievement gaps. The slide has a clean, professional design with a white background and a red header that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION.\"\n\nThe main content of the slide is divided into two sections:\n\n1. A bulleted list on the left side:\n   - \"Consistent negative relationship between procrastination and performance\"\n   - \"Significant achievement gaps after controlling for procrastination\"\n\n2. A graph on the right side, which appears to be a line chart. The x-axis is labeled \"Procrastination Score,\" ranging from 0 to 1. The y-axis is labeled \"Mean Grade,\" with values from 0 to 4. The graph shows three lines representing different data sets:\n   - A blue line labeled \"Cont. - Non-RM\"\n   - A green line labeled \"First - Non-RM\"\n   - A red line labeled \"First - URM\"\n\nThe slide is presented by a person who is visible in the top right corner of the screen. They are seated at a desk with a computer monitor and a keyboard in front of them. The presenter appears to be a man with short dark hair, wearing a dark shirt.\n\nThe slide is part of a larger presentation, as indicated by the \"Version 1.0\" text in the bottom right corner. This suggests it's an early version of the presentation material.\n\nThe overall tone of the slide is academic and research-oriented, likely from a lecture or conference presentation on educational psychology or related fields. The content emphasizes the persistent nature of achievement gaps even when accounting for procrastination, highlighting the complex relationship between these factors in academic performance."}, {"start": 1350, "end": 1380, "narrative": "The video displays a PowerPoint presentation slide with a red header that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION.\" Below this header, there are two bullet points:\n\n1. \"Consistent negative relationship between procrastination and performance\"\n2. \"Significant achievement gaps after controlling for procrastination\"\n\nThe slide includes a graph with a blue line and a green line, both showing a downward trend. The x-axis is labeled \"Procrastination Score,\" ranging from 0 to 1, while the y-axis is labeled \"Mean Grade Performance,\" ranging from 0 to 1.\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This appears to be a webcam feed, likely showing the presenter of the presentation.\n\nThe slide is numbered \"13\" in the bottom right corner, indicating it's part of a larger presentation. The overall design is professional and academic in nature, suggesting this is likely a presentation on educational psychology or a related field."}, {"start": 1380, "end": 1410, "narrative": "The video displays a slide presentation with a red banner at the top that reads \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION\". Below this banner is a graph titled \"Mean Grade Performance\" with a y-axis labeled \"Mean Grade Performance\" and an x-axis labeled \"Procrastination Score\". The graph shows three lines representing different data sets: \"Cont. - Non-RM\", \"First - Non-RM\", and \"First - RM\". These lines show a consistent negative relationship between procrastination and performance.\n\nThe slide also includes two bullet points:\n1. \"Consistent negative relationship between procrastination and performance\"\n2. \"Significant achievement gaps after controlling for procrastination\"\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor and keyboard. This appears to be a video feed of the presenter, who is likely giving a lecture or presentation on the topic of procrastination and its impact on academic performance.\n\nThe slide is part of a larger presentation, as indicated by the \"Version 1.0\" text in the bottom right corner. This suggests it's an early draft or first iteration of the presentation content.\n\nThe overall presentation seems to be focused on the negative effects of procrastination on academic performance, highlighting that even when controlling for procrastination, significant achievement gaps persist."}, {"start": 1410, "end": 1440, "narrative": "The video displays a PowerPoint presentation slide with a red banner at the top containing the title \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION.\" Below the title, there are two bullet points:\n\n1. \"Consistent negative relationship between procrastination and performance\"\n2. \"Significant achievement gaps after controlling for procrastination\"\n\nThe slide includes a graph with a blue line and a green line, both showing a downward trend. The x-axis is labeled \"Procrastination Score,\" ranging from 0 to 1, while the y-axis is labeled \"Mean Grade Percentage,\" ranging from 0 to 100.\n\nIn the top right corner of the slide, there's a small inset image showing a person sitting at a desk with a computer monitor in front of them. This inset appears to be a webcam feed, likely from the presenter's computer.\n\nThe slide is presented by a person who is visible in the webcam feed, suggesting this is a live presentation or webinar. The presenter is seated at a desk with a computer monitor in front of them, which is consistent with the inset image on the slide.\n\nThe overall presentation appears to be discussing the impact of procrastination on academic performance, highlighting that even when controlling for procrastination, significant achievement gaps persist."}, {"start": 1440, "end": 1470, "narrative": "The video appears to be a presentation slide from a lecture or conference. It's divided into two main sections:\n\nThe first section is titled \"ACHIEVEMENT GAPS PERSIST REGARDLESS OF PROCRASTINATION\" and contains a graph showing a consistent negative relationship between procrastination and performance. It also mentions significant achievement gaps after controlling for procrastination.\n\nThe second section is titled \"PROCRASTINATION - PERFORMANCE VARIATION ACROSS COURSES\" and features a scatter plot comparing course enrollment size to grade score. The plot shows a correlation between procrastination and performance across different courses.\n\nThe slide is presented by a speaker named Victor Ceballos, as indicated by the watermark in the top right corner. The background is white, and the text is in black and red.\n\nThe slide seems to be discussing the impact of procrastination on academic performance, highlighting that achievement gaps persist even when controlling for procrastination behavior. It also appears to be exploring how procrastination affects performance differently across various courses, potentially depending on factors like class size."}, {"start": 1470, "end": 1500, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide features a scatter plot graph with the following elements:\n\nX-axis: Labeled \"Procrastination (Grade: Score)\"\nY-axis: Labeled \"Course Enrollment (log scale)\"\n\nThe graph shows a dense cluster of black dots, representing data points. There's a red line running diagonally from the bottom left to the top right of the graph, which appears to be a trend line or line of best fit.\n\nThe slide includes a caption that reads:\n\"Figure: Procrastination (Grade: Score) and Course Enrollment (log scale) average = 7.5 shown in red line\"\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, likely representing the presenter of the presentation.\n\nThe slide is part of a larger presentation, as indicated by the \"16\" in the bottom right corner, suggesting it's the 16th slide in the deck.\n\nThe overall layout is clean and professional, with a white background and a red header at the top of the slide. The graph appears to be analyzing the relationship between procrastination scores and course enrollment numbers, possibly in an educational context."}, {"start": 1500, "end": 1530, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment.\" It shows a correlation between procrastination and course enrollment, with the x-axis labeled \"Procrastination (Grade Score) (Parson)\" and the y-axis labeled \"Course Enrollment.\"\n\nThe data points are represented by small black dots scattered across the graph. There's a red line visible, which likely represents the average or trend line for the data.\n\nBelow the graph, there's a caption that reads: \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment. Course enrollment (grade score) correlation (r = 0.25) and in red line scale average = 7.5.\"\n\nThe slide appears to be part of a larger presentation, as there's a small video player window visible in the top right corner of the screen. This suggests the slide is being shown during a live presentation or webinar.\n\nThe overall design of the slide is simple and effective, focusing on presenting the data clearly and concisely. The use of a scatter plot allows for a visual representation of the relationship between procrastination and course enrollment, making it easier for the audience to understand the correlation being presented."}, {"start": 1530, "end": 1560, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment.\" It shows a scatter plot with two axes:\n\nX-axis: Procrastination (Grade Score) (Parson)\nY-axis: Course Enrollment\n\nThe data points are represented by small black dots scattered across the graph. There's a red line visible in the graph, which likely represents a trend or average.\n\nBelow the graph, there's a caption that reads: \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment. Course enrollment (log scale) and grade score (Parson) shown in red line.\"\n\nThe slide appears to be part of a larger presentation, as there's a small video player window visible in the top right corner of the screen. This suggests the slide is being displayed during a live presentation or webinar.\n\nThe overall design of the slide is simple and effective, focusing on presenting the data clearly and concisely. The use of a log scale for course enrollment allows for better visualization of a wide range of values."}, {"start": 1560, "end": 1590, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure 9: Course Enrollment - Grade Score (Parson) and Course Enrollment - Grade Score (Parson) in red line.\" It has two axes:\n- The x-axis is labeled \"Course Enrollment - Grade Score (Parson)\" and ranges from -0.5 to 0.5.\n- The y-axis is labeled \"Course Enrollment - Grade Score (Parson)\" and ranges from 0 to 1000.\n\nThe graph shows a dense cluster of black dots, representing data points. There's also a red line visible on the graph, which appears to be a trend line or average line.\n\nBelow the graph, there's a caption that reads: \"Figure 9: Course Enrollment - Grade Score (Parson) and Course Enrollment - Grade Score (Parson) in red line.\"\n\nThe slide appears to be part of a larger presentation, as there's a small video player window visible in the top right corner of the screen. This suggests the slide is being displayed during a live presentation or webinar.\n\nThe overall design of the slide is simple and focused, with the scatter plot being the main point of interest. The use of a red line on the graph likely indicates a significant trend or average that the presenter wants to highlight in relation to procrastination and performance across different courses."}, {"start": 1590, "end": 1620, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header. The main content of the slide is a scatter plot graph, which appears to be the focal point of the presentation.\n\nThe scatter plot is titled \"Figure: Procrastination (Grade Score) vs. Course Enrollment.\" It has two axes:\n- The x-axis is labeled \"Procrastination (Grade Score)\" and ranges from -0.5 to 0.5.\n- The y-axis is labeled \"Course Enrollment\" and ranges from 0 to 1000.\n\nThe graph shows a dense cluster of black dots, representing data points. There's a red line running diagonally across the graph, which likely represents a trend or correlation between procrastination and course enrollment.\n\nBelow the graph, there's a caption that reads: \"Figure: Procrastination (Grade Score) vs. Course Enrollment. Course enrollment is shown in red line.\"\n\nThe slide appears to be part of a larger presentation, as there's a small video thumbnail in the top right corner showing a person giving a presentation. This suggests that the slide is being used in a live presentation or webinar.\n\nThe overall design of the slide is simple and effective, focusing on presenting the data clearly and concisely. The use of a scatter plot allows for a visual representation of the relationship between procrastination and course enrollment, which is likely the main point of the presentation."}, {"start": 1620, "end": 1650, "narrative": "The video displays a presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional design with a white background and a red header. The main content of the slide is a scatter plot graph that shows the relationship between course enrollment and grade score.\n\nThe scatter plot has two axes:\n- The x-axis is labeled \"Grade Score (Paran)\" and ranges from -0.5 to 0.5.\n- The y-axis is labeled \"Course Enrollment (log scale)\" and ranges from 0 to 1000.\n\nThe graph is filled with numerous black dots, representing data points. There's a red line running diagonally across the graph, which appears to be a trend line or average line.\n\nBelow the graph, there's a caption that reads:\n\"Figure: Procrastination (Grade Score) and Course Enrollment (log scale) average = 5.5\"\n\nThe slide also includes a small image of a person in the top right corner, likely the presenter of the presentation.\n\nThe overall layout is well-organized, with clear labels and a concise title that effectively summarizes the content of the slide. The use of a log scale on the y-axis allows for better visualization of data points across a wide range of course enrollments."}, {"start": 1650, "end": 1680, "narrative": "The video displays a presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a beige background with a red header at the top. The main content of the slide is a scatter plot graph.\n\nThe graph shows a relationship between course enrollment and grade score. The x-axis is labeled \"Grade Score (Parson)\" and ranges from -0.5 to 0.5. The y-axis is labeled \"Course Enrollment (log scale)\" and ranges from 0 to 1000.\n\nThe data points are densely packed in the center of the graph, forming a cloud-like pattern. There's a red line running diagonally from the bottom left to the top right of the graph, which appears to be a trend line or average line.\n\nBelow the graph, there's a caption that reads: \"Figure: Procrastination (Grade Score) vs. Course Enrollment (log scale). Average = 0.5.\"\n\nIn the top right corner of the slide, there's a small image of a person giving a presentation, along with a name tag that reads \"Victor C. Chen.\"\n\nThe slide appears to be part of a larger presentation, possibly discussing how procrastination affects performance in different courses, with a focus on the relationship between course enrollment size and grade scores."}, {"start": 1680, "end": 1710, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header at the top. \n\nThe main content of the slide is a scatter plot graph. The x-axis is labeled \"Procrastination (Grade: Score)\" and ranges from -0.5 to 0.5. The y-axis is labeled \"Course Enrollment (log scale)\" and ranges from 0 to 1000. The graph shows a dense cluster of black dots, indicating data points for various courses.\n\nA red line runs diagonally across the graph, likely representing a trend or correlation between procrastination scores and course enrollment. The graph appears to show a negative correlation, suggesting that higher procrastination scores are associated with lower course enrollments.\n\nIn the bottom right corner of the slide, there's a caption that reads: \"Figure: Procrastination (Grade: Score) and Course Enrollment (log scale) average = 5.5.\" This provides additional context about the data presented in the graph.\n\nThe slide is presented in a virtual conference setting, as evidenced by the video feed in the top right corner showing a presenter and a computer screen. The presenter appears to be a man with short hair, wearing a dark shirt, and is seated at a desk with a computer monitor.\n\nThe slide number \"16\" is visible in the bottom right corner, indicating this is part of a larger presentation. The overall presentation style is professional and academic, likely used in an educational or research context to discuss the relationship between procrastination and course performance."}, {"start": 1710, "end": 1740, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional design with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure: Procrastination (Grade Score) Correlation (Pearson r) and Course Enrollment.\" It shows a correlation between procrastination and grade scores across different courses, with course enrollment as a variable.\n\nThe x-axis of the graph is labeled \"Procrastination (Grade Score)\" and ranges from -0.5 to 0.5. The y-axis is labeled \"Course Enrollment\" and ranges from 0 to 1000.\n\nThe data points are represented by black dots scattered across the graph. There's a red line that appears to be a trend line or average line, showing the general correlation between procrastination and course enrollment.\n\nThe slide includes a caption that reads: \"Figure: Procrastination (Grade Score) Correlation (Pearson r) and Course Enrollment. Course enrollment is shown in red line.\"\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, likely representing the presenter of the slide.\n\nThe slide appears to be part of a larger presentation, possibly discussing the impact of procrastination on academic performance across different courses and how course enrollment might influence this relationship."}, {"start": 1740, "end": 1770, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional layout with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment.\" It shows a scatter plot with two axes:\n\nX-axis: Procrastination (Grade Score) (Parson)\nY-axis: Course Enrollment\n\nThe data points are represented by black dots scattered across the graph. There's a red line visible in the graph, which appears to be a trend line or average line.\n\nThe slide includes a caption that reads: \"Figure: Procrastination (Grade Score) (Parson) and Course Enrollment. Course enrollment (grade score) correlation (r = 0.25) and in red line scale average = 7.5.\"\n\nIn the top right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, likely representing the presenter or the context of the presentation.\n\nThe slide appears to be part of a larger presentation, possibly discussing the relationship between procrastination and academic performance across different courses. The red line in the graph suggests there's a correlation between procrastination and course enrollment, though the exact nature of this correlation isn't specified in the visible portion of the slide.\n\nOverall, the slide provides a visual representation of data related to procrastination and its impact on course enrollment, using a scatter plot to illustrate the relationship between these two variables."}, {"start": 1770, "end": 1800, "narrative": "The video displays a PowerPoint presentation slide titled \"PROcrastination - Performance Variation Across Courses.\" The slide has a clean, professional design with a white background and a red header. The main content of the slide is a scatter plot graph.\n\nThe graph is titled \"Figure: Procrastination (Grade Score) vs. Course Enrollment.\" It shows a correlation between procrastination and course enrollment, with a negative correlation coefficient of -0.25. The x-axis represents procrastination scores, ranging from -0.5 to 0.5, while the y-axis shows course enrollment numbers, ranging from 0 to 1000.\n\nThe scatter plot is filled with numerous black dots, indicating data points. A red line runs through the middle of the graph, likely representing the average or trend line. The graph shows a slight negative correlation, suggesting that as procrastination increases, course enrollment tends to decrease.\n\nIn the bottom right corner of the slide, there's a small image of a person sitting at a desk with a computer monitor, possibly representing the presenter or the context of the presentation.\n\nThe slide appears to be part of a larger presentation, as indicated by the \"16\" in the bottom right corner, suggesting it's the 16th slide in the deck.\n\nOverall, the slide provides a clear visual representation of the relationship between procrastination and course enrollment, using a scatter plot to illustrate the data and correlation."}]